<?php include '../include/head_cinema.php'; ?>
<title>Фильм Кулак ярости / Fist of Fury / 1972</title>
<meta name='description' content='Как сделать с помощью HTML, CSS, JavaScript? Готовые решения для сайта. Сниппеты. Примеры кода. Уроки W3Schools на русском'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_cinema.php'; ?>
<?php include '../include/before_content_cinema.php'; ?>

<article>
    <div style="max-width:1000px;margin:auto;">
        <h1>Фильм Кулак ярости / Fist of Fury / 1972</h1>
        <div class="videowrap">
            <div class="videoblock">
                <iframe src="https://www.youtube.com/embed/BTKY8qMovDY" allowfullscreen></iframe>
            </div>
        </div>
        <p><b>Год выпуска:</b> 1972<br>
            <b>Жанр:</b> боевик<br>
            <b>Продолжительность:</b> 106 мин.<br>
            <b>Режиссер:</b> Ло Вэй<br>
            <b>В ролях:</b> Брюс Ли, Нора Мяо, Ли Куань, Джеймс Тянь, Тянь Фэн, Ло Вэй и др.</p>
            <p><b>Описание:</b> Мастер боевых искусств Чэнь Чжэнь (Брюс Ли) возвращается в Шанхай на похороны своего учителя, знаменитого мастера Хо Юаньцзя (основателя Ассоциации боевых искусств «Цзинъу»), отравленного по приказу японцев (в фильме Чэнь выясняет это позже; по официальной версии его учитель умер от пневмонии). Японцы присылают на похороны плакат с надписью «Больные Восточной Азии» (оскорбительное название китайцев, использовавшееся в конце XIX — начале XX вв.), японцы всячески унижают и оскорбляют школу китайского кунг-фу и её учеников. Чэнь Чжэнь собирается защитить честь школы своего учителя и доказать превосходство кунг-фу над японскими боевыми искусствами. Он избивает разом всех учеников японской школы боевых искусств, но тем самым настраивает против себя полицию и вызывает гнев оккупационных властей. Вынужденный скрываться Чэнь всё-таки узнаёт, кто и как именно отравил его учителя — и он убивает отравителей. А затем он вступает в схватку и с самими японскими заказчиками отравления и, после ряда тяжёлых схваток, убивает их всех, в том числе и их босса, Хироси Судзуки. В конце фильма показывается сцена, где Чэнь согласен идти под арест. При этом он берет слово с начальника китайской полиции, что Ассоциацию «Цзинъу» никто не тронет. Он выходит к японцам, но они (в том числе полиция) не хотят его арестовывать. Они хотят его убить. В финальном кадре Чэнь делает решительный прыжок в их сторону и японцы стреляют в него, по всей видимости убив его, хотя это и не показано в фильме. После прыжка в титрах звучит песня «…тогда моя рука становится кулаком ярости». (англ. "...then I change my hands in a fist of fury!").</p>
            <hr>
    </div>
</article>
</div>
<?php include '../include/rightbar_cinema.php'; ?>
<?php include '../include/footer.php'; ?>