<?php include '../include/head.php'; ?>

<title>Карьера в IT. <?php include '../include/title.php'; ?></title>
<meta name='description' content='Как войти в Айти? Карьера в IT. Работа веб-разработчиком, программистом, дизайнером. Советы от профессионала. <?php include '../include/description.php'; ?>'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_cert.php'; ?>
<?php include '../include/before_content_cert.php'; ?>

  <article>
      <h1>Карьера в IT. <span class='color_h1'>Планирование</span></h1>
      <div class='w3-clear nextprev'>
          <a class='w3-left w3-btn' href='cert_xml.php'>&#10094; Prev</a>
          <a class='w3-right w3-btn' href='career_cv.php'>Next &#10095;</a>
      </div>
      <hr>
      <h2>Построение карьеры</h2>
      <p>Сегодня и больше, чем когда-либо, большинство людей сами ответственны за построение своей карьеры.</p>
      <p>Если вы только начинаете или у вас есть несколько лет опыта, эти параграфы могут помочь вам продвинуться по карьерной лестнице. </p>
      <p class='intro'>9 самых важных советов по планированию карьеры перечислены ниже:</p>
      <hr>

      <h2>1. Никогда не переставайте учиться</h2>
      <p><b>&quot;Обучение на протяжении всей жизни&quot; - ваша ключевая фраза.</b></p>
      <p>Мир постоянно меняется, и все ищут новые способы ведения бизнеса.</p>
      <p>Если вы решили, что ваши текущие навыки достаточно хороши, вы также решили, что ваша текущая работа достаточно хороша.</p>
      <p>Но если вы хотите сделать карьеру в будущем, вам следует регулярно обновлять свои навыки и знания.</p>
      <hr>

      <h2>2. Спрашивайте, слушайте и учитесь</h2>
      <p><b>Хороший слушатель может многому научиться.</b></p>
      <p>Слушайте своих коллег, начальника и начальство. Вы можете многому научиться на их опыте.</p>
      <p>Задавайте вопросы, которые вас интересуют, и слушайте, что они говорят. Пусть они расскажут вам, как всё работает, и что вы могли бы сделать лучше.</p>
      <p>Многим людям понравится быть вашим бесплатным наставником.</p>
      <hr>

      <h2>3. Выполните свою текущую работу</h2>
      <p><b>Ваша текущая работа может быть лучшим местом для начала карьеры.</b></p>
      <p>Часто очень мало того, что отличает успешных людей от обычных. Но ничего не даётся бесплатно.</p>
      <p>Если вы хорошо делаете свою работу и выполняете свои обязанности, часто это лучший способ начать новую карьеру.</p>
      <p>Поговорите со своим руководителем о том, что вы можете сделать. Предлагайте улучшения. Предложите свою помощь, когда потребуется помощь. Взамен попросите о помощи, чтобы построить лучшую карьеру. Часто это возможно - прямо внутри вашей организации - особенно если вы доказали, что являетесь ценным сотрудником.</p>
      <hr>

      <h2>4. Создайте свою сеть</h2>
      <p><b>Следующим шагом в карьере может стать ваша контактная сеть.</b></p>
      <p>Знаете ли вы, что более 50% всех вакансий получают из контактных сетей?</p>
      <p>Если у вас есть хорошая сеть контактов, это также хорошее место для открытия будущей карьеры, изучения новых тенденций и изучения новых возможностей.</p>
      <p>Потратьте некоторое время на создание новых контактов и не забывайте поддерживать уже существующие.</p>
      <p>Один из лучших способов получить серьезную информацию от вашей сети - регулярно спрашивать своих знакомых, как они, чем они занимаются и что нового в их карьере.</p>
      <hr>

      <h2>5. Определите вашу текущую работу</h2>
      <p><b>Ваша текущая работа должна быть реальной, а не предполагаемой.</b></p>
      <p>Когда вы приступаете к новой работе, поговорите со своим начальником о своих приоритетах. Если вы не уверены в том, что является наиболее важным, спросите руководителя. И спросите его или её ещё раз. Часто вы будете удивлены различием между тем, что вы предполагаете, и тем, что действительно важно.</p>
      <hr>

      <h2>6. Определите вашу следующую работу</h2>
      <p><b>Должна быть определена работа вашей мечты.</b></p>
      <p>Прежде чем приступить к планированию своей будущей карьеры, убедитесь, что вы определили работу своей мечты.</p>
      <p>На работе своей мечты вы будете делать всё, что вам нравится, и ничего из того, что вам не нравится. Что это за работа?</p>
      <p>Нравится или не нравится вам ответственность за других сотрудников? Вам нравится работать с технологиями или с людьми? Вы хотите вести собственный бизнес? Вы хотите быть художником, дизайнером или опытным инженером? Менеджером?</p>
      <p>Прежде чем строить свою будущую карьеру, определите свою цель и задачи!</p>
      <hr>

      <h2>7. Подготовьте себя</h2>
      <p><b>Ваша мечта может явиться завтра. Будьте готовы!</b></p>
      <p>Не ждите ни секунды. Обновите своё резюме прямо сейчас и продолжайте регулярно обновлять его.</p>
      <p>Завтра работа вашей мечты может появиться прямо перед вашим носом. Подготовьтесь к этому с помощью профессионального резюме и будьте готовы описать себя как очень ценного работника для всех, кто попытается вас нанять.</p>
      <p>Если вы не знаете, как написать резюме или как описать себя, начните изучать это прямо сейчас.</p>
      <hr>

      <h2>8. Выберите правильные инструменты</h2>
      <p><b>Выберите инструменты, с которыми вы сможете справиться.</b></p>
      <p>Вы можете построить свою будущую карьеру, используя множество различных инструментов. Учиться в W3Schools легко. Получить полную степень магистра сложнее.</p>
      <p>Вы можете значительно улучшить свою карьеру, изучая книги и учебные пособия (например, те, что вы найдете в W3Schools). Краткосрочные курсы с сертификационными тестами могут добавить ценного веса вашему резюме. И не забывайте: ваша текущая работа часто является самым ценным источником приобретения новых навыков.</p>
      <p>Не выбирайте инструмент, который слишком тяжел для вас!</p>
      <hr>

      <h2>9. Осуществите свои мечты</h2>
      <p><b>Воплотите свои мечты в жизнь.</b></p>
      <p>Не позволяйте занятой работе убивать ваши мечты. Если у вас есть более высокие цели, воплотите их в жизнь прямо сейчас.</p>
      <p>Если у вас есть планы продолжить образование, получить лучшую работу, открыть собственную компанию или что-то ещё, вам не следует использовать свою повседневную работу как 'место ожидания'. Ваша повседневная работа будет становиться все более и более загруженной, вы будете вовлечены в крысиные бега и будете сжигать свою энергию.</p>
      <p>Если у вас есть эта энергия, вы должны использовать её сейчас, чтобы реализовать свои мечты.</p>
      <hr>
      <div class='w3-clear nextprev'>
          <a class='w3-left w3-btn' href='cert_xml.php'>&#10094; Prev</a>
          <a class='w3-right w3-btn' href='career_cv.php'>Next &#10095;</a>
      </div>
  </article>
<?php include '../include/addown_content.php'; ?>
    </div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>