<?php include '../include/head.php'; ?>

<title>Сертификат по Науке о данных от W3Schools. <?php include '../include/title.php'; ?></title>
<meta name='description' content='Сертификация от W3Schools. Сертификат по Науке о данных. Сдать экзамен, пройти тесты и получить сертификат по изучению Науки о данных. <?php include '../include/description.php'; ?>'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_cert.php'; ?>
<?php include '../include/before_content_cert.php'; ?>

  <article>
    <h1><span class='color_h1'>Наука о данных</span> Сертификация</h1>
    <div class='w3-clear nextprev'>
      <a class='w3-left w3-btn' href='cert_python.php'>&#10094; Prev</a>
      <a class='w3-right w3-btn' href='cert_jquery.php'>Next &#10095;</a>
    </div>
    <hr>
    <p class='intro'>Сертификация по Науке о данных требует навыков в области Python, математических функций и статистики.</p>
    <hr>

    <img src='../images/pic_datascience_cert_small.gif' alt='HTML Certificate' style='float:left;margin-bottom:10px;margin-right:20px;height:206px;width:146px;border:1px solid #888'>
    <h2>Сертификат разработчика Науки о данных</h2>
    <p><strong>Сертификат разработчика Науки о данных</strong> подтверждает фундаментальные знания <strong>Python</strong>, <strong>математических функций</strong> и <strong>статистики</strong>.</p>
    <p><span style='color:#444;'>Цена:</span><span style='font-size:150%;color:#900B09'> $95.00</span></p>
    <p class='clearfix'><a class='w3-btn w3-large' href='cert_datascience_reg.php'>Получить Сертификат!</a></p>
    <hr>

    <h2>Сертификат разработчика Науки о данных</h2>
    <p>Данные - это набор информации. Одна из целей Data Science - структурировать данные, чтобы сделать их интерпретируемыми и простыми в работе..</p>
    <p>Python - это язык программирования, широко используемый специалистами по данным. Python имеет встроенные математические библиотеки и функции, упрощающие вычисление математических задач и анализ данных.</p>
    <p>Специалисту по анализу данных важно знать математические функции, чтобы делать прогнозы и интерпретировать их.</p>
    <p>Статистика - это наука об анализе данных.</p>
    <p>Сертификат разработчика Data Science подтверждает фундаментальные знания Python, математических функций и статистики.</p>
    <p><a href='../images/pic_datascience_cert.png' target='_blank'>Сертификат разработчика Науки о данных</a></p>
    <hr>

    <h2>Рекомендуемые исследования и обучение</h2>
    <p>Все вопросы экзамена основаны на содержании учебника от W3Schools <a href='../datascience/index.php'>Наука о данных</a>.</p>
    <hr>

    <h2>Экзамен по Науке о данных</h2>
    <p>Экзамен по Науке о данных будет проходить онлайн через Интернет, в любое удобное для вас время и из любого места.
        <!--, но экзамен должен проходить под наблюдением человека, выбранного кандидатом на экзамен.--></p>
    <p>Экзамен состоит из 160 вопросов с множественным выбором или верных/неверных вопросов. Экзамен ограничен по времени 140 минутами.</p>
    <p>Кандидаты должны иметь 75% правильных ответов, чтобы сдать экзамен и получить сертификат.</p>
    <p>Кандидатам, набравшим более 95% правильных ответов, к их сертификату будет добавлена отметка об отличии (превосходном качестве образования).</p>
    <p>Сразу после сдачи экзамена вы будете проинформированы о ваших оценках и статусе сдан/не сдан.</p>
    <p>Если вы не справитесь или хотите улучшить свой результат, вы можете сдать экзамен ещё раз. Будет засчитан лучший результат из двух попыток.</p>
    <p>Если вы получили статус сертификации, вы можете загрузить свой сертификат разработчика по Науке о данных. Документ будет содержать ваши личные данные, подтверждающие ваш статус Сертифицированного разработчика Науки о данных.</p>
    <?php include '../include/cert_end.php'; ?>
    <div class='w3-clear nextprev'>
      <a class='w3-left w3-btn' href='cert_python.php'>&#10094; Prev</a>
      <a class='w3-right w3-btn' href='cert_jquery.php'>Next &#10095;</a>
    </div>
  </article>
<?php include '../include/addown_content.php'; ?>
  </div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>