<?php include '../include/head.php'; ?>
<title>HTML: Живой стандарт. Аудитория. <?php include '../include/title.php'; ?></title>
<meta name='description' content='HTML: Живой стандарт. Аудитория. Для кого предназначена спецификация The Living Standard? <?php include '../include/description.php'; ?>'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_whatwg.php'; ?>
<?php include '../include/before_content_whatwg.php'; ?>

<article>
    <h1>HTML: Живой стандарт. Сфера</h1>
    <div class='w3-clear nextprev'>
        <a class='w3-left w3-btn' href='whatwg_audience.php'>&#10094; Prev</a>
        <a class='w3-right w3-btn' href='whatwg_history.php'>Next &#10095;</a>
    </div>
    <hr>
    <h2>Сфера</h2>
    <p>Эта спецификация ограничивается предоставлением языка разметки семантического уровня и связанных API скриптов семантического уровня для создания доступных страниц в сети, от статических документов до динамических приложений.</p>
    <p>В объём данной спецификации не входят механизмы для настройки представления, зависящей от носителя (хотя правила рендеринга по умолчанию для веб-браузеров включены в конце этой спецификации, а несколько механизмов для подключения к CSS предоставляются как часть языка).</p>
    <p>Данная спецификация не предназначена для описания всей операционной системы. В частности, программное обеспечение для конфигурации оборудования, инструменты для работы с изображениями и приложения, которые пользователи должны будут использовать с высокопроизводительными рабочими станциями на ежедневной основе, не входят в сферу применения. Что касается приложений, эта спецификация ориентирована специально на приложения, которые, как ожидается, будут использоваться пользователями время от времени или регулярно, но из разных мест, с низкими требованиями к ЦП. Примеры таких приложений включают системы онлайн-покупок, поисковые системы, игры (особенно многопользовательские онлайн-игры), общедоступные телефонные книги или адресные книги, коммуникационное программное обеспечение (почтовые клиенты, клиенты обмена мгновенными сообщениями, программное обеспечение для обсуждения), программное обеспечение для редактирования документов и т.д.</p>
    <hr>
    <div class='w3-clear nextprev'>
        <a class='w3-left w3-btn' href='whatwg_audience.php'>&#10094; Prev</a>
        <a class='w3-right w3-btn' href='whatwg_history.php'>Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>
