<?php include '../include/head.php'; ?>
<title>HTML: The Living Standard. Живой стандарт. Интро. <?php include '../include/title.php'; ?></title>
<meta name='description' content='HTML: The Living Standard. Живой стандарт. Интро. <?php include '../include/description.php'; ?>'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_whatwg.php'; ?>
<?php include '../include/before_content_whatwg.php'; ?>

<article>
    <h1>HTML: Живой стандарт. Интро</h1>
    <div class='w3-clear nextprev'>
        <a class='w3-left w3-btn' href='index.php'>&#10094; Prev</a>
        <a class='w3-right w3-btn' href='whatwg_background.php'>Next &#10095;</a>
    </div>
    <hr>
    <h2>Что такое HTML: The Living Standard (Живой стандарт)?</h2>
    <h3>Это HTML5?</h3>
    <p>Коротко: <b>Да!</b></p>
    <p>Более подробно: термин <strong>&quot;HTML5&quot;</strong> широко используется как модное слово для обозначения современных веб-технологий, многие из которых (но далеко не все) разработаны <strong>WHATWG</strong>. Этот документ является одним из таких; другие доступны в <a href="https://spec.whatwg.org/" target="_blank" rel="nofollow">обзоре стандартов WHATWG</a>.</p>
    <hr>
    <h3>Что такое WHATWG?</h3>
    <p><strong>WHATWG</strong> (<em>Web Hypertext Application Technology Working Group</em> - с англ. &quot;Рабочая группа по технологиям гипертекстовых веб-приложений&quot;) — сообщество специалистов по HTML и API, необходимым для веб-приложений, занимающееся развитием этих технологий и разработкой стандартов для них.</p>
    <p>WHATWG была основана в 2004 году сотрудниками компаний — производителей браузеров: Apple, Mozilla Foundation и Opera Software (в лице Яна Хиксона). В настоящий момент рабочая группа по-прежнему опирается на сообщество, а также на документы и политики, разработанные для WHATWG нынешними доминирующими производителями браузеров — Apple, Google, Microsoft и Mozilla; четверо представителей этих четырёх организаций составляют руководящую группу WHATWG.</p>
    <p>WHATWG разрабатывает стандарты для HTML, DOM, интерфейсов для получения ресурсов (стандарт Fetch), полноэкранного режима работы браузера и т.д. <strong>Спецификации WHATWG</strong> имеют статус &quot;живых стандартов&quot; (англ. <strong>Living Standard</strong>) — в спецификации постоянно вносятся правки и добавления. Документы WHATWG публикуются на условиях лицензии CC BY 4.0.</p>
    <hr>
    <?php include '../include/adinfeed.php'; ?>
    <h3>Роль в разработке стандартов и взаимодействие с W3C</h3>
    <p>До WHATWG единственной авторитетной организацией, вырабатывавшей стандарты для веба, был W3C; в нём состоят сотни компаний, включая и связанные с WHATWG. Основатели WHATWG сочли, что W3C не учитывает в своей работе реальные потребности веб-разработчиков, в частности, что W3C слишком сосредоточился на XHTML вместо дальнейшего развития HTML. Поскольку WHATWG руководят представители производителей браузеров, которые в реальности занимаются реализацией стандартов в своих продуктах, влияние новой рабочей группы оказалось как минимум сопоставимо с влиянием W3C.</p>
    <p>В 2000-х годах W3C и WHATWG совместно работали над HTML5, но дальнейшее развитие стандарта HTML организации стали осуществлять уже независимо. Сотрудничество между организациями постепенно становилось всё менее эффективным.</p>
    <p>В 2018 году W3C планировал принять очередную версию стандарта для DOM, которая была напрямую несовместима со стандартом WHATWG в некоторых аспектах. Представители WHATWG высказали возражения против принятия этой версии стандарта и указали, что производители браузеров будут следовать стандарту, разработанному ими — стандарту WHATWG. В итоге новый стандарт W3C не был принят.</p>
    <p>Чтобы избежать появления двух конкурирующих, взаимно противоречивых стандартов, W3C и WHATWG договорились о новом формате совместной работы. А именно, согласно подписанному обеими организациями в 2019 году меморандуму, ведущая роль в работе над стандартами HTML и DOM принадлежит WHATWG, а W3C приглашает своих членов участвовать в работе WHATWG и утверждает стандарты WHATWG как свои официальные рекомендации.</p>
    <p><i><a href="https://ru.wikipedia.org/wiki/WHATWG" target="_blank" rel="nofollow">из Википедии</a></i></p>
    <hr>
    <div class='w3-clear nextprev'>
        <a class='w3-left w3-btn' href='index.php'>&#10094; Prev</a>
        <a class='w3-right w3-btn' href='whatwg_background.php'>Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>
