<?php include '../include/head.php'; ?>
<title>Условия сервиса. <?php include '../include/title.php'; ?></title>
<meta name="description" content="Условия сервиса W3Schools - учебники по HTML, CSS, JavaScript, PHP, SQL и многое др. Уроки для начинающих онлайн бесплатно. <?php include '../include/description.php'; ?>">
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_about.php'; ?>
<?php include '../include/before_content_about.php'; ?>
<article>
    <h1>Про Условия сервиса W3Schools</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="about_copyright.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="about_privacy.php">Next &#10095;</a>
    </div>
    <hr>
    <h2>Обзор</h2>
    <p>Оригинальный сайт W3Schools.com создан компанией Refsnes Data. Все, что предлагает этот сайт, включая всю информацию, инструменты и услуги, доступно на этом сайте вам, пользователю, при условии принятия вами всех положений, условий, политики и сообщений, указанных здесь.</p>
    <p>Посетив этот сайт и/или приобретя что-то на оригинальном сайте, вы участвуете в &quot;Сервисе&quot; и соглашаетесь на следующие условия (&quot;Условия предоставления услуг&quot;, &quot;Условия&quot;), включая дополнительные условия и правила, на которые ссылаются здесь и/или которые доступны по гиперссылкам. Эти Условия использования распространяются на всех пользователей сайта, включая, помимо прочего, пользователей, которые являются браузерами, поставщиками, клиентами, продавцами и/или участниками контента.</p>
    <p>Пожалуйста, внимательно прочитайте эти Условия использования перед тем, как зайти на этот сайт или начать пользоваться им. Получая доступ к любой части сайта или используя его, вы соглашаетесь с настоящими Общими положениями и условиями. Если вы не согласны со всеми условиями этого соглашения, вы не можете получить доступ к веб-сайту или пользоваться любыми услугами. Если эти Условия использования считаются предложением, принятие его прямо ограничивается этими Условиями предоставления услуг.</p>
    <p>Любые новые функции и инструменты, которые добавляются к текущему сайта, также регулируются Условиями предоставления услуг. Вы можете посмотреть любую последнюю версию Условий использования в любое время на этой странице. Мы оставляем за собой право обновлять, изменять или заменять любую часть этих Условий использования, публикуя обновления и/или изменения на нашем сайте. Вы несете ответственность периодически проверять эту страницу на наличие изменений. Ваше дальнейшее использование сайта или доступ к нему после публикации любых изменений означает принятие этих изменений.</p>
    <hr>
    <h2>Условия использования сайта W3Schools</h2>
    <p>Соглашаясь с настоящими Условиями предоставления услуг, вы подтверждаете, что вы как минимум совершеннолетние в своей стране или регионе проживания, и вы дали нам свое согласие на разрешение любому из ваших несовершеннолетних иждивенцев использовать этот сайт.</p>
    <p>Вы не можете использовать наши продукты с любой незаконной или несанкционированной целью, а также не можете, используя Сервис, нарушать любое законодательство в вашей юрисдикции (включая, но не ограничиваясь законами об авторском праве).</p>
    <p>Вы не должны передавать любых червей, вирусов или любой код разрушительного характера.</p>
    <p>Нарушение этого или нарушение каких-либо других Условий приведет к немедленному прекращению предоставления Вам услуг.</p>
    <hr>
    <h2>Общие условия</h2>
    <p>Мы оставляем за собой право в любое время отказать кому-либо в обслуживании по любой причине.</p>
    <p>Вы понимаете, что ваше содержание (не включая информацию о кредитной карте) может передаваться незашифрованным и передаче через различные сети; и изменения, соответствующие техническим требованиям подключения сетей или устройств и приспосабливаются к ним. Информация о кредитной карте всегда шифруется при передаче через сети.</p>
    <p>Вы соглашаетесь не воспроизводить, копировать, продавать, перепродавать или использовать любую часть Службы, использование Службы или доступ к Службе или любого контакта на сайте, через который предоставляется услуга, без письменного разрешения нами.</p>
    <p>Заголовки, используемые в этой сделке, включены лишь для удобства и не будут ограничивать или влиять на эти условия.</p>
    <hr>
    <h2>Честное использования</h2>
    <p>Честное использования определяет Refsnes Data исключения из прав, защищенных законами об авторском праве.</p>
    <p>Честное использования W3Schools включает использование защищенных авторским правом материалов</p>
    <ul>
        <li>В исследовании</li>
        <li>В новостях</li>
        <li>В цитатах</li>
        <li>В комментарии</li>
    </ul>
    <p>Честное использование W3Schools также включает:</p>
    <ul>
        <li>Ссылку на W3Schools</li>
        <li>Добавление W3Schools к поисковым системам</li>
        <li>Библиотечное архивирование W3Schools</li>
    </ul>
    <hr>
    <h2>Использование W3Schools в обучении</h2>
    <p>Честное использование включает использование защищенного авторским правом материала во время преподавания в рамках этого баланса:</p>
    <h3>Благоприятное использования:</h3>
    <ul>
        <li>Копирование примеров и фрагментов кода для некоммерческого обучения и исследований.</li>
        <li>Копирование небольших объемов, подходит для преподавания в классе.</li>
    </ul>
    <h3>Неблагоприятное использования:</h3>
    <ul>
        <li>Копирование для выгодного или коммерческого использования.</li>
        <li>Массовое или дословное копирование.</li>
        <li>Копирование больших объемов.</li>
    </ul>
    <hr>
    <h2>Точность, полнота и своевременность информации</h2>
    <p>Мы не несем ответственности, если информация, размещенная на данном веб-сайте, не является точной, полной или актуальной.</p>
    <p>Материалы на этом сайте предоставлены только для общей информации, и на них не следует полагаться или использовать их как единую основу для принятия решений без консультаций с первичными, более точными, более полными или более своевременными источниками информации. Любое использование материалов на данном веб-сайте вы используете на свой собственный риск.</p>
    <p>Этот сайт может содержать определенную историческую информацию. Историческая информация обязательно не актуальна и предоставляется только для ознакомления. Мы оставляем за собой право изменять содержание этого сайта в любое время, но мы не обязаны обновлять любую информацию на нашем сайте. Вы соглашаетесь с тем, что вы несете ответственность за отслеживание изменений на нашем сайте.</p>
    <p>Если вы обнаружите, что сайт или его содержимое содержит ошибки, свяжитесь с нами, чтобы их можно было исправить.</p>
    <p>Контактный адрес:</p>
    <p>help@w3schools.com</p>
  <?php include '../include/addown_content.php'; ?>
    <h2>Изменения в Сервисе и ценах</h2>
    <p>Цены на наши товары могут быть изменены без предупреждения.</p>
    <p>Мы оставляем за собой право в любое время изменять или приостанавливать Услугу (или любую ее часть или содержание) без предупреждения в любое время.</p>
    <p>Мы не будем нести ответственность перед вами или перед любой третьей стороной за любые изменения, изменение цены, приостановления или прекращения Услуги.</p>
    <hr>
    <h2>Товары или услуги</h2>
    <p>Некоторые товары или услуги могут быть доступны только в Интернете через веб-сайт.</p>
    <p>Мы приложили максимум усилий, чтобы как можно точнее отразить цвета и изображения наших товаров, которые появляются в магазине. Мы не можем гарантировать, что любой цвет монитора вашего компьютера будет точным.</p>
    <p>Мы оставляем за собой право, но не обязаны ограничивать продажи наших продуктов или услуг любому лицу, географическому региону или юрисдикции. Мы можем реализовать это право в каждом конкретном случае.</p>
    <p>Мы оставляем за собой право ограничивать количество любых товаров или услуг, которые мы предлагаем. Все описания товаров или цены на товары могут быть изменены в любое время без предупреждения по своему усмотрению.</p>
    <p>Мы оставляем за собой право прекратить производство любого товара в любое время. Любое предложение по любому продукту или услуге, сделанная на этом сайте, теряет силу, если это запрещено.</p>
    <p>Мы не гарантируем, что качество любых продуктов, услуг, информации или других материалов, приобретенных или полученных вами, будет соответствовать вашим ожиданиям или что любые ошибки в Сервисе будут исправлены.</p>
    <hr>
    <h2>Точность выставления счетов и информации о счете </h2>
    <p>Мы оставляем за собой право отказать в любом заказе, которое вы делаете у нас. Мы можем по своему усмотрению ограничить или отменить приобретенные количестве на человека, на домохозяйство или на заказ. Эти ограничения могут включать заказ, размещенные одной учетной записью клиента или под ним, той же кредитной картой и/или заказа, которые используют одинаковый адрес выставления счета и/или доставки.</p>
    <p>В случае изменения или отмены заказа мы можем попытаться сообщить вам, связавшись с электронной почтой и/или адрес для выставления счета/номеру телефона, указанному на момент оформления заказа.</p>
    <p>Мы оставляем за собой право ограничивать или запрещать заказ, которые, по нашим единственным решением, выдаются дилерами, перекупщиками или дистрибьюторами.</p>
    <p>Вы соглашаетесь предоставлять актуальную, полную и точную информацию о покупках и учетную запись для всех покупок, совершенных на нашем сайте. Вы согласны оперативно обновлять свой аккаунт и другую информацию, включая адрес электронной почты и номера кредитных карточек и даты окончания срока действия, чтобы мы могли завершить ваши операции и связаться с вами в случае необходимости.</p>
    <hr>
    <h2>Необязательные инструменты</h2>
    <p>Мы можем предоставить вам доступ к сторонним инструментов, которые мы не контролируем. Вы признаете и соглашаетесь, что мы предоставляем доступ к таким инструментам без каких-либо гарантий, заявлений или условий любого вида и без каких-либо одобрений. Мы не несем никакой ответственности, вытекающей из вашего использования необязательных сторонних инструментов или связанных с ним.</p>
    <p>Любое использование вами необязательных инструментов, предлагаемых на сайте, осуществляется полностью на ваш собственный риск и по усмотрению, и вы должны убедиться, что вы ознакомлены и одобряете условия, на которых инструменты предоставляются соответствующим сторонним поставщиком).</p>
    <p>Мы можем в дальнейшем предлагать новые услуги и/или функции через веб-сайт (включая выпуск новых инструментов и ресурсов). Такие новые функции и/или услуги также регулируются Условиями предоставления услуг.</p>
    <hr>
    <h2>Сторонние ссылки</h2>
    <p>Одно содержание, продукты и услуги, доступные через нашу Службу, могут включать материалы третьих сторон.</p>
    <p>Посторонние ссылки на этом сайте могут направить вас на сторонние веб-сайты, которые не связаны с нами. Мы не несем ответственности за изучение или оценку содержания или точности, мы не гарантируем и не несем никакой ответственности за любые посторонние материалы или веб-сайты, а также за любые другие материалы, продукты или услуги третьих сторон.</p>
    <p>Мы не несем ответственности за любой ущерб или убытки, связанные с приобретением или использованием товаров, услуг, ресурсов, содержания или любых других операций, осуществленных в связи с любыми сторонними сайтами. Пожалуйста, внимательно ознакомьтесь с политикой и практикой третьей стороны и убедитесь, что вы их понимаете, прежде чем участвовать в любой операции. Жалобы, претензии, беспокойство или вопрос относительно посторонних продуктов должны направляться третьей стороне.</p>
    <hr>
    <h2>Комментарии пользователей, отзывы и другие представления</h2>
    <p>Если на наш запрос вы посылаете определенные конкретные представления (например, конкурсные работы) или без запроса от нас вы посылаете творческие идеи, предложения, предложения, планы и другие материалы, будь то в Интернете, по электронной почте, по почте или иным образом (вместе с "комментариями"), вы соглашаетесь с тем, что мы можем в любое время, без ограничений, редактировать, копировать, публиковать, распространять, переводить и использовать любой другой способ в любом носителе каких-либо комментариев, которые вы нам пересылаете.</p>
    <p>Мы не храним и не будем обязаны хранить любые комментарии в тайне; выплачивать компенсацию за любые комментарии; или отвечать на любые комментарии.</p>
    <p>Мы можем, но не обязаны контролировать, редактировать и удалять содержимое, которое, на наше собственное усмотрение, мы признаем незаконным, оскорбительным, угрожающим, клеветническим, порнографическим, нецензурным или иным образом неприемлемым или если оно нарушает интеллектуальную собственность любой стороны или эти Условия предоставления услуг.</p>
    <p>Вы соглашаетесь с тем, что ваши комментарии НЕ БУДУТ нарушать любое право любой третьей стороны, включая авторское право, торговую марку, конфиденциальность, персональные или другие личные или имущественные права. Вы также соглашаетесь с тем, что ваши комментарии не содержат клеветнических или незаконных, нецензурных материалов, а также ни компьютерного вируса или другого вредоносного программного обеспечения, которое может каким-то образом повлиять на работу Службы или любого связанного сайта. Вы не можете использовать фальшивый адрес электронной почты, притворяться кем-то, кроме себя, или иным образом вводить нас в заблуждение или третьи стороны о происхождении каких-либо комментариев. Вы несете полную ответственность за любые ваши комментарии и их точность.</p>
    <p>Мы не несём ответственности за любые комментарии, размещенные вами или любой третьей стороной.</p>
  <?php include '../include/addown_content.php'; ?>
    <h2>Личная информация</h2>
    <p>Ваше представление личной информации через веб-сайт регулируется нашей <a href="about_privacy.php">Политикой конфиденциальности </a>.</p>
    <hr>
    <h2>Ошибки, неточности и упущения</h2>
    <p>Иногда на нашем сайте или в Службе может быть информация, которая содержит опечатки, неточности или упущения, которые могут касаться описаний товаров, цен, рекламных акций, предложений, стоимости доставки товара, времени доставки и доступности. Мы оставляем за собой право исправить любые ошибки, неточности или упущения, а также изменить или обновить информацию или отменить заказ, если любая информация в Службе или на любом связанном сайте является неточной в любое время без предварительного уведомления (в том числе после того, как вы подали свой заказ).</p>
    <p>Мы не берём на себя никаких обязательств обновлять, изменять или уточнять информацию в Услуге или на любом связанном сайте, включая без ограничений, информацию о ценах, кроме случаев, предусмотренных законодательством. Ни одна указанная дата обновления или обновления, примененная в Службе или на любом связанном сайте, не должна указывать на то, что вся информация в Службе или на любом связанном сайте была изменена или обновлена.</p>
    <hr>
    <h2>Запрещено использование</h2>
    <p>В дополнение к другим запретов, предусмотренных Условиями предоставления услуг, вам запрещено пользоваться сайтом или его содержанием:</p>
    <p>(a) с любой незаконной целью; (b) требовать от других выполнять участвовать в незаконных действиях; (c) нарушать любые международные, федеральные, провинциальные или государственные права, правила, законы или местные постановления; (d) нарушать или нарушать наши права интеллектуальной собственности или права интеллектуальной собственности других лиц; (e) преследовать, злоупотреблять, оскорблять, наносить вред, клевету, пренебрежения, запугивания или дискриминации по признаку пола, сексуальной ориентации, религии, этнической принадлежности, расы, возраста, национальной принадлежности или инвалидности; (f) представлять ложную или обманчивую информацию; (g) загружать или передавать вирусы или любой другой тип вредоносного кода, который будет или может быть использован любым способом, который влияет на функциональность или работу Службы или любого связанного сайта, других веб-сайтов или Интернета; (h) собирать или отслеживать личную информацию других лиц; (i) для спама, фишинга, привода, паука, сканирования и пр.; (j) с любой непристойной или аморальной целью; или (k) вмешиваться или обходить функции безопасности Службы или любого связанного сайта, других веб-сайтов или Интернета.</p>
    <p>Мы оставляем за собой право прекратить использование вами Сервиса или любого связанного сайта за нарушение любого из запрещенных видов использования.</p>
    <hr>
    <h2>Отказ от гарантий; Ограничение ответственности</h2>
    <p>Мы не гарантируем, не заявляем и не можем гарантировать, что ваше использование нашей услуги будет бесперебойным, своевременным, безопасным или безошибочным.</p>
    <p>Мы не гарантируем, что результаты, которые могут быть получены от использования сервиса, будут точными или надежными. Вы соглашаетесь с тем, что время от времени мы можем удалять услугу на неопределенное время или отменять услугу в любое время без предупреждения вас.</p>
    <p>Вы прямо соглашаетесь с тем, что пользование услугой или ее невозможности использовать на свой собственный риск. Услуга и все продукты и услуги, предоставляемые вам через Сервис (кроме случаев, прямо указанных нами) предоставляются "как есть" и "доступные" для вашего использования, без каких-либо заявлений, гарантий или любых условиях, каких-либо явных или тех, что имеются в виду, включая все предполагаемые гарантии или условия товарности, товарного качества, пригодности для определенной цели, долговечности, титула и соблюдения.</p>
    <p>Ни в коем случае компания Refsnes Data не несет ответственности за любой ущерб, убытки, претензии или любые прямые, косвенные, случайные случаи, наши директора, офицеры, сотрудники, филиалы, агенты, подрядчики, стажеры, поставщики, поставщики услуг или лицензиары, карательные, специальные или последующие убытки любого вида, включая, без ограничения, потерю прибыли, потерю дохода, потерю сбережений, потерю данных, расходы на замену или любые подобные убытки, независимо от того, базирующейся на договоре, деликт (включая халатность), строгая ответственность в противном случае, возникающая вследствие использования вами любой услуги или любых продуктов, закупленных с использованием услуги, или любой другой претензии, связанной каким-либо образом с вашим использованием услуги или любого продукта, включая, но не ограничиваясь этим, любые ошибки или упущения в любом содержании или любая утрата или повреждение любого вида, понесенные в результате использования услуги или любого содержания (или продукта), размещенного, переданного или иным образом доступного через Сервис, даже если сообщается об их возможности. Поскольку некоторые штаты или юрисдикции не позволяют исключать или ограничивать ответственность за следственные или случайные убытки, в таких штатах или юрисдикциях наша ответственность будет ограничена до максимально разрешенного законом объема.</p>
    <hr>
    <h2>Компенсация</h2>
    <p>Вы соглашаетесь возместить, защищать и сохранять безвредные данные Refsnes, как и наши родительские, дочерние компании, филиалы, партнеры, офицеры, директора, агенты, подрядчики, лицензиары, услуг, субподрядчики, поставщики, стажеры и работники, безвредны от любых требований или требований, включая обоснованную вознаграждение адвокатов, осуществленную любой третьей стороной в результате или в результате нарушения Вами настоящих Условий предоставления услуг или документов, которые они включают путем ссылки или Вашего нарушения любого закона или прав третьей стороны.</p>
    <hr>
    <h2>Полное соглашение</h2>
    <p>Невыполнение нами или обеспечения любого права или положения настоящих Условий предоставления услуг не означает отказа от такого права или положения.</p>
    <p>Эти Условия предоставления услуг любая политика или правила эксплуатации, размещенные нами на этом сайте или в отношении Услуги, составляют полное соглашение и взаимопонимание между вами и нами и регулируют использование вами Услуги, заменяя любые предшествующие или одновременные соглашения, сообщения и предложения, устные или письменные, между вами и нами (включая, но не ограничиваясь ими, любые предыдущие версии Условий предоставления услуг).</p>
    <p>Любые неоднозначности в толковании настоящих Условий предоставления услуг не должны толковаться против стороны, составляющей проект.</p>
    <hr>
    <h2>Действующее законодательство</h2>
    <p>Эти Условия предоставления услуг и любые отдельные соглашения, согласно которым мы предоставляем Вам Услуги, регулируются и толкуются в соответствии с законодательством Норвегии.</p>
    <hr>
    <h2>Изменения в Условия обслуживания</h2>
    <p>Вы можете посмотреть любую последнюю версию Условий использования в любое время <a href="https://www.w3schools.com/about/about_copyright.asp" target="_blank" rel="nofollow">на этой странице</a>.</p>
    <p>Мы оставляем за собой право по собственному усмотрению обновлять, изменять или заменять любую часть настоящих Условий предоставления услуг, публикуя обновления и изменения на нашем сайте. Вы несете ответственность периодически проверять наш сайт на наличие изменений.</p>
    <p>Ваше дальнейшее использование или доступ к нашему веб-сайту или Сервису после публикации любых изменений в настоящих Условиях предоставления услуг означает принятие этих изменений.</p>
    <hr>
    <h2>Контактная информация</h2>
    <p>Если у вас есть какие-либо вопросы или сомнения относительно этих Условий, пожалуйста, свяжитесь с нами по адресу help@w3schools.com</p>
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="about_copyright.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="about_privacy.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>