<?php include '../include/head.php'; ?>
<title>Про авторское право. <?php include '../include/title.php'; ?></title>
<meta name="description" content="Авторское право от W3Schools - учебники по HTML, CSS, JavaScript, PHP, SQL и многое другое. Уроки для начинающих онлайн бесплатно. <?php include '../include/description.php'; ?>">
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_about.php'; ?>
<?php include '../include/before_content_about.php'; ?>
<article>
<h1>Про авторское право</h1>
<div class="w3-clear nextprev">
  <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
  <a class="w3-right w3-btn" href="about_terms.php">Next &#10095;</a>
</div>
<hr>
<p><strong>ИСПОЛЬЗОВАНИЕ W3SCHOOLS ПОДТВЕРЖДАЕТ СОГЛАСИЕ СО СЛЕДУЮЩИМ</strong>:</p>
<hr>
<h2>Информация об авторских правах</h2>
<p>Все страницы и графика на этом сайте является собственностью компании <b>Refsnes Data</b>.</p>
<p>Страницы, код или другое содержимое с <strong>W3Schools</strong> не могут быть распространены или воссозданы каким-либо образом, в каком-либо виде или форме без письменного разрешения <strong>Refsnes Data</strong>.</p>
<p>Невыполнение этого требования является нарушением законов об авторском праве.</p>
<hr>
<h2>Добросовестное использование</h2>
<p>Добросовестное использование определяет исключения <strong>W3Schools</strong> из прав, защищенных законом об авторских правах.</p>
<p>Добросовестное использование <strong>W3Schools</strong> включает использование материалов, защищенных авторским правом:</p>
<ul>
  <li>В исследовании</li>
  <li>В новостях</li>
  <li>В цитатах</li>
  <li>В комментариях</li>
</ul>
<p>Добросовестное использование <strong>W3Schools</strong> также включает в себя:</p>
<ul>
  <li>Ссылки на W3Schools</li>
  <li>Добавление W3Schools в поисковые системы</li>
  <li>Архивирование библиотеки W3Schools</li>
</ul>
  <?php include '../include/addown_content.php'; ?>
<h2>Использование W3Schools в учебе</h2>
<p>Добросовестное использование включает в себя использование защищенного авторским правом материала в обучении в рамках этого баланса:</p>
<h3>Благоприятное использование:</h3>
<ul>
  <li>Копирование примеров и фрагментов кода для некоммерческого обучения и исследований.</li>
  <li>Копирование небольших количеств, пригодных для обучения в классе.</li>
</ul>
<h3>Не благоприятное использование:</h3>
<ul>
  <li>Копирование для выгодного или коммерческого использования.</li>
  <li>Массовое или дословное копирование.</li>
  <li>Копирование больших количеств материалов.</li>
</ul>
<hr>
<h2>Ссылки на W3Schools</h2>
<p>Любой сайт может ссылаться на любую из страниц W3Schools. Однако, страницы с W3Schools не могут быть встроены в фрейм ссылающегося без письменного разрешения Refsnes Data.</p>
<hr>
<h2>Гарантии</h2>
<p>W3Schools предоставляется без каких-либо гарантий. Нет никаких гарантий, что использование сайта не будет прерываться. Все прямые или косвенные риски, связанные с использованием сайта, несет пользователь. Весь код, предоставленный W3Schools, предоставляется в качестве примера без каких-либо гарантий производительности, пригодности, пригодности для продажи и/или любых других гарантий (явных или неявных).</p>
<p>W3Schools может содержать неточности или ошибки. Refsnes Data не дает никаких гарантий в отношении точности сайта или его содержания. Если вы обнаружите, что сайт или его содержание содержит ошибки, пожалуйста, свяжитесь с нами, чтобы их можно было исправить.</p>
<p>Контактный адрес:</p>
<p><img src="../images/mail_w3schools.gif" alt="Mail to"/></p>
<hr>
<h2>Связанные сайты</h2>
<p>W3Schools содержит ссылки на другие сайты. Refsnes Data не несёт ответственности за контент, который появляется на этих связанных сайтах.</p>
<hr>
<h2>Ваше поведение</h2>
<p>Используя этот сайт, вы соглашаетесь с тем, что прочитали и приняли всю информацию на этой странице.</p>
<hr>
<div class="w3-clear nextprev">
  <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
  <a class="w3-right w3-btn" href="about_terms.php">Next &#10095;</a>
</div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>