<?php include '../include/head.php'; ?>
<title>Про конфиденциальность. <?php include '../include/title.php'; ?></title>
<meta name="description" content="Про конфиденциальность на W3Schools. Заявление о конфиденциальности. Использование персональных данных. <?php include '../include/description.php'; ?>">
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_about.php'; ?>
<?php include '../include/before_content_about.php'; ?>
<article>
    <h1>Про конфиденциальность</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="about_terms.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="about_advert.php">Next &#10095;</a>
    </div>
    <hr>
    <h2>Заявление о конфиденциальности для W3Schools</h2>
    <p>Настоящая Политика конфиденциальности описывает, как ваша личная информация собирается, используется и передаётся, когда вы посещаете или делаете покупки на сайте w3schools.com (&quot;Сайт&quot;). </p>
    <hr>
    <h2>Личная информация, которую мы собираем</h2>
    <p>Когда вы посещаете Сайт, мы автоматически собираем определенную информацию о вашем устройстве, включая информацию о вашем веб-браузере, IP-адресе, часовом поясе и некоторых файлах cookie, установленных на вашем устройстве. Кроме того, когда вы просматриваете Сайт, мы собираем информацию об отдельных веб-страницах или продуктах, которые вы просматриваете, какие веб-сайты или условия поиска направили вас на Сайт, а также информацию о том, как вы взаимодействуете с Сайтом. Мы называем эту автоматически собираемую информацию &quot;&quot;.</p>
    <p>Мы собираем информацию об устройствах с помощью следующих технологий:</p>
    <ul>
        <li>&quot;Cookie&quot; представляют собой файлы данных, которые размещаются на вашем устройстве или компьютере и часто содержат анонимный уникальный идентификатор. Для получения дополнительной информации о файлах cookie и о том, как отключить файлы cookie, посетите http://www.allaboutcookies.org.</li>
        <li>&quot;Log-файлы&quot;, и учетные записи пользователей, отслеживают действия, происходящие на Сайте, и собирают данные, включая ваш IP-адрес, тип браузера, интернет-провайдера, страницы перехода/выхода и отметки даты/времени.</li>
        <li>&quot;Web-маяки&quot;, &quot;теги&quot; и &quot;пиксели&quot; - электронные файлы, используемые для записи информации о том, как вы просматриваете Сайт.</li>
    </ul>
    <p>Кроме того, когда вы совершаете покупку или пытаетесь совершить покупку через Сайт, мы собираем от вас определенную информацию, включая ваше имя, платежный адрес, адрес доставки, платежную информацию (включая номера кредитных карт, адрес электронной почты и номер телефона). Мы называем эту информацию как &quot;Информация о заказе&quot;.</p>
    <hr>
    <h2>Персональная информация пользователя</h2>
    <p>Когда мы говорим о &quot;личной информации&quot; в этой Политике конфиденциальности, мы говорим как об информации об устройстве, так и об информации о заказе.</p>
    <p>Как мы используем вашу личную информацию?<br>Мы используем информацию о заказе, которую собираем, как правило, для выполнения любых заказов, размещаемых через Сайт (включая обработку вашей платёжной информации, организацию доставки и предоставление вам счетов-фактур и/или подтверждений заказов). Кроме того, мы используем эту информацию о заказе, чтобы:</p>
    <ul>
        <li>Общаться с вами;</li>
        <li>Проверять наши заказы на предмет потенциального риска или мошенничества;</li>
        <li>В соответствии с предпочтениями, которыми вы поделились с нами, предоставлять вам информацию или рекламу, относящуюся к нашим продуктам или услугам.</li>
    </ul>
    <p>Мы используем информацию об устройстве, которую мы собираем, чтобы помочь нам отследить потенциальный риск и мошенничество (в частности, ваш IP-адрес), и в более общем плане для улучшения и оптимизации нашего Сайта (например, путём создания аналитических данных о том, как наши клиенты просматривают и взаимодействуют с сайтом, а также для оценки успешности наших маркетинговых и рекламных кампаний).</p>
    <p>Мы используем информацию вашей учетной записи, которую мы собираем в целом, для генерации статистики для вас и предоставления персонализированных дорожных карт. Кроме того, мы используем эту информацию для:</p>
    <ul>
        <li>Комуникации с вами;</li>
        <li>В соответствии с предпочтениями, которыми вы поделились с нами, предоставлять вам информацию или рекламу, относящуюся к нашим продуктам или услугам.</li>
    </ul>
  <?php include '../include/addown_content.php'; ?>

    <h2>Передача вам личной информации</h2>
    <p>Мы передаём вашу Личную информацию третьим лицам, чтобы помочь нам использовать вашу Личную информацию, как описано выше.</p>
    <p>Например, мы используем Google Analytics, чтобы понять, как наши клиенты используют Сайт - вы можете узнать больше о том, как Google использует вашу личную информацию здесь:
        <a href="https://www.google.com/intl/en/policies/privacy/" target="_blank" rel="nofollow">https://www.google.com/intl/en/policies/privacy/</a>. Вы также можете отказаться от использования Google Analytics здесь:
        <a href="https://tools.google.com/dlpage/gaoptout" target="_blank" rel="nofollow">https://tools.google.com/dlpage/gaoptout</a>.</p>
    <p>Мы также используем Shopify для работы нашего интернет-магазина - вы можете узнать больше о том, как Shopify использует вашу личную информацию здесь:
        <a href="https://www.shopify.com/legal/privacy" target="_blank" rel="nofollow">https://www.shopify.com/legal/privacy</a>.</p>
    <p>Мы финансируем наш сайт, показывая рекламу, когда вы просматриваете сайт. Этой рекламой обычно управляет партнер, специализирующийся на размещении рекламы для нескольких сайтов. Эти партнеры неизменно собирают анонимные данные о веб-сайтах, которые вы посещаете, чтобы они могли персонализировать рекламу для вас, гарантировать, что вы не видите одну и ту же рекламу слишком часто, и в конечном итоге сообщать рекламодателям, какие объявления работают.</p>
    <p>Наконец, мы также можем передавать вашу Личную информацию в соответствии с применимыми законами и постановлениями, для ответа на повестку в суд, ордер на обыск или другой законный запрос информации, которую мы получаем, или для иной защиты наших прав.</p>
    <hr>
    <h2>Поведенческая реклама</h2>
    <p>Как описано выше, мы используем вашу личную информацию для предоставления вам целевой рекламы или маркетинговых сообщений, которые, по нашему мнению, могут вас заинтересовать. Для получения дополнительной информации о том, как работает таргетированная реклама, вы можете посетить образовательную страницу Network Advertising Initiative («NAI») по адресу <a href="http://www.networkadvertising.org/understanding-online-advertising/how-does-it-work" target="_blank" rel="nofollow">http://www.networkadvertising.org/understanding-online-advertising/how-does-it-work</a>.</p>
    <p>Вы можете отказаться от целевой рекламы, перейдя по ссылкам ниже:</p>
    <ul>
        <li>- Facebook: <a href="https://www.facebook.com/settings/?tab=ads" target="_blank" rel="nofollow">https://www.facebook.com/settings/?tab=ads</a></li>
        <li>- Google: <a href="https://www.google.com/settings/ads/anonymous" target="_blank" rel="nofollow">https://www.google.com/settings/ads/anonymous</a></li>
        <li>- Bing: <a href="https://advertise.bingads.microsoft.com/en-us/resources/policies/personalized-ads" target="_blank" rel="nofollow">https://advertise.bingads.microsoft.com/en-us/resources/policies/personalized-ads</a></li>
    </ul>
    <p>Вы можете получить полный список партнеров, которых мы используем, в нашем файле ads.txt.</p>
    <p>Кроме того, вы можете отказаться от некоторых из этих услуг, посетив портал отказа Digital Advertising Alliance по адресу:
        <a href="http://optout.aboutads.info/" target="_blank" rel="nofollow">http://optout.aboutads.info/</a>.</p>
    <p>Вы можете узнать больше об онлайн-рекламе или отказаться от почти всех рекламных файлов cookie на странице <a target="_blank" href="https://www.youronlinechoices.com" rel="nofollow">https://www.youronlinechoices.com</a>.</p>
    <p><b>Примечание:</b> Отказ не отключит рекламу, она просто больше не будет адаптирована для вас.</p>
    <hr>
    <!--
    <h2>Управление согласием</h2>
    <p>Если вы хотите изменить свой выбор в отношении вашей личной информации, вы можете использовать кнопку ниже:</p>
    <p><button class="w3-btn" onclick='__cmp( "showGUI", "learnMore", function(result){} )'>Управление согласием</button></p>
    <hr>
    -->
  <?php include '../include/addown_content.php'; ?>
    <h2>Не отслеживать</h2>
    <p>Обратите внимание, что мы не изменяем методы сбора и использования данных на нашем Сайте, когда видим сигнал &quot;Не отслеживать&quot; от вашего браузера.</p>
    <hr>
    <h2>Ваши права</h2>
    <p>Если вы являетесь резидентом Европы, у вас есть право на доступ к личной информации, которую мы храним о вас, и на то, чтобы попросить исправить, обновить или удалить вашу личную информацию. Если вы хотите воспользоваться этим правом, свяжитесь с нами, используя указанную ниже контактную информацию.</p>
    <p>Кроме того, если вы являетесь резидентом Европы, мы отмечаем, что мы обрабатываем вашу информацию для выполнения контрактов, которые у нас могут быть с вами (например, если вы делаете заказ через Сайт), или иным образом для преследования наших законных деловых интересов. Кроме того, обратите внимание, что ваша информация будет передана за пределы Европы, в том числе в Канаду и США.</p>
    <hr>
    <h2>Хранение данных</h2>
    <p>Когда вы размещаете заказ через Сайт, мы сохраняем информацию о вашем заказе для наших записей до тех пор, пока вы не попросите нас удалить эту информацию.</p>
    <hr>
    <h2>Изменения</h2>
    <p>Мы можем обновлять эту политику конфиденциальности время от времени, чтобы отражать, например, изменения в нашей практике или по другим операционным, юридическим или нормативным причинам.</p>
    <hr>
    <h2>Использование Google Диска в редакторе Tryit (Попробуйте сами)</h2>
    <p>Наш редактор Tryit позволяет пользователям сохранять код или импортировать код с Google Диска.</p>
    <p>Это позволяет пользователям:</p>
    <ul>
        <li>Сохранять примеры/код на своём Google Диске.</li>
        <li>Делиться примерами/кодом через Google Диск.</li>
    </ul>
    <p>W3Schools не хранит для себя и не передаёт эту информацию третьим лицам.</p>
    <p><b>Примечание.</b> Возможность сохранения кода на Google-диске используется только на оригинальном сайте W3Schools.com.</p>
    <hr>
    <h2>Ссылки</h2>
    <p>W3Schools содержит ссылки на другие сайты. Мы не несём ответственности за политику конфиденциальности или содержание таких веб-сайтов. Этот документ о конфиденциальности относится только к W3Schools.</p>
    <hr>
    <h2>Наши контакты</h2>
    <p>Для получения дополнительной информации о наших методах обеспечения конфиденциальности, если у вас есть вопросы или вы хотите подать жалобу, свяжитесь с нами по e&#8209;mail на help@w3schools.com или по почте, используя данные, указанные ниже:</p>
    <p>w3schools <br>[Re: Privacy Compliance Officer] <br>Larsamyraa 18, 4313 SANDNES, Norway</p>
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="about_terms.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="about_advert.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>