<?php include '../include/head.php'; ?>

<title>Про сайт <?php include '../include/title.php'; ?></title>
<meta name='description' content='W3Schools - самый большой в мире сайт по изучению веб-технологий. HTML, CSS, JavaScript, PHP, SQL и многое другое. <?php include '../include/description.php'; ?>'>
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_about.php'; ?>
<?php include '../include/before_content_about.php'; ?>

<article>
    <h1>Про сайт W3SchoolsRUS (на русском)</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="../index.php">&#10094; Home</a>
        <a class="w3-right w3-btn" href="index.php">Next &#10095;</a>
    </div>
    <hr>
    <h2>Сайт W3Schools на русском - это:</h2>
    <div class="w3-panel w3-info intro">
        <ul>
            <li>сайт для тех, кто хочет научиться создавать сайты с нуля до профессионального веб-сайта или разработки веб-приложения;</li>
            <li>переведен на русский язык и адаптирован для русскоязычного пользователя сайт по материалам крупнейшего в мире и самого известного сайта для веб-разработчиков - <a href="https://www.w3schools.com/" target="_blank" rel="nofollow"><em>w3schools.com</em></a>;</li>
            <li>бесплатный Интернет-ресурс, благодаря которому можно изучить основы самых популярных веб-технологий: <em>HTML, CSS, JavaScript, PHP, SQL, Python, jQuery, W3.CSS</em> и пр.;</li>
            <li>сайт, который создан <del>непрофессионалом-любителем</del> для начинающих веб-разработчиков только с помощью технологий <em>HTML/CSS</em> в качестве примера и учебника для обучения;</li>
            <li>сайт, который постоянно обновляется и развивается, становясь все более популярным среди русскоязычных ресурсов подобной тематики.</li>
        </ul>
    </div>
    <hr>
    <div style="background: #ffffe7; text-align: justify; padding:10px;">
        <h2>Что такое W3SchoolsRUS (на русском)?</h2>
        <p class="w3-center">Главный принцип и причина создания данного сайта -<br><span style="color: #b40000">ЗНАНИЯ ДОЛЖНЫ БЫТЬ БЕСПЛАТНЫ И ДОСТУПНЫ ВСЕМ ЖЕЛАЮЩИМ!</span>
        </p>
        <p>В Интернете существует множество различных курсов по обучению веб-разработке. Обычно курсы платные, но есть много сайтов, которые предлагают абсолютно бесплатные уроки, по которым может учиться практически любой желающий. Есть много книг по веб-дизайну и веб-программированию. Многие из них также доступны в сети для бесплатного скачивания. Есть множество различных видео-уроков на YouTube, которые также доступны всем желающим.</p>
        <p>Как видим, возможностей для самообразования и получения необходимых знаний сейчас очень много. И каждый может выбрать для себя любой из этих способов обучения, в том числе и получение знаний по веб-разработке.</p>
        <p>Один из самых популярных в мире интернет-ресурсов по обучению программированию и веб-технологий - это сайт <a href="https://www.w3schools.com/" target="_blank" rel="nofollow"><strong>W3Schools.com</strong></a>. На этом сайте есть онлайн-учебники по такии технологиям, как HTML, CSS, JavaScript, PHP, Python, SQL, Bootstrap, Node.js, jQuery и многим другим. Сайт очень популярен в таких странах, как США, Канада, Индия, Пакистан, Иран, Автралия, Великобритания. Именно из этих стран больше всего пользователей этого интернет-ресурса. Среди русскоязычных пользователей этот сайт не так популярен потому, что он англоязычный и на данный момент не имеет русскоязычной версии. Что вызывает явные неудобства для пользователей, которые не знают (или плохо знают) английский язык. Но сам сайт очень удобен, информативен и полезен для обучения практически всем основным веб-технологиям, особенно для новичков.</p>
        <p>А так как я сам являюсь начинающим веб-разработчиком, который продолжает еще учиться веб-технологиям, и заинтересован в более доступном и понятном изложении учебных материалов, то решил сделать перевод популярного образовательного Интернет-ресурса для веб-разработчиков на русский язык. В первую очередь я делал это для своего собственного удобства, но, возможно, моя работа также станет полезной и другим пользователям, которые хотят самостоятельно изучать веб-технологии.</p>
        <p>Сам сайт <strong>W3Schools.com</strong> является бесплатным и доступным образовательным ресурсом для всех пользователей. Таким же доступным я сделал и русскоязычную версию этого сайта, который, конечно же, не является полной копией, а имеет некоторые дополнительные материалы и объяснения от автора, так как некоторые материалы на оригинальной версии сайта, на мой взгляд, для русскоязычных пользователей могут быть не совсем понятны и доступны для восприятия. Поэтому сайт на русском языке я попытался адаптировать для русскоязычных пользователей, а также сделать его более понятным именно для новичков, которые пытаются самостоятельно разобраться в современных веб-технологиях. Если же кому-то все-таки будут непонятны некоторые материалы, названия, термины и др. на русскоязычный версии сайта, то всегда можно обратиться к первоисточнику - оригинальному сайту <strong>W3Schools.com</strong> и посмотреть текст на нём.</p>
        <p>Среди онлайн-учебников на сайте - уроки по таким веб-технологиям, как <strong>HTML, CSS, JavaScript, PHP, SQL, Python, Bootstrap</strong> и др. Для тех, кто только начинает изучать веб-технологии, рекомендуется проходить обучение веб-технологиям именно в такой последовательности, начиная с самого простого - языка разметки HTML, а также стилизации веб-страниц с помощью каскадных таблиц стилей CSS. Только освоив эти две веб-технологии, рекомендуется приступать к изучению более сложных технологий, например, таких языков программирования, как JavaScript, PHP, Python (по необходимости).</p>
        <p>Главная ценность данного ресурса - это информация на самом сайте, которая может быть полезна многим начинающим веб-разработчикам как для обучения, так и для работы.</p>
        <p>Удачи вам в обучении!</p>
        <p>Админ сайта <em>W3Schools на русском</em></p>
    </div>

    <h2 class="video-title">Где лучше всего изучать основы веб-разработки? Бесплатные уроки по HTML, CSS, JavaScript, PHP, SQL, Python и др.</h2>
    <div class="videowrap">
        <div class="videoblock">
            <iframe width="720" height="400" src="https://www.youtube.com/embed/O0Rk45j6hyg" allowfullscreen></iframe>
        </div>
        <br>
        <p>Данный видеоурок предназначен <strong>для начинающих</strong>, которые стремятся освоить язык разметки веб-страниц <strong>HTML</strong>.</p>
        <p>В Интернете существует множество онлайн-ресурсов для изучения веб-разработки. Самым популярным в мире бесплатным ресурсом является сайт <a href="https://www.w3schools.com/" target="_blank" rel="nofollow">W3Schools.com</a>. Перед вами русскоязычный аналог этого сайта <strong>"W3Schools на русском"</strong>: <a href="../index.php">w3schoolsRUS</a>, который максимально адаптирован для русскоязычных пользователей и рекомендуется для обучения таким веб-технологиям, как: HTML, CSS, JavaScript, SQL, PHP, Python, Bootstrap и др.</p>
        <p>На сайте <strong>W3Schools на русском</strong> вы сможете пройти полные курсы по всем приведенным технологиям. <strong>Бесплатные уроки</strong> будут полезны для начинающих, справочники пригодятся для работы профессиональным веб-программистам, веб-дизайнерам и веб-верстальщикам. Все уроки на сайте подойдут и для самых маленьких (детей младшего школьного возраста, новичков), школьников, студентов, т.к. изложены по принципу от простого к сложному. Начинайте изучать основы <strong>HTML5</strong>, <strong>CSS3</strong>, <strong>JavaScript</strong> для верстальщиков (фронтэнд-разработчиков). А потом переходите к урокам по языкам программирования: <strong>PHP</strong>, <strong>SQL</strong>, <strong>Python</strong> для веб-программистов (бэкэнд-разработчиков).</p>
    </div>
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="../index.php">&#10094; Home</a>
        <a class="w3-right w3-btn" href="index.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>