<?php include '../include/head.php'; ?>
<title>Про сайт <?php include '../include/title.php'; ?></title>
<meta name="description" content="Что такое сайт W3Schools на русском? Для кого создан сайт? Где пройти онлайн курсы для веб-разработчиков? Кто автор сайта? <?php include '../include/description.php'; ?>">
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_about.php'; ?>
<?php include '../include/before_content_about.php'; ?>

<article>
    <h1>Про сайт W3Schools</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="../index.php">&#10094; Home</a>
        <a class="w3-right w3-btn" href="about_copyright.php">Next &#10095;</a>
    </div>
    <hr>
    <div class="jumbotron w3-center intro">
        <h2>Самый большой сайт для веб-разработчиков в Internet!</h2>
        <h2>Больше 3 миллиардов страниц отображено за последний год!</h2>
        <h2>Больше 60 миллионов посетителей каждый месяц!</h2>
    </div>
    <hr>
    <h2>Что такое W3Schools?</h2>
    <p><strong>W3Schools - это сайт для веб-разработчиков</strong>, на котором представлены учебные пособия и справочные материалы по таким языкам веб-разработки и технологиям, как HTML, CSS, JavaScript, PHP, SQL, Python, jQuery, Java, W3.CSS и Bootstrap, которые охватывают большинство аспектов веб-программирования и веб-верстки.</p>
    <p>Сайт получил своё название от World Wide Web (W3), но не связан с W3C.</p>
    <p><strong>W3Schools</strong> сначала был создан в 1998 году норвежской компанией по разработке программного обеспечения и консалтинга Refsnes Data.</p>
    <p><strong>W3Schools - это школа для веб-разработчиков</strong>, которая охватывает все аспекты веб-разработки, предоставляет уроки как для начинающих, так и достаточно удобную и полезную помощь для более опытных разработчиков:</p>
    <ul class="w3-ul">
        <li><a href="../html/index.php">HTML Учебник</a> - <strong>уроки по HTML</strong> - языку разметки веб-страниц. Используется для создания веб-сайтов и веб-приложений. Основа всех основ для веб-программистов. Без применения HTML нельзя создать ни один сайт. Именно с HTML начинается изучение основ веб-разработки.</li>
        <li><a href="../css/index.php">CSS Учебник</a> - <strong>уроки по CSS</strong> - языку стилизации веб-страниц. Является составной частью современных веб-страниц и веб-приложений. Вместе с HTML является основой создания веб-сайтов, служит для визуального оформления и стилизации веб-страниц.</li>
        <li><a href="../js/index.php">JavaScript Учебник</a> - <strong>уроки по JavaScript</strong> - языку программирования, используемого для создания динамических веб-сайтов и веб-приложений. JavaScript может работать как на стороне клиента (в браузере), так и на стороне сервера (NodeJS)</li>
        <li><a href="../php/index.php">PHP Учебник</a> - <strong>уроки по PHP</strong> - скриптовому языку, используемого для создания интерактивных веб-сайтов и веб-приложений. Язык PHP работает на стороне сервера, генерируя готовы HTML-страницы</li>
        <li><a href="../sql/index.php">SQL Учебник</a> - <strong>уроки по SQL</strong> - языку, используемого для создания и управления базами данных</li>
        <li><a href="../python/index.php">Python Учебник</a> - <strong>уроки по Python</strong> - языку программирования Python, который используется как для создания веб-сайтов, так и приложений. Считается одним из самых простых языков для новичков, которые только начинают изучать программирование. Рекомендуется для изучения в качестве первого языка программирования для начинающих (для школьников, студентов)</li>
        <li><a href="../java/index.php">Java Учебник</a> - <strong>уроки по Java</strong> - языку программирования Java, который используется для создания приложений в самых разных областях и сферах деятельности</li>
        <li><a href="../cpp/index.php">C++ Учебник</a> - <strong>уроки по C++</strong> - языку программирования C++ (Си плюс плюс) - самому популярному языку для создания приложений и игр. Также язык C++ является языком-основой, благодаря которой были созданы и получили свое развитие другие современные языки программирования. Еще C++ называют усовершенствованной версией языка Си - одной из основных и первых языков программирования, придуманных программистами (ещё называют: язык C на анаболиках)</li>
        <li><a href="../cs/index.php">C# Учебник</a> - <strong>уроки по C#</strong> - языку програмирования от компании Microsoft</li>
        <li><a href="../bootstrap/bootstrap_ver.php">Bootstrap Учебник</a> - <strong>уроки по Bootstrap</strong> - популярного современного фреймворка, который существенно облегчает и ускоряет разработку сайтов</li>
        <li><a href="../jquery/index.php">jQuery Учебник</a> - <strong>уроки по jQuery</strong> - популярной JavaScript-библиотеки с открытым кодом. По сути, это готовые скрипты для использования на сайтах</li>
        <li><a href="../react/index.php">React Учебник</a> - <strong>уроки по React</strong> - открытой JavaScript-библиотеки для создания интерфейсов, которая призвана решать проблемы частичного обновления содержимого веб-страницы, с которыми сталкиваются в разработке одностраничных приложений.</li>
        <li><a href="../angular/index.php">AngularJS Учебник</a> - <strong>уроки по AngularJS</strong> - JavaScript-фреймворка с открытым программным кодом, который разрабатывает Google. Предназначен для разработки одностраничных приложений, состоящих из одной HTML страницы с CSS и JavaScript.</li>
        <li><a href="../xml/index.php">XML Учебник</a> - <strong>уроки по XML</strong> - предложенный консорциумом World Wide Web Consortium (W3C) стандарт построения языков разметки иерархически структурированных данных для обмена между различными приложениями, в частности, через Интернет.</li>
        <li><a href="../w3css/index.php">W3.CSS Учебник</a> - <strong>уроки по W3.CSS</strong> - фреймворка, созданного и распространяемого авторами сайта W3Schools.</li>
        <li><a href="../appml/index.php">AppML Учебник</a> - <strong>уроки по AppML</strong> - словаря для определения веб-приложений, от авторов сайта W3Schools.</li>
        <li><a href="../index.php">И много другого...</a></li>
    </ul>
    <hr>
    <h2>Простое обучение</h2>
    <p><strong>W3Schools</strong> сосредоточен на простоте.</p>
    <p><strong>W3Schools</strong> практикует простое и понятное обучение.</p>
    <p><strong>W3Schools</strong> использует простые объяснения кода с простыми иллюстрациями того, как его использовать.</p>
    <p>Учебные пособия <strong>W3Schools</strong> начинаются с базового уровня и переходят к профессиональным рекомендациям.</p>
    <hr>
    <h2>Попробуйте сами</h2>
    <p><strong>W3schools</strong> предлагает тысячи примеров кода.</p>
    <p>Используя наш онлайн-редактор, <a href="../tryit/index.php" target="_blank">Попробуйте сами</a>, вы можете отредактировать примеры и выполнить компьютерный код экспериментально, чтобы увидеть, что работает, а что нет, перед его реализацией.</p>
    <hr>
    <h2>W3Schools - это абсолютно бесплатно!</h2>
    <p><strong>W3Schools</strong> - это всегда был и будет абсолютно бесплатным ресурсом для начинающих разработчиков.</p>
  <?php include '../include/addown_content.php'; ?>
    <h2>Вы можете помочь</h2>
    <p>Многие люди очень усердно работают, чтобы сайт W3Schools оставался полезным, образовательным, обновленным и интересным.</p>
    <p>Если вы обнаружите ошибку или неработающую ссылку, сообщите нам об этом.</p>
    <p>Используйте ссылку &quot;СООБЩИТЬ ОБ ОШИБКЕ&quot; внизу каждой страницы.</p>
    <hr>

    <h2>Добавьте ссылку на нас</h2>
    <p>Если вы хотите, чтобы другие узнали о W3schools, добавьте ссылку на нас на других Интернет-ресурсах (сайтах, соц.сетях и т.д.).</p>
    <p>Чтобы добавить простую текстовую ссылку, вставьте следующий HTML-код на свой сайт:</p>
    <div class="w3-code w3-border notranslate htmlHigh">
        <div>
            &lt;a href=&quot;https://www.w3schoolsrus.github.io/&quot;&gt;W3Schoolsrus.github.io&lt;/a&gt;
        </div></div>

    <p>Если вы хотите связать ссылки баннером, пожалуйста, выберите отсюда:
        <a href="banners_buttons.php" target="_blank">Баннеры и Кнопки</a></p>
    <hr>

    <h2>Демография</h2>
    <table class="w3-table-all notranslate">
        <tr>
            <th style="width:50%">Происхождение</th>
            <th style="text-align:right">Процент</th>
        </tr>
        <tr>
            <td>Азия</td>
            <td style="text-align:right">38 %</td>
        </tr>
        <tr>
            <td>Америка</td>
            <td style="text-align:right">30 %</td>
        </tr>
        <tr>
            <td>Европа</td>
            <td style="text-align:right">27 %</td>
        </tr>
        <tr>
            <td>Африка</td>
            <td style="text-align:right">3 %</td>
        </tr>
        <tr>
            <td>Океания</td>
            <td style="text-align:right">2 %</td>
        </tr>
    </table>
    <p>Источник: <strong>Google Analytics</strong></p>
    <hr>
    <p><b>Примечание.</b> Перед вами русскоязычная версия сайта W3Schools.com - <?php include '../include/w3schools.php'; ?>, которая адаптирована для русскоязычных пользователей.</p>
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="../index.php">&#10094; Home</a>
        <a class="w3-right w3-btn" href="about_copyright.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>