<?php include '../include/head.php'; ?>
<title>Блог админа. <?php include '../include/title.php'; ?></title>
<meta name="description" content="Блог админа. Самые интересные темы. Полезная информация. Современные технологии. Основы HTML, CSS, JavaScript, PHP, SQL, Python и др. <?php include '../include/description.php'; ?>">
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_blog.php'; ?>
<?php include '../include/before_content_blog.php'; ?>

<article>
    <h1>Блог админа сайта W3Schools на русском</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="../index.php">&#10094; Home</a>
        <a class="w3-right w3-btn" href="whatsites.php">Next &#10095;</a>
    </div>
    <hr>
    <div class="jumbotron w3-center intro w3-light-blue">
        <h2>Самые актуальные и самые интересные темы по веб-разработке!</h2>
        <h2>Оригинальные решения, предложения, идеи и советы для начинающих!</h2>
        <h2>Все, что необходимо для начинающих веб-разработчиков - на одном сайте!</h2>
        <h3><a href="https://drive.google.com/file/d/1x0UxDPJsWo7NMcBX6Wz8oHrmI3UJETq-/view?usp=sharing" target="_blank">Офлайн-версия сайта W3Schools.com</a> - доступна для скачивания!</h3>
    </div>
    <hr>
    <h2>Что такое W3Schools на русском?</h2>
    <p>Сайт <strong>W3Schools на русском</strong> - это переведённый на русский язык сайт <strong>W3Schools.com</strong> с доролнительной адаптацией для русскоязычных пользователей. Сайт предназначен прежде всего для начинающих веб-разработчиков, на нём представлены учебные пособия и справочные материалы по таким технологиям, как HTML, CSS, JavaScript, PHP, SQL, Python, jQuery, Java, W3.CSS, Bootstrap и др., которые охватывают большинство направлений веб-программирования, веб-верстки и веб-дизайна.</p>
    <p>Сайт создавался с целью облегчить жизнь всем новичкам, которые стремятся освоить современные веб-технологии и программирование.</p>
    <p><strong>W3Schools на русском</strong> создан на основе оригинального сайта <a href="https://www.w3schools.com/" rel="nofollow" target="_blank">W3Schools.com</a> простым начинающим веб-разработчиком для своего собственного обучения на чистом HTML/CSS и не имеет интерактивных элементов, каких-либо секретных и непонятных скриптов, не требует регистрации и введения логина-пароля, а значит, не может собирать личные данные пользователей, куки и пр. информацию.</p>
    <p>Сайт полностью безопасный, проверенный на валидность и соответствует спецификации HTML5 / CSS3, работает практически во всех современных веб-браузерах и мобильных гаджетах.</p>
    <p>Сайт <strong>W3Schools на русском</strong> все ещё разрабатывается и постепенно наполняется материалами, поэтому некоторые ссылки могут временно не работать.</p>
    <p>Сайт <strong>W3Schools на русском</strong> написан на чистом HTML/CSS и размещен на бесплатном хостинге GitHub - поэтому его практически невозможно взломать (если не взломать сам GitHub!). Код сайта и все файлы можно посмотреть всем пользователям непосредственно на самом GitHub по ссылке:
        <a href="https://github.com/w3schoolsrus/w3schoolsrus.github.io" target="_blank">https://github.com/w3schoolsrus/w3schoolsrus.github.io</a>.</p>
    <p>Также все желающие могут совершенно бесплатно <a href="https://github.com/w3schoolsua/w3schoolsua.github.io/archive/master.zip">скачать zip-архив сайта W3Schools на русском</a> с Гитхаба. Но имейте в виду, что сайт в настоящее время ещё разрабатывается и постепенно наполняется материалами, постоянно обновляется. И в момент скачивания архив сайта может быть неполным или часть ссылок на нём не будут работать. Поэтому рекомендуется пользоваться сайтом "W3Schools на русском" непосредственно онлайн по ссылке:
        <a href="https://w3schoolsrus.github.io/" target="_blank">W3Schools на русском</a>.</p>
    <p>Для просмотра материалов сайта в разделе БЛОГ воспользуйтесь меню в левом сайдбаре!</p>
    <p>Для начала обучения необходимой вам веб-технологии - HTML, CSS, JavaScript, SQL, Python, PHP, Bootstrap, W3.CSS, jQuery и т.д. воспользуйтесь меню в верхнем сайдбаре или перейдите на <a href="../index.php">Главную страницу сайта</a>, и уже на ней выберите нужный вам курс или учебник.</p>
    <hr>

    <h2>W3Schools на русском - это ДОСТУПНО и абсолютно БЕСПЛАТНО!</h2>
    <p>W3Schools на русском языке всегда был и будет бесплатным ресурсом для веб-разработчиков и всех, кто только начинает изучать веб-технологии!</p>
    <p>Сайт W3Schools на русском - единственный максимально полный ресурс по современным веб-технологиям на русском языке, который постоянно обновляется и поддерживается разработчиком. Админ сайта пытается следить за всеми обновлениями в сфере веб-разработки и поддерживать все учебные материалы сайта в актуальном состоянии.</p>
    <p>Сайт W3Schools на русском - рекомендуется как для самостоятельного обучения и освоения современных веб-технологий, так и в качестве помощи для школьников, студентов, преподавателей учебных заведений, а также для всех, кто стремится изучить и применять на практике современные веб-технологии. Все материалы на сайте упорядочены, темы изложены по принципу от простого к сложному и являются достаточно доступными для восприятия и понимания. Если же с усвоением учебного материала у вас возникают трудности, то рекомендуется вернуться к предыдущим темам и пройти их повторно. При этом для закрепления знаний важно выполнять все приведенные примеры и упражнения.</p>
    <p>Главный принцип админа сайта - <strong>ЗНАНИЯ ДОЛЖНЫ БЫТЬ ДОСТУПНЫ И БЕСПЛАТНЫ ВСЕМ ЖЕЛАЮЩИМ!</strong></p>
    <p>Поэтому материалы на сайте предоставляются без какой-либо оплаты, без требований зарегистрироваться, записаться на какие-то платные курсы и т.п. Вам не нужно ни за что платить. Всё, что от вас требуется - это желание научиться современным веб-технологиям и, конечно же, ваше время, терпение и трудолюбие! Только так вы достигните результата!</p>
    <hr>
    <h2>Вы можете помочь сайту "W3Schools на русском"</h2>
    <p>Над созданием сайта на данный момент работает только один человек, поэтому процесс добавления материалов может быть достаточно длительным. Также возможны некоторые ошибки (от этого никто не застрахован!).</p>
    <p>Если вы обнаружите ошибку или неработающую ссылку, сообщите об этом администратору.</p>
    <p>Связаться с админом сайта можно с помощью соц.сети Facebook: <a href="https://www.facebook.com/websunsay/" rel="nofollow" target="_blank">WebSunSay</a> (данная ссылка в виде значка Facebook также есть в правом сайдбаре на каждой странице сайта).</p>
    <hr>
    <h2>Добавьте ссылки на этот сайт</h2>
    <p>Если вы хотите, чтобы другие узнали о <strong>W3schools на русском</strong>, добавьте ссылку на этот сайт на других Интернет-ресурсах (сайтах, соц.сетях и т.д.).</p>
    <p>Чтобы добавить простую текстовую ссылку, вставьте следующий HTML-код на свой сайт:</p>
    <div class="w3-code w3-border notranslate htmlHigh">
        <div>&lt;a href=&quot;https://www.w3schoolsrus.github.io/&quot;&gt;W3Schoolsrus.github.io&lt;/a&gt;</div>
    </div>
    <p>Или просто скопируйте адрес сайта в адресной строке браузера <a href="https://www.w3schoolsrus.github.io/">https://www.w3schoolsrus.github.io/</a> и добавьте в комментариях, постах соц.сетей, в блогах, различных тематических форумах и т.д., делитесь ссылкой с друзьями, коллегами по работе и всем, кому может быть интересен данный сайт. Благодаря этому вы сможете помочь сайту стать более популярным и посещаемым ресурсом по тематике веб-разработки.</p>
    <hr>
    <p><b>Примечание.</b> Если кому интересно, то сайт W3Schools доступен и на украинском языке по ссылке: <a
                href="https://w3schoolsua.github.io/" target="_blank"><span style="color: blueviolet"><strong>W3Schools на украинском (українською мовою)</strong></span></a>.</p>
    <p class="-ticket">Также вы можете <a href="https://drive.google.com/file/d/1x0UxDPJsWo7NMcBX6Wz8oHrmI3UJETq-/view?usp=sharing" target="_blank">скачать rar-архив оригинальной офлайн-версии сайта W3Schools.com на английском языке</a> с Google-диска абсолютно бесплатно и, розархивировав её, пользоваться сайтом W3Schools.com локально на своём компьютере.</p>
    <p><em>Админ сайта <a href="../index.php">"W3Schools на русском"</a></em>.</p>
<!--
    <h2>Иконки, которые используются на сайте</h2>
    <p>Иконки Font Awesome, которые используются на данном сайте.</p>
    <i class="fa fa-home"></i> - Домашняя страница<br>
    <i class="fa fa-menu"></i> - Меню бургер<br>
    <i class="fa fa-globe"></i> - Земной шар<br>
    <i class="fa fa-search"></i> - Поиск<br>
    <i class="fa fa-thumbs-o-up"></i> - Лайк<br>
    <i class="fa fa-facebook-square"></i> - Facebook<br>
    <i class="fa fa-twitter-square"></i> - Twitter<br>
    <i class="fa fa-instagram"></i> - Instagram<br>
    <i class="fa fa-linkedin-square"></i> - Linkedin<br>
    <i class="fa fa-caret-down"></i> - Каретка вниз<br>
    <i class="fa fa-caret-up"></i> - Каретка вверх<br>
    <i class="fa fa-adjust"></i> - День/ночь<br>
    <i class="fa fa-user"></i> - Юзер<br>
    <i class="fa fa-js"></i> - JavaScript<br>
    <i class="fa fa-python"></i> - Python<br>
    <i class="fa fa-php"></i> - PHP<br>
    <i class="fa fa-bootstrap"></i> - Bootstrap<br>
    <i class="fa fa-html5"></i> - HTML5<br>
    <i class="fa fa-css3"></i> - CSS3<br>
    <i class="fa fa-code"></i> - Скобки для HTML-кода<br>
    <i class="fa fa-graduation-cap"></i> - Выпускной колпак<br>
    <i class="fa fa-envelope"></i> - Конверт<br>
-->
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="../index.php">&#10094; Home</a>
        <a class="w3-right w3-btn" href="whatsites.php">Next &#10095;</a>
    </div>
    <!-- / Content -->
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>