<?php include '../include/head.php'; ?>
<title>SEO - СЕО Оптимизация. <?php include '../include/title.php'; ?></title>
<meta name="description" content="Что такое СЕО / SEO? Зачем нужна оптимизация и раскрутка сайта? Белая, серая и черная оптимизация. Как обмануть Google и Yandex? Как увеличить посещаемость сайта? Блог админа. <?php include '../include/description.php'; ?>">
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_blog.php'; ?>
<?php include '../include/before_content_blog.php'; ?>

<article>
    <h1>SEO. Поисковая оптимизация сайта. Краткие рекомендации</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="whatsites.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="imitation.php">Next &#10095;</a>
    </div>
    <div class="author">
        <p>Original: <strong>&quot;SEO. Search engine optimization site. Brief recommendations&quot;</strong>,<br><i>by WebSunSey updated on <time datetime="2019-11-13">13.11.2019</time></i></p>
    </div>
    <hr>
    <div class="w3-panel w3-info intro">
        <p>Поисковая оптимизация сайта или <strong>SEO</strong> (от англ. <em>search engine optimization</em>) - процесс корректировки <strong>HTML</strong>-кода, текстового наполнения (контента), структуры сайта, контроль внешних факторов для соответствия требованиям алгоритма поисковых систем, с целью поднятия позиции сайта в результатах поиска в этих системах по определенным запросам пользователей. Чем выше позиция сайта в результатах поиска, тем больше вероятность, что посетитель перейдет на него с поисковых систем, поскольку люди чаще всего переходят по первым ссылкам, которые находятся в <strong>ТОП-10</strong> поисковых выдач, например, в сервисах Google, Yandex, Bing, Yahoo и др. и намного реже переходят по ссылкам, которые в выдаче поисковиков находятся далее 10 места.</p>
    </div>
    <hr>
    <h2>SEO optimization. Продвижение и раскрутка. ТОП-10 в результатах поиска</h2>
    <p>Поисковые системы ранжируют сайты в поисковой выдаче по определенному коэффициенту релевантности (то есть, соответствия) ключевому запросу. Существует более 200 факторов ранжирования, используемых <strong>SEO</strong>-оптимизаторами для продвижения сайтов. Используя и максимально учитывая все эти 200 факторов, можно получить высококачественный сайт, который будет отвечать требованиям поисковых систем.</p>
    <hr>
    <h2>Методы SEO оптимизации</h2>
    <p>Методы оптимизации можно условно разделить на три класса:</p>
    <ul>
        <li><strong>Белая оптимизация</strong> - работа над ресурсом без применения официально запрещенных каждой поисковой системой методов раскрутки ресурса - без влияния на поисковые алгоритмы сайтов. Обо всех разрешенных методах поисковой оптимизации можно узнать непосредственно на поисковых сервисах;
        <li><strong>Серая оптимизация</strong> - сюда можно отнести добавление большого количества ключевых слов в текст страницы, часто с потерей читабельности для человека, неоднократное повторение ключевых запросов определенное количество раз в разных падежах, единственном и множественном числе, а также различных формах глаголов и т.п.;
        <li><strong>Чёрная оптимизация</strong> - это все методы, которые противоречат правилам поисковых систем. Среди них можно выделить следующие: использование дорвеев (страниц и ресурсов, созданных специально для роботов поисковых систем, зачастую с большим количеством ключевых слов на странице), приём под названием клоакинг (пользователю отдается одна страница, легко читается, а поисковому роботу - другая, оптимизированная под какие-либо запросы), использование скрытого текста на страницах сайта, использование "однопиксельных ссылок" и т.п.
    </ul>
    <hr>
    <h2>Кратко про SEO оптимизацию сайтов</h2>
    <p>Вообще, если с самого начала делать сайт по общепринятым рекомендациям и в соответствии с ныне действующей спецификацией <strong> HTML5 </strong>, который проходит валидацию без ошибок и предупреждений при проверке валидатором, то сайт уже будет прекрасно находиться различными поисковыми сервисами, в частности, такими как <em>Google</em> или <em>Yandex</em>. И хотя правильно сверстанный и валидный сайт ещё не означает присутствие в <strong>ТОП-10</strong> поисковых выдач по соответствующим запросам и согласно определенной на сайте тематике, всё равно это уже гарантирует его возможный успех в индексации и появлению в поисковой выдаче, пусть даже и не в первой десятке.</p>
    <p>А для того, чтобы сайт появился в <strong>ТОП-10</strong> результатов поиска, конечно, необходимо уделить должное внимание его <strong>SEO оптимизации</strong> с принятием всех необходимых мер для его продвижения и раскрутки. Особенно это касается коммерческих сайтов, владельцы которых имеют целью зарабатывание с помощью сайта денег и получение прибыли за счёт интернет-пользователей.</p>
    <p>Некоторые <strong>СЕО-оптимизаторы</strong> используют методы поисковой оптимизации сайтов, которые не всегда являются "честными", когда благодаря искусственно добавленным ключевым словам или фразам на страницах такой сайт попадает в <strong>ТОП-10</strong> поисковой выдачи, но сам сайт не содержит полезной для пользователей информации. Сейчас такие "чёрные" методы поисковой оптимизации прекрасно распознаются поисковыми сервисами, которые даже блокируют такие сайты, выбрасывая их из своих результатов поиска вообще.</p>
    <p>Но любой веб-мастер, веб-разработчик или веб-дизайнер, который работает непосредственно с <strong>HTML</strong> кодом, может провести <strong>SEO оптимизацию сайта</strong> для поисковых сервисов самостоятельно, используя очень простые, но достаточно эффективные методы для попадания в <strong>ТОП-10</strong> поисковой выдачи. Для этого необходимо лишь соблюдать определенные правила и рекомендации, которые сообщают сами поисковые сервисы, такие как <em>Google</em>, <em>Yandex</em>, <em>Yahoo</em>, <em>Bing</em> и другие. Ниже приводятся лишь некоторые, но наиболее важные рекомендации и требования по <strong>SEO оптимизации</strong> сайтов и, в результате, возможного попадания их в первую десятку поисковой выдачи.</p>
    <hr>
    <h2>Наиболее важные рекомендации по SEO оптимизации:</h2>
    <ul>
        <li>Страница должна быть доступна для поисковиков (код ответа 200). Страницы, которые запрещены к индексации поисковыми сервисами, не могут попасть в результаты поиска. Убедитесь, что URL возвращает код HTTP 200 и не блокируется в файле robots.txt, а также на странице нет редиректа (перенапрвления) с помощью метатега <b>refresh</b> на другой URL-адрес;</li>
        <li>Используйте оригинальный текст на сайте, которого нет больше нигде в Интернете. Рекомендуется использовать не менее 50 слов, или не менее 300 символов;</li>
        <li>Используйте точное вхождение ключевых слов в заголовок страницы <code class="w3-codespan">&lt;title&gt;</code>;</li>
        <li>Длина тега заголовка <code class="w3-codespan">&lt;title&gt;</code> должна быть от 10 до 70 символов (вместе с пробелами);</li>
        <li>Используйте только один метатег описания. Использование нескольких META-описаний существенно путает поискового робота и негативно сказывается на ранжировании сайта. Длина метатега описания <em>description</em> должна быть в пределах 70 - 300 символов (вместе с пробелами). Оптимально от 150 до 180;</li>
        <li>Используйте ключевые слова в метатеге <em>keywords</em>. Количество ключевых слов должно быть не более 10. Обычно это слова, которые наиболее часто встречаются на странице. На данный момент Google отказался от использования данного тега для индексации, но Яндекс индексирует (иногда). <span style="background:#eee;"><i>Хотя сейчас большинство поисковиков отказались от использования данного метатега, поэтому он уже не играет большой роли для продвижения</i></span>;</li>
        <li>Используйте тольки один тег <code class="w3-codespan">&lt;h1&gt;</code> на странице. На данный момент при проверке на валидаторе не считается ошибкой использование на странице тега <code class="w3-codespan">&lt;h1&gt;</code> более одного раза. Но для СЕО-оптимизации обычно рекомендуется использовать данный тег только один раз, заключив в него текст, который соответствует содержимому страницы, а также ключевые слова, по которым вы продвигаете данную страницу;</li>
        <li>Используйте длину текста между тегами <code class="w3-codespan">&lt;h1&gt;-&lt;/h1&gt;</code> не более 70 символов (с пробелами);</li>
        <li>Используйте хотя бы одно изображение на странице с применением тега <code class="w3-codespan">img</code>;</li>
        <li>Используйте обязательный атрибут <code class="w3-codespan">alt</code> для изображений;</li>
        <li>Используйте ключевые слова в атрибуте <code class="w3-codespan">alt</code> (рекомендуется, хотя не обязательно);</li>
        <li>Используйте атрибут <code class="w3-codespan">title</code> для изображений;</li>
        <li>Используйте ограниченное количество заголовков с тегами <code class="w3-codespan">&lt;h2&gt;</code>-<code class="w3-codespan">&lt;h4&gt;</code> на странице (рекомендуется в пределах 2-5);</li>
        <li>Используйте соотношение код/текст не более 20% (рекомендуется не более 10%);</li>
        <li>Используйте ключевые (тематические) слова равномерно по содержанию страницы;</li>
        <li>Используйте количество ключевых слов (тошноту слов) на странице в пределах 6-8% (рекомендуется не менее 1% от общего объёма текста). Ключевых слов может быть несколько (обычно до 10). Обратите внимание, что поисковые сервисы очень не любят перегруз ключевыми словами и значительно понижают ранжирование таких страниц в результатах поиска;</li>
        <li>Используйте выделение ключевых слов в содержании тегами <code class="w3-codespan">&lt;strong&gt;</code> и <code class="w3-codespan">&lt;em&gt;</code> умеренно и равномерно на странице. При этом не обязательно выделять все ключевые слова данными тегами. Также уместно выделение ключевых слов тегами <code class="w3-codespan">&lt;b&gt;</code>, <code class="w3-codespan">&lt;i&gt;</code> и <code class="w3-codespan">&lt;u&gt;</code>;</li>
        <li>Используйте количество <b>выделенных</b> ключевых слов с помощью семантических тегов <code class="w3-codespan">&lt;strong&gt;</code> и <code class="w3-codespan">&lt;em&gt;</code> не более 3-4% от общего количества текста. Если таких слов будет более 4% - поисковики будут считать такой текст переспамленным (замусоренным) и выкинут из результатов поиска;</li>
        <li>Используйте ключевые слова так, чтобы они были включены в: url-страницы, содержимом страницы, тег <code class="w3-codespan">title</code>, метатеги description и keywords, теги <code class="w3-codespan">h1-h6</code>, атрибуты изображений <code class="w3-codespan">alt</code>, текст привязки внутренних ссылок и текст привязки обратной ссылки;</li>
        <li>Избегайте многократного использования ключевых слов в метатеге описания <code class="w3-codespan">description</code>;</li>
        <li>Используйте соотношение текст/html на странице не менее 15%, т.е. количество текста не должно быть меньше 15% от веса страницы. Оптимальным показателем считается от 50% и больше;</li>
        <li>В тексте должны встречаться ключевые слова, которые есть в <code class="w3-codespan">&lt;h1&gt;</code>, <code class="w3-codespan">&lt;title&gt;</code>, <code class="w3-codespan">description</code>;</li>
        <li>Установите корректный язык вашей страницы (сайта), на котором больше всего создано контента в теге <code class="w3-codespan">&lt;html lang="Язык_страницы"&gt;</code>. Если ваш сайт на русском языке, то и язык должен быть установлен русский - Ru;</li>
        <li>Обязательно указывайте кодировку страницы <strong>UTF-8</strong> (это оптимальный вариант);</li>
        <li>URL-адрес сделайте более понятным людям и поисковым системам (согласно содержанию сайта или страницы). Оптимально использовать url из словами, которые соответствуют содержимому страницы и написанные латинскими буквами;</li>
        <li>Минимизируйте использование на странице встроенных стилей - конструкции типа <code class="w3-codespan">style=""</code> или теги <code class="w3-codespan">&lt;style&gt;</code>. Применяйте их только в случае крайней необходимости. Оптимально - перенесите стили в отдельный файл, используя на html-странице только классы - конструкцию <code class="w3-codespan">class=""</code>. Поисковики очень не любят использование встроенных стилей;</li>
        <li>Минимизируйте использование на странице встроенных скриптов с применением тегов в виде: <code class="w3-codespan">&lt;script&gt;</code><code>Какой-то javascript-код</code><code class="w3-codespan">&lt;/script&gt;</code>. Применяйте их только в случае крайней необходимости. Оптимально - перенесите стили в отдельный файл, используя на html-странице только подключение внешних скриптов в виде <code class="w3-codespan">&lt;script src=&quot;ссылка_на_скрипт.js&quot;&gt;&lt;/script&gt;</code>. Поисковики очень не любят использование встроенных скриптов;</li>
        <li>Откажитесь от лишних счётчиков (информеров) на сайте. Все они, как правило, используют javascript-код, который может быть как встроенным, имеющий подгрузку стороннего кода или изображений, так и с подключением внешних файлов javascript. Часто именно внешний (невидимый) javascript-код замедляет загрузку страницы, а также может содержать вредоносный код. Не используйте счётчики и разные информеры других сайтов, если не уверены в их безопасности и быстрой работе;</li>
        <li>Минимизируйте (или откажитесь полностью) от использования на странице flash-анимации, фреймов. Это негативно влияет на скорость загрузки страницы, обработку поисковиками и адаптивность сайта;</li>
        <li>Установите переадресацию домена с www на без www (или наоборот). Это важный момент в SEO оптимизации. Если этого не сделать, поисковые системы будут индексировать ваш сайт как два разных. Соответственно, ваш контент и ссылки будут делиться весом поровну, что уменьшает значимость сайта для поисковиков;</li>
        <li>Не используйте различные символы в ссылках, типа знаков ?, $, #, @ и т.д. Ссылка должна быть написана в виде обычного текста латиницей, оптимально - с содержанием ключевых слов;</li>
        <li>Не используйте нижнее подчёркивание в ссылках. Ссылка не должна быть в виде: <code>ссылка_на_страницу</code>. Используйте дефисы вместо этого;</li>
        <li>Используйте на странице не более 5-и внешних ссылок;</li>
        <li>Используйте атрибут со значением <code class="w3-codespan">rel="nofollow"</code> для внешних ссылок, которые не должны индексироваться;</li>
        <li>Если используете внешние ссылки, то подбирайте только такие ссылки, которые соответствуют тематике сайта;</li>
        <li>Если на сайте реализованы комментарии от всех пользователей, задайте nofollow всем пользовательским ссылкам в комментариях.</li>
        <li>Используйте перелинковку внутри сайта (ссылки с одной страницы на другую, но не более 100 ссылок на одной странице);</li>
        <li>Используйте на каждой второстепенной странице одну ссылку на главную страницу сайта;</li>
        <li>Используйте семантические теги. Они сообщают поисковым системам необходимую информацию о структуре и содержании страницы, что позволяет выдавать её пользователям по более релевантным запросам;</li>
        <li>Используйте карту сайта <strong>XML Sitemaps</strong>;</li>
        <li>Используйте файл <strong>robots.txt</strong>, в котором должны быть указаны все наиболее важные страницы сайта, и которые должны индексироваться поисковыми сервисами;</li>
        <li>Используйте <strong>Favicon</strong> (иконку) для сайта;</li>
        <li>Разместите в корне сайта страницу <strong>404 error page</strong>;</li>
        <li>Оптимизируйте изображения (уменьшите размер насколько это возможно);</li>
        <li>Используйте <strong>Mobile Viewports</strong> (оптимизация для мобильных устройств);</li>
        <li>Сделайте оптимальным размер активных элементов (размер ссылок для малых экранов);</li>
        <li>Вес любой веб-страницы со всеми элементами не должен превышать 100Кбайт (лучше до 50Кбайт);</li>
        <li>С одной страницы должно быть не более 50 ссылок на другие страницы сайта;</li>
        <li>При клике на логотип сайта должен быть переход на главную страницу сайта с любой другой страницы;</li>
        <li>При перелинковке анкором ссылки необходимо делать с помощью слова или словосочетания, которое будет соответствовать тематике;</li>
        <li>Проверяйте веб-страницы на соответствие спецификации <strong>HTML5</strong> с помощью валидатора: <a href="https://validator.w3.org/" target="_blank" rel="nofollow">validator.w3.org</a>. Точно также проверяйте и <strong>CSS3:</strong> <a href="https://jigsaw.w3.org/css-validator/" target="_blank" rel="nofollow">jigsaw.w3.org/</a>. При обнаружении ошибок исправьте их и только потом размещайте страницы в Интернете.</li>
    </ul>
    <hr>
    <h3>Дополнительная SEO оптимизация</h3>
    <ul>
        <li>Используйте сжимание кода (компрессия HTML/CSS/JS файлов);</li>
        <li>Зарегистрируйте сайт в поисковых сервисах (Google, Yandex, Bing, Meta и др.) и в разных каталогах сайтов;</li>
        <li>Используйте микроразметку - словари <strong><a href="https://schema.org/" target="_blank" rel="nofollow">schema.org</a></strong> - которые читаются машинами;</li>
        <li>Используйте теги разметки <strong>Open Graph Protocol</strong> (для соц. сетей);</li>
        <li>Используйте инструмент отслеживания аналитики (<strong>Google Analytics</strong>, <strong>Yandex-метрика</strong>);</li>
        <li>Максимально увеличте количество активных ссылок на ваш сайт (или на отдельные его страницы) из других сайтов;</li>
        <li>Поощряйте пользователей посетить ваш сайт (используя ссылку на сайт в соцсетях);</li>
        <li>Используйте основной запрос (или ключевые слова) в первом и последнем абзаце текста. Помните, абзацы должны быть не более 4 строк;</li>
        <li>Используйте маркеры и списки, выделяя важные части нумерацией или жирным шрифтом (тег <code class="w3-codespan">&lt;strong&gt;</code>);</li>
        <li>Добавьте на сайт кнопки лайков, репоста в любую из соц.сетей, что будет помогать распространению информации про ваш сайт и привлекать внимание новых пользователей.</li>
    </ul>
    <hr>
    <h3>ЧТО НЕЛЬЗЯ ДЕЛАТЬ ПРИ СОЗДАНИИ ВЕБ-СТРАНИЦЫ:</h3>
    <ul>
        <li>Не злоупотребляйте количеством ключевых слов на странице;</li>
        <li>Не злоупотребляйте количеством слов, выделенных тегами <code class="w3-codespan">&lt;strong&gt;</code> или <code class="w3-codespan">&lt;em&gt;</code>;</li>
        <li>Не ставьте на странице циклические ссылки (которые ссылаются на эту же страницу);</li>
        <li>Не используйте подчеркивание в url-адресах (адрес_сайта_с_подчёркиванием) без крайней необходимости;</li>
        <li>Не допускайте неработающие (пустые, битые) ссылки на странице;</li>
        <li>Ссылок с коммерческими анкорами на сайте не должно быть больше 40%;</li>
        <li>Не создавайте более 5-и внешних ссылок в одном блоке. Если поисковик посчитает, что больше 5-и ссылок не подходят по тематике сайта, будут санкции;</li>
        <li>Не устанавливайте на странице в качестве обычного текста email адрес;</li>
        <li>Не используйте или старайтесь использовать минимально встроенные стили (CSS inline);</li>
        <li>Не используйте или старайтесь использовать минимально скрипты JavaScript на странице;</li>
        <li>Не используйте Flash без крайней необходимости;</li>
        <li>Не используйте iFrames без крайней необходимости;</li>
        <li>Не скрывайте текст из ключевых слов с помощью очень мелкого шрифта или цвета фона страницы. Поисковые сервисы это быстро распознают и обходят такие сайты.</li>
    </ul>
    <!-- / Content -->
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="whatsites.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="imitation.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>