<?php include '../include/head.php'; ?>

<title>Словарь начинающего программиста. <?php include '../include/title.php'; ?></title>
<meta name="description" content="Словарь терминов начинающего программиста и IT-разработчика. Что нужно знать. Кто это? Что это? Что такое? Что означает? Как называется? Кто такой? Популярные слова и выражения. <?php include '../include/description.php'; ?>">

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_blog.php'; ?>
<?php include '../include/before_content_blog.php'; ?>

<article>
    <h1>Словарь начинающего<span class="color_h1"> программиста</span></h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="wordpress_readme.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="index.php">Next &#10095;</a>
    </div>
    <hr>

    <div class="author">
        <p>Original: <strong>&quot;<a href="https://tpverstak.ru/programming-terms/" target="_blank" rel="nofollow">Словарь программиста: мини-словарь для начинающих разработчиков</a>&quot;</strong>,<br><i>Adaptation by WebSunSey - <time datetime="2020-12-04">04.12.2020</time></i></p>
    </div>
    <hr>
    <a href="../index.php"><img src="../images/verbit.jpg" alt="Словарь начинающего веб-программиста" class="w3-left w3-padding" title="Ликбез для начинающих IT-шников" width="160"></a>
    <p><strong>Ликбез</strong> для начинающих программистов. Словарь часто употребляемых слов в среде IT-разработчиков.</p>
    <h2>Что нужно знать начинающему программисту?</h2>
    <p>Слова и фразы в словаре отсортированы по алфавиту. Кстати, словарь можно дополнять. Пишите в комментариях термины, слова и выражения, с которыми вы сталкивались в учебе или работе в сфере IT.</p>
    <hr>
    <h2>А</h2>
    <p><strong>Аджайл</strong> — от англ. Agile. Общий термин, описывает ценности и принципы гибкой разработки программного обеспечения, а также практические подходы к разработке. Понятие Agile стало популярным после публикации Манифеста гибкой разработки программного обеспечения в 2001 году.</p>
    <p><strong>Ай-ди, Айдишник</strong> — id, идентификатор.</p>
    <p><strong>АйТи</strong> — IT (Information Technology) - информационные технологии.</p>
    <p><strong>АйТишник</strong> — человек, который занимается (учится или работает) в сфере информационных технологий.</p>
    <p><strong>Альфа</strong> — этап разработки программного обеспечения, на котором разработчики добавляют в программу новые функции, а тестировщики испытывают программу. Это внутренний или непубличный этап.</p>
    <p><strong>Апгрэйд</strong> — от анг. upgrade - обновление. Обычно обновление оборудования (например, компьютера).</p>
    <p><strong>Апдэйт</strong> — от анг. update - обновление данных. Обычно обновление программы, сайта и т.п.</p>
    <p><strong>АПИ, Апишка</strong> — API, программный интерфейс приложения или интерфейс прикладного программирования.</p>
    <p><strong>Аутсорс</strong> — аутсорсинг, передача компанией части операционной деятельности другой компании.</p>
    <p><strong>Адаптив</strong> — адаптивный дизайн, адаптация интерфейса к использованию на экранах с различным разрешеним (для мониторов ПК, планшетов, смартфонов).</p>
    <hr>
    <h2>Б</h2>
    <p><strong>Баг</strong> — от англ. Bug — жучок, клоп. Ошибка в программе.</p>
    <p><strong>Бахнуть</strong> — что-то быстро сделать, изменить или дополнить функциональность приложения.</p>
    <p><strong>Бета</strong> — бета-версия, приложение на стадии публичного тестирования.</p>
    <p><strong>Бот</strong> — сокращение от «робот». Ботом называют программу, которая автоматизирует интерфейс. Пример — автоответчик в чате.</p>
    <p><strong>Бэкэнд</strong> — от англ. Back-end. Программно-аппаратная или серверная часть приложения, невидимая обычным пользователям.</p>
    <p><strong>Бэкап, бэкапить</strong> — резервная копия или процесс создания резервной копии приложения.</p>
    <hr>
    <h2>В</h2>
    <p><strong>Ворнинг</strong> — от англ. Warning — предупреждение. Предупреждающее сообщение в интерфейсе.</p>
    <p><strong>Войтивайти</strong> (т.е. войти в IT) — обозначает процесс переквалификации далёкого от сферы IT специалиста в IT-разработчика.</p>
    <p><strong>Выкатить</strong> — сделать доступным для пользователей. Например, «выкатили новую версию сайта» значит сделали новую версию сайта доступной для пользователей.</p>
    <p><strong>Выпадашка</strong> — выпадающее меню (раскрывающееся), то же, что и "дропдаун" (от dropdown).</p>
    <hr>
    <h2>Г</h2>
    <p><strong>Галера</strong> — компания, в которой платят низкие зарплаты и не ценят разработчиков.</p>
    <p><strong>Гит</strong> — система контроля версий Git или сервис GitHub.</p>
    <p><strong>Говнокод</strong> — плохо написанный, неправильно отформатированный, некачественный код.</p>
    <p><strong>Говнокодер</strong> — тот, кто пишет говнокод.</p>
    <p><strong>Градиент</strong> — плавный переход из одного цвета в другой.</p>
    <hr>
    <h2>Д</h2>
    <p><strong>Движок сайта</strong> (или СиЭмЭс) — в веб-разработке так называют системы управления контентом (CMS).</p>
    <p><strong>Дебажить</strong> — поиск и устранение ошибок, багов в коде.</p>
    <p><strong>Демка, или Демо (демо-версии)</strong> — (от англ. demonstration — демонстрация) - жанр компьютерного искусства, представляющий собой мультимедийную презентацию. Демки создаются в целях демонстрации возможностей и знаний в области программирования, компьютерной графики и пр.</p>
    <p><strong>Деплой, деплоить</strong> — развёртывание, публикация рабочей версии приложения. Пример: задеплоить сайт — перенести сайт с тестового на рабочий сервер, сделать его доступным для пользователей.</p>
    <p><strong>Джун, джуниор</strong> — от англ. Junior. Младший (юный) разработчик. Специалист без опыта или с минимальным опытом работы.</p>
    <p><strong>Десигнер</strong> — презрительно-снисходительное название дизайнера.</p>
    <p><strong>Драй</strong> — от англ DRY, don’t repeat yourself. Принцип программирования, предлагающий избегать повторений кода.</p>
    <p><strong>Дропдаун</strong> — (от dropdown) выпадающее меню, то же, что и «выпадашка».</p>
    <hr>
    <h2>Ж</h2>
    <p><strong>Жаба</strong> (Джава) — язык программирования Java.</p>
    <p><strong>Жабаскрипт</strong> (Джава-скрипт) — язык программирования JavaScript.</p>
    <hr>
    <h2>З</h2>
    <p><strong>Залить</strong> — загрузить. Например, «залить файлы на сервер».</p>
    <p><strong>Запилить</strong> — сделать что-то, добавить какую-то функциональность.</p>
    <p><strong>Змея</strong> (или удав, питон) — язык программирования Python.</p>
    <hr>
    <h2>И</h2>
    <p><strong>Исходник</strong> — файлы, в которых находится исходный код приложения, или сам исходный код.</p>
    <p><strong>Итерация</strong> — повторение. «Мы сделали несколько итераций» — мы повторили шаг несколько раз.</p>
    <hr>
    <h2>К</h2>
    <p><strong>Коммит, коммитить</strong> — от англ. To commit — совершать. В контексте работы над приложением — сохранять код в репозитории.</p>
    <p><strong>Конфа</strong> — сокращенно от "конференция".</p>
    <p><strong>Копипастер</strong> - это лицо, которое, наполняя сайт контентом, использует частично либо полностью контент (тексты, видео, аудио, фото) из посторонних источников, не внося в материал своих изменений. По сути копипастер является сознательным нарушителем авторских прав, который ворует чужое.</p>
    <p><strong>Костыль</strong> — код, который нужен, чтобы исправить несовершенство ранее написанного кода.</p>
    <p><strong>Кряк</strong> (или крэк, или крак) (англ. crack) — программа, позволяющая осуществить взлом программного обеспечения. Как правило, кряк пригоден для массового использования. По сути, кряк является воплощением одного из видов взлома, зачастую, это обычный патч.</p>
    <hr>
    <h2>Л</h2>
    <p><strong>Либа</strong> — от англ. Library — библиотека. Речь идет о библиотеках кода, например, React.</p>
    <p><strong>Линтер</strong> — общее нарицательное название программ, которые анализируют код и предупреждают разработчика об ошибках.</p>
    <p><strong>Лист</strong> — от англ. List — список.</p>
    <p><strong>Локалка</strong> — локальный. Например, локальный сервер или сеть.</p>
    <p><strong>Лузер</strong> — от анг. loser - неудачник. Тот, кто постоянно испытывает неудачи в любом деле, за которое берётся.</p>
    <hr>
    <h2>М</h2>
    <p><strong>Мидл</strong> — от англ. Middle — средний. Уровень разработчика, следующий за джуниором. Опыт и уровень знаний миддла позволяет ему самостоятельно решать серьезные задачи.</p>
    <p><strong>Мёржить</strong> — от англ. Merge - склеивать. Речь идет об объединении или слиянии веток кода.</p>
    <p><strong>Меншить</strong> — от англ. Mention — упоминание. Речь идёт об упоминаниях в чатах или соцсетях. «Менши меня, когда будет готово» значит «упомяни меня, когда будет готово».</p>
    <p><strong>Ментор</strong> (наставник) — опытный профессионал, который помогает менее опытному человеку в учебе, работе, даёт советы, подсказки и т.д.</p>
    <hr>
    <h2>Н</h2>
    <p><strong>Навбар</strong> — (navbar) навигационный блок на сайте или в интерфейсе программы.</p>
    <p><strong>Накатить</strong> — внести изменения, задеплоить новую версию приложения. Противоположное термину «откатить».</p>
    <p><strong>Ноут</strong> — сокращенно от слова "ноутбук" - переносной персональный компьютер.</p>
    <hr>
    <h2>О</h2>
    <p><strong>Овертайм</strong> (от англ. «overtime») — переработка после окончания рабочего дня. Сверхурочные часы.</p>
    <p><strong>Околоайтишник</strong> — человек, который не является айтишником/программистом, но работает в сфере IT/программирования. Например, специалист по кадрам (HR), бухгалтер, финансист.</p>
    <p><strong>ООП</strong> (сокр. от «Объектно-Ориентированное Программирование») — методология/парадигма программирования, в которой основными концепциями являются объекты и классы.</p>
    <p><strong>Опенсурс</strong> (от англ. «open source software») — программное обеспечение/софт с открытым исходным кодом, который может использовать/дополнять/изменять любой желающий. В большинстве случаев это программное обеспечение является некоммерческим проектом.</p>
    <p><strong>Опенспейс</strong> (от англ. «open space») — офис открытого типа, где сотрудники работают в одном помещении (относительно большом) без каких-либо перегородок/стен.</p>
    <p><strong>Оперативка</strong> (или оператива) — оперативная память, она же «RAM» = «Random Access Memory», она же «ОЗУ» = «Оперативное Запоминающее Устройство».</p>
    <p><strong>ОС</strong> (или Ось - «операционка», сокр. «OS» от англ. «Operating System») = Операционная Система — программное обеспечение, которое позволяет управлять аппаратной частью компьютеров/ноутбуков/смартфонов и т.д. (например, Windows, MacOS, Linux, Android и т.п.)</p>
    <p><strong>Откатить</strong> — удалить изменения, вернуть предыдущую версию приложения. Противоположное термину «накатить».</p>
    <p><strong>Отладка</strong> (или дебаг) — этап в разработке программного обеспечения, на котором выполняется поиск и исправление ошибок.</p>
    <p><strong>Отладчик</strong> (или «дебаггер», от англ. «debugger») — программа, с помощью которой выполняется отладка.</p>
    <p><strong>Ось</strong> — операционная система.</p>
    <p><strong>Оффтоп</strong> (или «оффтопик», от англ. «off topic») — любое сообщение не по теме. Обычно такие сообщения удаляются, а пользователи, которые их добавляют - блокируются.</p>
    <hr>
    <h2>П</h2>
    <p><strong>Падаван</strong> — ироничное название стажёра или джуниора.</p>
    <p><strong>Патч</strong> — (от анг. patch - заплатка) - информация, предназначенная для автоматизированного внесения определённых изменений в компьютерные файлы. Применение патча иногда называется «пропатчиванием».</p>
    <p><strong>ПэКа (или ПК)</strong> — сокращенно от "персональный компьютер".</p>
    <p><strong>Пилот</strong> — пробная (пилотная) версия продукта.</p>
    <p><strong>ПиСи (или ПиСя)</strong> — сокращенно от анг. "PC" - Personal Computer - персональный компьютер.</p>
    <p><strong>Питон (или Пайтон)</strong> — язык программирования Python (Пайтон).</p>
    <p><strong>Подвал</strong> — то же, что и «футер». Элемент структуры веб-страницы, который находится в нижней части и содержит служебную информацию.</p>
    <p><strong>Поплыла вёрстка</strong> — некорректное отображение страницы в браузере.</p>
    <p><strong>Продакшн или продакшен (продакшн-код)</strong> — обозначение кода для рабочей версии приложении.</p>
    <p><strong>Пушить</strong> — использовать команду push, публиковать что-то.</p>
    <p><strong>Пэхапэ</strong> — язык программирования PHP, то же, что и «пыха».</p>
    <p><strong>Пыха</strong> — язык программирования PHP, то же, что и «пэхапэ».</p>
    <p><strong>ПэХаПэшник</strong> — тот, кто пишет код на языке PHP. Считается низшим сословием в среде программистов.</p>
    <hr>
    <h2>Р</h2>
    <p><strong>Релиз</strong> — программное обеспечение на стадии публичного использования. Стабильная версия программы, которая прошла тестирование.</p>
    <p><strong>Рекурсия</strong> — описание процесса с помощью самого процесса. Например, выражение «рекурсивный вызов функции» описывает ситуацию, в которой функция вызывает сама себя.</p>
    <p><strong>Репа</strong> — репозиторий, хранилище данных. Например, код программы можно хранить в репозитории на GitHub.</p>
    <p><strong>Ридми</strong> — файл Readme, в котором содержится информация о программе.</p>
    <p><strong>Ругаться, например, линтер ругается</strong> — сообщения об ошибках в коде, работе сервиса и так далее.</p>
    <hr>
    <h2>С</h2>
    <p><strong>Сабж</strong> — от английского Subject — (субъект), тема, предмет. «По сабжу» — по теме обсуждения.</p>
    <p><strong>Сайдбар</strong> — от английского Sidebar — (боковая панель). Элемент веб-страницы, обычно располагается в стороне от основного содержимого страницы (контента). Чаще всего содержит какое-либо меню или список.</p>
    <p><strong>Свитч</strong> — (от switch) - переключатель. Также - устройство-коммутатор, т.е. распределительный узел для сетевых устройств, но с расширенными функциями.</p>
    <p><strong>Сетка</strong> — модульная сетка, используется для дизайна и вёрстки страниц.</p>
    <p><strong>Сеньйор, синьор</strong> — от англ. Senior — старший разработчик, программист (после джуниора и мидла).</p>
    <p><strong>Скилл</strong> — от англ. Skill — навык, мастерство, умение - способность независимо выполнять некоторое действие, основанное на целесообразном использовании человеком приобретённых знаний и навыков. Предусматривает использование ранее приобретённого опыта и знаний.</p>
    <p><strong>Скрипт</strong> — от англ. Script — сценарий. Обычно скрипт - мини-программа, написанная на скриптовом языке (PHP, JavaScript и др.).</p>
    <p><strong>Скрипткиды</strong> — (от script kiddie) - термин, используемый для описания любителей, кто пользуется скриптами или программами, разработанными другими, для атаки компьютерных систем и сетей или дефейсу сайтов, не понимая механизма их действия.</p>
    <p><strong>Слетело</strong> — сломалось.</p>
    <p><strong>Снести</strong> — удалить (обычно ОС, программу, код и т.д.).</p>
    <p><strong>Стэк</strong> — изначально абстрактный тип данных. В разговорной речи используется для обозначения списка технологий, которые использует разработчик или компания. Пример: «Наш стек — HTML/CSS, JavaScript, React».</p>
    <p><strong>Собес</strong> — собеседование.</p>
    <p><strong>Софт</strong> — от англ. Software — программное обеспечение.</p>
    <p><strong>Софт-скилы</strong> — от англ. Soft skills — знания и качества специалиста, прямо не связанные с профессиональной деятельностью. Примеры: коммуникабельность, проактивность.</p>
    <hr>
    <h2>Т</h2>
    <p><strong>Темплейт</strong> — от английского template — шаблон.</p>
    <p><strong>Тестировщик</strong> — специалист по тестированию программного обеспечения.</p>
    <p><strong>Тимлид</strong> — сокращенно от английского Team leader — командный лидер, руководитель. Координатор группы программистов.</p>
    <p><strong>Туториал</strong> (от англ. tutorial) — сборник уроков для обучения чему-либо, учебник, руководство.</p>
    <hr>
    <h2>У</h2>
    <p><strong>Убить</strong> — удалить что-то. Например, «убить профиль» означает удалить профиль.</p>
    <p><strong>Утилита</strong> (или «утилитка», от англ. «utility») — вспомогательное программное обеспечение, предназначенное для выполнения вспомогательных работ, настройки системного оборудования, операционных систем и прочего. Другими словами, программа, которая помогает что-то сделать.</p>
    <hr>
    <h2>Ф</h2>
    <p><strong>Фаервол</strong> (от англ. «firewall») — антивирус (антивирусник), который защищает компьютер от вирусов. С английского означает «горящая стена» — здесь следует понимать стену, которая защищает другие здания от распространения пожара. Другое название — Brandmauer (в переводе с немецкого тоже означает «горящая стена»).</p>
    <p><strong>Факап</strong> (от англ. «fuck up») — неудача, провал, облом. Зачастую подразумеваются более-менее серьёзные ошибки.</p>
    <p><strong>Фидбек</strong> — от англ. Feedback — обратная связь.</p>
    <p><strong>Фича</strong> — функция, возможность. От англ. Feature.</p>
    <p><strong>Фрикинг</strong> — (от phreaking) - взлом телефонов и мобильных сетей с целью получения бесплатных звонков.</p>
    <p><strong>Фриланс</strong> (от англ. «freelance») — работа из дому, вне штата, иногда на себя, которая приносит деньги и в которой нет постоянного заказчика/начальника.</p>
    <p><strong>Фрилансер</strong> (от англ. «freelancer») — свободнозанятый человек, который работает на себя, т.е. занимается фрилансом.</p>
    <p><strong>Фреймворк</strong> — от англ. Framework — каркас. Инструмент разработки, набор типовых шаблонных решений, упрощающих работу программиста. Примеры: Laravel, Bootstrap.</p>
    <p><strong>Фронтэнд</strong> — от англ. Front-end — клиентская часть веб-приложения или сайта (обычно написаны на HTML/CSS/JS).</p>
    <p><strong>Фронтэндер</strong> — человек, который занимается клиентской частью веб-приложения или веб-сайта (обычно должен знать как минимум HTML/CSS/JavaScript).</p>
    <p><strong>Футер</strong> — от анг. Footer (подвал, подошва, подножка) - элемент структуры веб-страницы, обычно нижняя часть, в которой размещаются ссылки или краткое описание сайта, указываются реквизиты, адреса, номера телефонов и т.п.</p>
    <hr>
    <h2>Х</h2>
    <p><strong>Хакатон</strong> (от англ. «hack marathon») — мероприятие, на котором собираются специалисты из разных отраслей разработки программного обеспечения (чаще всего программисты, но могут быть и дизайнеры, тестеры) для разработки определённого решения/проекта/приложения/программы. Другими словами, марафоны программирования, на которые собираются программисты попрограммировать.</p>
    <p><strong>Хакер</strong> — (англ. Hacker, от to hack — рубать) - особа, которая пытается получить несанкционированный доступ к компьютерным системам, как правило, с целью получения секретной (скрытой от посторонних) информации.</p>
    <p><strong>Хатэмээль, хатээмэль, хтмл</strong> — HTML, язык гипертекстовой разметки, используется для написания сайтов.</p>
    <p><strong>Хард скиллы</strong> (от англ. «hard skills») — технические знания и навыки.</p>
    <p><strong>Хардкодить</strong> — статически прописывать в коде данные, которые должны вычисляться динамически. Плохая практика, антипаттерн в программировании.</p>
    <p><strong>Хацкер, кулхацкер</strong> — ироничное название начинающего специалиста, который считает себя опытным программистом. От английского hacker и cool hacker.</p>
    <p><strong>Хедер, хэдер</strong> — header — элемент структуры веб-страницы, находится в верхней части и обычно содержит логотип, меню, служебную информацию.</p>
    <hr>
    <h2>Ц</h2>
    <p><strong>ЦП</strong> — центральный процессор (он же «проц» или «процик»).</p>
    <p><strong>Цэмээс, цээмэс</strong> (СиЭмЭс) — от англ. CMS — content management system, система управления контентом.</p>
    <p><strong>ЦээСэС</strong> — от англ. CSS — Cascading Style Sheets, каскадные таблицы стилей, используются для стилизации (визуального оформления) веб-страниц.</p>
    <hr>
    <h2>Э</h2>
    <p><strong>Эксплойт</strong> (от англ. «exploit») — вредоносная программа, способная выполнять свой код через найденную уязвимость в другой программе.</p>
    <p><strong>Эникей</strong> (от англ. «any key») — любая кнопка. Часто, при установке или загрузке чего-либо, нас просят “Press any key” — отсюда и термин.</p>
    <p><strong>Эникейщик</strong> — неопытный пользователь, который не знает, что ему нужно делать — ищет кнопку «эникей». Или низкоквалифицированный IT-специалист (очень редко программист), который занимается рутинными, несложными заданиями.</p>
    <hr>
    <h2>Ю</h2>
    <p><strong>Юзать</strong> — от английского to use — использовать.</p>
    <p><strong>Юзер</strong> (или «юзверь», от англ. «user») — пользователь (обычно любитель бесцельно проводить время, сидя за писей).</p>
    <hr>
    <h2>Я</h2>
    <p><strong>Ява</strong> (или джава )— язык программирования Java.</p>
    <p><strong>Яваскрипт</strong> — (или джава-скрипт) язык программирования JavaScript.</p>
    <p><strong>ЯП (Япа)</strong> — язык программирования.</p>
    <hr>
    <h2>Единицы измерения на языке программистов</h2>
    <p><strong>Тонна (1к)</strong> (кило, кусок) - 1 Килобайт (1024 байта).</p>
    <p><strong>Лимон</strong> (лям) - 1 Мегабайт (1Мб = 1024Кб).</p>
    <p><strong>Гектар</strong> (гиг) - 1 Гигабайт (1Гб = 1024Мб).</p>
    <p><strong>Тера</strong> - (тер) - 1 Терабайт (1Тб = 1024Гб).</p>
    <!--/CONTENT-->

    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="wordpress_readme.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="index.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>