<?php include '../include/head.php'; ?>
<title>Какие бывают сайты? <?php include '../include/title.php'; ?></title>
<meta name="description" content="Какие бывают сайты? Виды сайтов. Блог админа. <?php include '../include/description.php'; ?>">
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_blog.php'; ?>
<?php include '../include/before_content_blog.php'; ?>

<article>
    <h1>Какие бывают сайты? Типы сайтов</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="seo_optimization.php">Next &#10095;</a>
    </div>
    <hr>
    <div class="w3-panel w3-info intro">
        <blockquote cite="https://uk.wikipedia.org/wiki/%D0%92%D0%B5%D0%B1-%D1%81%D0%B0%D0%B9%D1%82">
            <p><strong>Сайт</strong>, или <strong>веб-сайт</strong> (от англ. <em>website</em>, место, площадка в Интернете) — совокупность веб-страниц, доступных в сети Интернет, которые объединены как по содержанию, так и навигацией под единым доменным именем. Физически сайт может размещаться как на одном, так и на нескольких серверах.</p>
            <p><strong>Сайтом</strong> также называют узел сети Интернет, компьютер, за которым закреплен уникальный IP-адрес, и вообще - какой-то объект в Интернете, за которым закреплен адрес, идентифицирующий его в сети (FTP-site, WWW-site и т.д.).</p>
            <p style="text-align: right">(<i>из Википедии</i>)</p>
        </blockquote>
    </div>
    <hr>
    <a href="../images/typesites.png" target="_blank"><img alt='Типы сайтов' src="../images/typesites.png" style="width:95%;display:block;margin: auto;"></a>
    <hr>
    <h2>Разновидности сайтов</h2>
    <p>В данной статье вы узнаете, какие бывают сайты.</p>
    <h3>Какие бывают виды сайтов?</h3>
    <p>Сейчас, с развитием новых технологий, видов сайтов достаточно много. Как правило, вид сайта практически всегда определяется его целями и задачами. Например, вы хотите сделать сайт о себе любимом. Такой сайт будет иметь вид <strong>Персонального (личного) сайта</strong> . Или же - сайт-визитка, который может быть создан не только об одном человеке, но и о небольшой компании, организации или предприятии. Такие сайты, как правило, состоят всего лишь из одной или нескольких страниц (обычно до 10 страниц), которые могут быть написаны только с использованием <strong>HTML/CSS</strong>. Это самые простые сайты, состоящие из статических (не меняющихся) страниц. Сайты такого вида как правило включают в себя общую информацию о владельце сайта и его контактные данные. Такие сайты обычно самые дешёвые для заказчика и создаются достаточно быстро.</p>
    <p><strong>Корпоративные сайты</strong> - это более полнофункциональные представительства компаний в Интернете. Этот тип сайта подходит уже для средних и крупных компаний. Корпоративные сайты содержат полную информацию о компании и её деятельности, и соответственно, предназначены для продвижения какого-то бизнеса и зарабатывания денег.</p>
    <p><strong>Интернет-витрины</strong> , <strong>интернет-магазины</strong> , <strong>промо-сайты</strong> - это виды сайтов, основная задача которых - продавать (товары, услуги, информацию), популяризировать некую торговую марку, товар, услугу или даже человека (например, "звезду" кино или шоу-бизнеса).</p>
    <p><strong>Тематические сайты</strong> обычно содержат некоторую информацию любой конкретной тематики. Сюда же можно отнести и интернет-энциклопедии (например, <em>Википедию</em>).</p>
    <p><strong>Интернет-порталы</strong> - это тип сайтов, содержащих большое количество разнообразной информации. Как правило, порталы похожи по структуре с тематическими сайтами, но имеют более развитый функционал и большее количество сервисов и разделов. Также на порталах часто бывают разделы для общения пользователей: чаты, блоги и форумы.</p>
    <p><strong>Блоги</strong> - это тип сайтов, на которых владелец (обычно он же - администратор сайта) или редактор блога пишет посты со своими новостями, идеями, мыслями или другой информацией, которая постоянно обновляется. Отличительной особенностью блогов является актуальность публикуемой информации, так как устаревшая информация становится неактуальной и неинтересной посетителям. Блоги обычно делаются на какой-то <strong>CMS</strong> (от английского <em>Content Management System</em> ) - системе управления содержимым (контентом). Это компьютерная программа или информационная система, используемая для организации и обеспечения процесса относительно общего создания, управления и редактирования содержимого сайта. Такие системы еще называют "движками" сайтов. Самая популярная <strong>CMS</strong> в мире - это <em>Wordpress</em>. Есть и другие известные движки сайтов, такие как <em>Joomla</em>, <em>Drupal</em>, <em>DataLife Engine</em>, <em>MODX</em> и многие другие.</p>
    <p><strong>Каталоги сайтов</strong> - это вид сайтов, основным содержанием которых являются структурированные ссылки на другие сайты, а также их краткие описания.</p>
    <p><strong>Поисковые системы</strong> - вид сайтов, придназначенных для поиска страниц (сайтов) в Интернете по определённым запросам. Самые популярные поисковые системы: <em><a href="https://www.google.com/" rel="nofollow" target="_blank">Google.com</a></em>, <em><a href="https://www.yahoo.com/" rel="nofollow" target="_blank">Yahoo.com</a></em>, <em><a href="https://www.bing.com/" rel="nofollow" target="_blank">Bing.com</a></em>, <em><a href="https://www.aol.com/" rel="nofollow" target="_blank">AOL</a></em> (американские), <em><a href="https://www.yandex.com/" rel="nofollow" target="_blank">Yandex</a></em>, <em><a href="https://www.rambler.ru/" rel="nofollow" target="_blank">Rambler</a></em> (российские), <em><a href="https://www.baidu.com/" rel="nofollow" target="_blank">Baidu.com</a></em>, <em><a href="https://www.so.com/" rel="nofollow" target="_blank">360 Seach</a></em> (китайские), <em><a href="https://meta.ua/ua/" rel="nofollow" target="_blank">Meta</a></em>, <em><a href="https://www.ukr.net/" rel="nofollow" target="_blank">Ukr.net</a></em> (украинские) и др.</p>
    <p><strong>Почтовые сервисы</strong> - этот тип сайтов предоставляет интерфейс для работы с электронной почтой.</p>
    <p><strong>Интернет-форумы</strong> - на сайтах этого вида пользователи могут создавать темы, а также комментировать их. Как правило, форумы ограничены одной специфической тематикой, хотя встречаются и форумы «обо всем».</p>
    <p><strong>Сайты-хостинги</strong> - на сайтах этого типа реализована функция хранения любых файлов. Также часто встречаются сайты-хостинги с возможностью просмотра загруженных файлов прямо через браузер. В зависимости от типа файлов отображаются соответствующие значки. Если это видео-файлы, то иногда можно просматривать и само видео. Самый большой и самый популярный сайт-хостинг видео-файлов - <em><a href="https://www.youtube.com/" rel="nofollow" target="_blank">YouTube.com</a></em>. В Рунете также популярными являются такие видеохостинги, как <em><a href="https://rutube.ru/" rel="nofollow" target="_blank">Rutube.ru</a></em>, <em><a href="https://www.myvi.ru/" rel="nofollow" target="_blank">Myvi.ru</a></em>, <em><a href="https://rt.smotri.com/" rel="nofollow" target="_blank">Smotri.com</a></em> и др. Также к сайтам-хостингам относятся сайты для создания и хранения самих сайтов. Некоторые из них также являются и конструкторами сайтов. Например, один из популярных сайтов в Рунете - бесплатный хостинг и конструктор <em><a href="https://www.ucoz.com/" rel="nofollow" target="_blank">Ucoz.com</a></em>. Некоторые как платные, так и бесплатные хостинг-сервисы также предоставляют готовые движки сайтов (<strong>CMS</strong>) для сайтов-блогов, например, популярные <em><a href="https://www.blogger.com/" rel="nofollow" target="_blank">Blogger.com</a></em>, <em><a href="https://www.livejournal.com/" rel="nofollow" target="_blank">LiveJournal.com</a></em> (Живой Журнал), <em><a href="https://wordpress.com/" rel="nofollow" target="_blank">Wordpress.com</a></em> и другие.</p>
    <p><strong>Доска объявлений</strong> - на таких сайтах пользователи могут размещать или искать информацию в виде каких-либо объявлений, например - о купле-продаже товаров или услуг. Также к этому типу относятся сайты о поиске и предложения работы или сайты знакомств.</p>
    <p><strong>Социальные сети</strong> - тип сайтов, созданных для общения пользователей между собой. Это интерактивные сайты, на которых можно просматривать страницы других пользователей, общаться, комментировать, создавать группы по интересам и множество других сервисов. Также некоторые соц.сети ещё являются и большими файлообменными сервисами, на которых можно загружать, хранить и обмениваться различными типами файлов. Крупнейшие соцсети: <em><a href="https://www.facebook.com/" rel="nofollow" target="_blank">Facebook.com</a></em>, <em><a href="https://twitter.com/" rel="nofollow" target="_blank">Twitter.com</a></em>, <em><a href="https://www.instagram.com/" rel="nofollow" target="_blank">Instagram.com</a></em>, <em><a href="https://vk.com" rel="nofollow" target="_blank">VK.com</a></em>, <em><a href="https://ok.ru/" rel="nofollow" target="_blank">Одноклассники.ru</a></em>, <em><a href="https://i.qq.com/" rel="nofollow" target="_blank">Qzone.com</a></em> (самая большая китайская соц.сеть) и др.</p>
    <p>Некоторые сайты являются также и приложениями (обычно для мобильных устройств). Такие сайты уже создаются с помощью языков программирования (например, на языке <em>PHP</em>, <em>Python</em> (Питон), <em>Ruby</em> и др.).</p>
    <hr>
    <h3>Какие бывают сайты. Их структура. ВИДЕО</h3>
    <div class="videowrap">
        <div class="videoblock">
            <iframe style="width: 720px; height: 400px" src="https://www.youtube.com/embed/FjM1dT2_JcE" allowfullscreen></iframe>
        </div>
    </div>
    <p><a href="https://drive.google.com/file/d/1Eon8ccPs6PQA6bedmERVPuQtV2hJJsQP/view?usp=sharing" target="_blank">Смотреть видео на Google Drive</a></p>

    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="seo_optimization.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>