<?php include '../include/head_ai.php'; ?>

    <title>История чисел. Искусственный интеллект. W3Schools на русском</title>
    <meta name='description' content='Искусственный интеллект (ИИ). История чисел. Какие бывают числа? Системы счисления. Уроки для начинающих. Полный курс. Языки программирования. W3Schools на русском'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_ai.php'; ?>
<?php include '../include/before_content_ai.php'; ?>

<article>
    <h1>История чисел</h1>
    <div class='w3-clear nextprev'>
        <a class='w3-left w3-btn' href='ai_history_languages.php'>&#10094; Prev</a>
        <a class='w3-right w3-btn' href='ai_history_computers.php'>Next &#10095;</a>
    </div>
    <div class='w3-container w3-info'>
        <p>Чтобы понять Искусственный интеллект, важно понимать концепцию чисел и счета.</p>
    </div>

    <h2>Искусственный интеллект про числа</h2>
    <p>Искусственный интеллект - это всё о <strong>числах</strong>.</p>
    <p>Числа легко понять: 1,2,3,4,5 ... 11,12,13,14,15.</p>
    <p>Исследования на животных показывают, что даже животные могут понимать некоторые числа:</p>
    <ul>
        <li>2 Жены</li>
        <li>8 Сыновей</li>
        <li>5 Яиц</li>
    </ul>
    <p>Потребность в числах в современном мире абсолютна. Мы не можем жить без чисел:</p>
    <ul>
        <li>100 Долларов</li>
        <li>Pi = 3.12</li>
        <li>365 Дней</li>
        <li>25 Лет</li>
        <li>20% Налог</li>
        <li>100 Миль</li>
    </ul>
    <hr>

    <h2>Искусственный интеллект о подсчете</h2>
    <p>Концепция чисел приводит к концепции счета.</p>
    <p>Представьте себе доисторическое мышление:</p>
    <ul>
        <li>Как считать яблоки?</li>
        <li>Как взвесить кукурузу?</li>
        <li>Как платить?</li>
        <li>Как далеко до океана?</li>
    </ul>
    <p>Искусственный интеллект - результат потребности человека в вычислениях.</p>
    <p>Подсчет легко понять: 2 + 2 = 4.</p>
    <p>Исследования на животных показывают, что животные могут понимать только очень простой счет.</p>
    <p>Как Homo Sapiens (Человек Разумный) справляется с расчетами?</p>
    <p>Сложные вычисления производятся компьютерами.</p>
    <div class="w3-container w3-pale-red">
        <p>"Да! Компьютеры могут быть умнее многих людей!"</p>
    </div>
    <hr>
    <h2>Два вавилонских ученых</h2>
    <p>Дело было около 6000 лет назад...</p>
    <p>Два вавилонских ученых разговаривали:</p>
    <div class="w3-panel w3-info">
        <p>Ученый 1: "Нам нужно изобрести систему счисления".</p>
        <p>Ученый 2: "Что?"</p>
        <p>Ученый 1: "Нам нужно дать каждому номеру имя".</p>
        <p>Ученый 2: "Вы имеете в виду, как 1, 2 и 3".</p>
        <p>Ученый 1: "Точно!"</p>
        <p>Ученый 2: "Но почему?"</p>
        <p>Ученый 1: "Как я могу сказать вам, что у меня 7 сыновей, если вы не знаете, сколько их?"</p>
        <p>Ученый 2: "У каждого номера должно быть имя?"</p>
        <p>Ученый 1: "Точно!"</p>
        <p>Ученый 2: "Итак, сколько чисел нам нужно? 15?"</p>
        <p>Ученый 1: "Больше. У некоторых людей более 15 сыновей".</p>
        <p>Ученый 2: "Хорошо. 30 тогда. Просто чтобы быть уверенным".</p>
        <p>Ученый 1: "Но люди старше 30 лет должны уметь определять свой возраст".</p>
        <p>Ученый 2: "Хорошо. Тогда 60".</p>
    </div>

    <h2>Вавилонские числа (Base 60)</h2>
    <p>Мы считаем, что вавилоняне начали разработку сложного счета.</p>

    <a title="Josell7 / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)"
       target="_blank" href="https://commons.wikimedia.org/wiki/File:Babylonian_numerals.svg">
        <img style="width:100%;max-width:600px" alt="Babylonian Numerals"
             src="../images/img_babylonian_numerals.jpg"></a>

    <p>В вавилонской системе счисления 60 различных цифр. Это система <b>Base 60</b>:</p>
    <p>1,5 означает 1 умножить на 60 плюс 5 (65)<br>3,30 означает 3 раза по 60 плюс 30 (180 + 30 = 210)</p>
    <p>У вавилонян была система счисления, в которой цифры слева представляли полные значения, как в нашей десятичной системе.</p>

    <p>Причина, по которой вавилоняне использовали 60 в качестве основы, заключалась (нам нравится верить), что 60 делится на большинство чисел: 1,2,3,4,5,6,10,12,15,20,30 и 60.</p>
    <p>Обратной стороной было то, что пользователю приходилось запоминать 60 разных цифр. Но система была умной. Многие из них все ещё используются сегодня:</p>
    <table class="w3-table-all">
        <tr><th>Что</th><th>Мы</th><th>Им</th><th>Почему</th></tr>
        <tr><td>Полный круг</td><td>360°</td><td>4</td><td>4 x 60 = 360</td></tr>
        <tr><td>Половина круга</td><td>180°</td><td>2</td><td>2 x 60 = 180</td></tr>
        <tr><td>Один час</td><td>60°</td><td>1</td><td>1 x 60 = 60 seconds</td></tr>
    </table>
    <hr>

    <h2>Римские числа (Base 10)</h2>
    <p>Римские числа возникли в Риме и использовались в Европе в средние века.</p>
    <table class="w3-table-all">
        <tr><td>Символ:</td><td>I</td><td>II</td><td>III</td><td>IV</td><td>V</td><td>VI</td><td>VII</td><td>VIII</td><td>IX</td><td>X</td><td>L</td><td>C</td><td>D</td><td>M</td></tr>
        <tr><td>Значение:</td><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>7</td><td>8</td><td>9</td><td>10</td><td>50</td><td>100</td><td>500</td><td>1000</td></tr>
    </table>
    <p>Римляне использовали систему <b>Base 10</b>. Возможно, потому что они использовали свои 10 пальцев для счета.</p>
    <p>Сегодня в большинстве стран мира используется система счисления <b>Base 10</b>: западные числа, китайские числа, числа Брахми, греческие числа, числа на иврите...</p>
    <p>
        5 означает 5<br>
        50 означает 5 умножить на 10<br>
        500 означает 5 умножить на 100<br>
        <br>
        57 означает 5 умножить на 10 плюс 7<br>
        75 означает 7 умножить на 10 плюс 5<br>
    </p>
    <hr>

    <h2>Цифровые числа (Base 2)</h2>
    <p>Люди умеют считать с помощью десятичных чисел, компьютеры - нет.</p>
    <p>Электричество не может считать. Электричество может быть только включено или выключено.</p>
    <p>Компьютеры используют электричество или магнетизм для обозначения включения и выключения.</p>
    <p>Компьютеры используют <b>цифровые числа</b>, например 11100110 (в отличие от <b>чисел Base 10</b>, например 230).</p>
    <p>Цифровые числа, такие как 11100110, также называются <b>двоичными числами</b>.</p>
    <p>Вы узнаете больше о цифровых компьютерах в следующем разделе учебника.</p>
    <hr>
    <div class='w3-clear nextprev'>
        <a class='w3-left w3-btn' href='ai_history_languages.php'>&#10094; Prev</a>
        <a class='w3-right w3-btn' href='ai_history_computers.php'>Next &#10095;</a>
    </div>
</article>

    </div>
<?php include '../include/rightbar_ai.php'; ?>
<?php include '../include/footer.php'; ?>