<?php include '../include/head_ai.php'; ?>

    <title>История языков. Искусственный интеллект. W3Schools на русском</title>
    <meta name='description' content='Искусственный интеллект (ИИ). История языков. Уроки для начинающих. Полный курс. Языки программирования. W3Schools на русском'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_ai.php'; ?>
<?php include '../include/before_content_ai.php'; ?>

    <article>
        <h1>История языков</h1>
        <div class="w3-clear nextprev">
            <a class="w3-left w3-btn" href="ai_history_brain.php">&#10094; Prev</a>
            <a class="w3-right w3-btn" href="ai_history_numbers.php">Next &#10095;</a>
        </div>

        <div class="w3-panel w3-info">
            <p>Язык - это структурированная система общения.</p>
            <p>Это тип общения, в котором используются слова.</p>
        </div>

        <h2>Что такое язык?</h2>
        <p>Обезьяны и киты общаются друг с другом.</p>
        <p>Птицы и пчелы общаются друг с другом.</p>
        <p>Но только люди создали настоящий язык.</p>
        <p>Ни один другой вид не может выражать идеи с помощью предложений, составленных из набора слов (с глаголами и существительными).</p>
        <p>Это замечательное умение. И что еще примечательно: этим навыком овладевают даже дети.</p>
        <hr>

        <h2>Разговорные языки</h2>
        <p>Мы не уверены в том, сколько лет разговорной речи. Тема сложна для изучения из-за отсутствия доказательств.</p>

        <p>Мы не знаем, как это началось. Но у нас есть ключ к разгадке.</p>
        <p>Большие африканские обезьяны, Пан и Горилла - наши ближайшие живые родственники. Почему их называют "обезьянами"? Потому что они обезьяны. Обезьяны используют мимику, чтобы донести свое послание.</p>
        <p>Предполагается, что эволюция языков должна была быть долгим процессом. Наши предки могли начать говорить миллион лет назад, но с меньшим количеством слов, больше используя мимику и без какой-либо грамматики.</p>

        <div class="w3-panel w3-info">
            <p class="w3-xlarge w3-center w3-serif">Вавилонская башня</p>
            <p><a title='Питер Брейгель Старший, общественное достояние, через Wikimedia Commons'
                   target='_blank' href='https://commons.wikimedia.org/wiki/File:Pieter_Bruegel_the_Elder_-_The_Tower_of_Babel_(Vienna)_-_Google_Art_Project.jpg'>
                    <img style='width:100%' alt='Питер Брейгель Старший - Вавилонская башня (Вена) - Google Art Project'
                         src='../images/img_babel_tower.jpg'></a></p>
        </div>

        <h2>Когнитивное развитие</h2>
        <p>Согласно <a href="https://scholar.google.no/scholar?q=The+Faculty+of+Language:+What+Is+It,+Who+Has+It,+and+How+Did+It+Evolve%3F&hl=en&as_sdt=0&as_vis=1&oi=scholart">
                Хаузеру, Хомски и Фитчу (2002)</a>, существует шесть аспектов языкового развития:</p>
        <ul>
            <li>Теория разума</li>
            <li>Понимание голосовых сигналов</li>
            <li>Что такое имитация</li>
            <li>Что такое числа</li>
            <li>Что такое преднамеренное общение</li>
            <li>Понимание нелингвистических представлений</li>
        </ul>
        <hr>

        <h2>Теория разума</h2>
        <p><strong>Теория разума</strong> - это термин из психологии, обозначающий способность человека сочувствовать и понимать других.</p>
        <p>Это осознание того, что другие похожи на вас, с индивидуальными потребностями и намерениями.</p>
        <p>Одна из способностей пользователей языка - общаться о вещах, которые не являются конкретными, например о потребностях, идеях или концепциях.</p>
        <p><a href="https://en.wikipedia.org/wiki/Simon_Baron-Cohen" target="_blank">Саймон Барон-Коэн</a>, Британский психолог и профессор Кембриджского университета утверждает (1999), что "Теория разума" должна была предшествовать языкам, основываясь на знаниях о ранней человеческой деятельности:</p>
        <ul>
            <li>Обучение</li>
            <li>Достижение общих целей</li>
            <li>Создание общих планов</li>
            <li>Преднамеренное общение</li>
            <li>Преднамеренное разделение темы</li>
            <li>Намеренное разделение внимания</li>
            <li>Умышленное убеждение</li>
            <li>Преднамеренное притворство</li>
            <li>Умышленный обман</li>
        </ul>
        <hr>

        <h2>Письменные языки</h2>
        <p>Египетский и шумерский - самые ранние из известных письменных языков.</p>
        <p>(Самый старый письменный язык, используемый сегодня, - китайский).</p>
        <table class="w3-table-all">
            <tr><td>3500 BC</td><td>Sumerian / Шумерский</td></tr>
            <tr><td>3000 BC</td><td>Egyptian / Египетский</td></tr>
            <tr><td>1500 BC</td><td>Chinese / Китайский</td></tr>
            <tr><td>1500 BC</td><td>Greek / Греческий</td></tr>
            <tr><td>1250 BC</td><td>Chinese / Китайский</td></tr>
            <tr><td>1000 BC</td><td>Hebrew / Староеврейский</td></tr>
            <tr><td>900 BC</td><td>Aramaic / Арамейский</td></tr>
            <tr><td>700 BC</td><td>Etruscan / Этрусский</td></tr>
            <tr><td>500 BC</td><td>Tamil / Тамильский</td></tr>
            <tr><td>700 BC</td><td>Latin / Латинский</td></tr>
            <tr><td>100 AC</td><td>Sanskrit / Санскрит</td></tr>
            <tr><td>500 AC</td><td>Arabic / Арабский</td></tr>
            <tr><td>400 AC</td><td>Gothic (German) / Готический (Германский)</td></tr>
            <tr><td>700 AC</td><td>English / Английский</td></tr>
            <tr><td>700 AC</td><td>Japanese / Японский</td></tr>
            <tr><td>800 AC</td><td>French / Французский</td></tr>
            <tr><td>900 AC</td><td>Italian / Итальянский</td></tr>
            <tr><td>900 AC</td><td>Old Slavonic / Старославянский (Украинский)</td></tr>
            <tr><td>1000 AC</td><td>Spanish / Испанский</td></tr>
        </table>

        <hr>
        <div class="w3-clear nextprev">
            <a class="w3-left w3-btn" href="ai_history_brain.php">&#10094; Prev</a>
            <a class="w3-right w3-btn" href="ai_history_numbers.php">Next &#10095;</a>
        </div>
    </article>
    </div>
<?php include '../include/rightbar_ai.php'; ?>
<?php include '../include/footer.php'; ?>