<?php include '../include/head_ai.php'; ?>

    <title>Замена работы. Искусственный интеллект. W3Schools на русском</title>
    <meta name='description' content='Искусственный интеллект (ИИ). Замена работы человека. Где и как применяется искусственный интеллект? Уроки для начинающих. Полный курс. Языки программирования. W3Schools на русском'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_ai.php'; ?>
<?php include '../include/before_content_ai.php'; ?>

    <article>
        <h1>Искусственный интеллект. Замена работы</h1>
        <div class="w3-clear nextprev">
            <a class="w3-left w3-btn" href="ai_examples.php">&#10094; Prev</a>
            <a class="w3-right w3-btn" href="ai_sciences.php">Next &#10095;</a>
        </div>
        <hr>

        <h2>Какие рабочие места возьмут на себя компьютеры?</h2>
        <div class="w3-panel w3-info">
            <p><i>В <b>2013 году</b> Оксфордские ученые Карл Бенедикт Фрей и Майкл А.Осборн опубликовали вероятность того, что 47% всех профессий будут заменены компьютерами в течение <b>двух ближайших десятилетий</b>.</i></p>
            <a target="_blank" href="https://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf">
            <img title="Замена работы людей искусственным интеллектом" src="../images/img_replaced_jobs.jpg" style="width: 100%;"></a>
            <p>Источник: <a target="_blank" href="https://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf">Oxford - The_Future_of_Employment.pdf</a></p>
            <p>Таблица ниже, что из списка. Он классифицирует профессии по вероятности компьютеризации.</p>
        </div>

        <h2>Бухгалтерия</h2>
        <p>
            99% всех налоговых органов<br>
            99% всех клерков<br>
            98% всех бухгалтеров<br>
            98% всех кредитных аналитиков<br>
        </p>
        <p>Они были правы.</p>
        <p>Сегодня бухгалтерский учет хорошо автоматизирован.</p>
        <p>Для этих рабочих мест использование компьютеров намного дешевле работы людей.</p>
        <hr>

        <h2>Продажи и клиенты</h2>
        <p>
            99% всех участников телемаркетинга<br>
            97% всех кассиров<br>
            94% всех продавцов от двери до двери<br>
            92% всех страховых агентов<br>
            85% всех торговых представителей<br>
            58% всех финансовых консультантов<br>
            55% всего обслуживания клиентов<br>
            54% всех торговых агентов<br>
        </p>
        <p>Они были правы.</p>
        <p>Интернет-магазины набирают всё большую популярность.</p>
        <p>Показатели конверсии при продаже по телефону не очень привлекательны.</p>
        <hr>

        <h2>Производственные рабочие</h2>
        <p>
            98% всех операторов упаковочных машин<br>
            95% всех переплетчиков и отделочников<br>
            93% всех операторов промышленных грузовиков<br>
            92% всех рабочих на производстве<br>
            87% всех работников по приготовлению пищи<br>
        </p>
        <p>Роботы сборочного конвейера существуют уже 50 лет.</p>
        <p>Сегодня умных роботов программисты могут запрограммировать на выполнение любых действий.</p>
        <p class="tab">Роботы заменяют рабочие места на Amazon:</p>
        <iframe style="width: 80%;height: 300px" src="https://www.youtube.com/embed/UtBa9yVZBJM" allowfullscreen></iframe>
        <hr>

        <h2>Прочитать и написать</h2>
        <p>
            99% всех ключей для ввода данных<br>
            84% всех корректоров <br>
            65% всех библиотекарей<br>
            54% всех редакторов фильмов и видео<br>
        </p>
        <p>Программное обеспечение для корректуры повсюду. От проверки орфографии до
            <a target="_blank" href="https://rigorousthemes.com/blog/best-hemingway-app-alternatives/">Hemingway приложения</a>.
        </p>
        <hr>

        <h2>Бармены</h2>
        <p>
            81% всех поваров быстрого приготовления<br>
            77% всех барменов<br>
            77% всех посудомоечных машин<br>
        </p>
        <p>Кофейные роботы могут заменить многих баристов.</p>
        <p><a target="_blank" href="https://www.roboticstomorrow.com/story/2020/05/five-best-robot-coffee-baristas/15296/">5 лучших кофе-бариста-робота 2020</a></p>
        <hr>

        <h2>Почтовые службы</h2>
        <p>
            95% всех служащих почтовой службы<br>
            79% всех сортировщиков почты<br>
            75% всех почтмейстеров<br>
            68% всех почтовых перевозчиков<br>
        </p>
        <hr>

        <h2>Пилоты самолетов</h2>
        <p>55% всех пилотов</p>
        <p>Сегодня военные используют дроны.</p>
        <p>Завтра искусственный интеллект заменит пилотов грузовых самолетов.</p>
        <p>У пассажирских самолетов будет только один пилот. Второй пилот будет автопилотом.</p>
        <hr>

        <h2>Водители. Транспортные вакансии</h2>
        <p>
            69% всех водителей такси<br>
            69% всех водителей грузовиков<br>
            67% всех водителей автобусов<br>
        </p>
        <p>Беспилотные автомобили уже стали реальностью.</p>
        <p>Потенциал потери рабочих мест огромен.</p>
        <p>Очень скоро ИИ сможет заменить миллионы рабочих мест, связанных с транспортом.</p>
        <hr>

        <h2>К 2030 году роботы могут занять 20 миллионов рабочих мест</h2>
        <p>Согласно исследованию <a target="_blank" href="https://www.oxfordeconomics.com/">Oxford Economics</a>
            (проведенного в 2019 году), к 2030 году в Китае будет работать 14 миллионов роботов.</p>
        <p>
            <a target="_blank" href="https://www.oxfordeconomics.com/">
                <img style="width:100%;max-width:600px" alt="Job Losses" src="../images/img_job_losses.jpg"></a>
        </p>
        <hr>
        <div class="w3-clear nextprev">
            <a class="w3-left w3-btn" href="ai_examples.php">&#10094; Prev</a>
            <a class="w3-right w3-btn" href="ai_sciences.php">Next &#10095;</a>
        </div>
    </article>
    </div>
<?php include '../include/rightbar_ai.php'; ?>
<?php include '../include/footer.php'; ?>