<?php include '../include/head_ai.php'; ?>

    <title>Artificial Intelligence (AI) - Искусственный интеллект (ИИ). Учебник. W3Schools на русском</title>
    <meta name='description' content='Artificial Intelligence (AI) - Искусственный интеллект (ИИ). Уроки для начинающих. Полный курс. Языки программирования. W3Schools на русском'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_ai.php'; ?>
<?php include '../include/before_content_ai.php'; ?>

    <article>
        <h1>Artificial Intelligence (AI) - Искусственный интеллект (ИИ)</h1>
        <div class="w3-clear nextprev">
            <a class="w3-left w3-btn" href="../index.php">&#10094; Home</a>
            <a class="w3-right w3-btn" href="ai_history_brain.php">Next &#10095;</a>
        </div>

        <div class="w3-panel w3-info w3-center">
            <h2>Искусственный интеллект (ИИ)</h2>
            <p class="w3-large">очень<br>
                отличается от</p>
            <h2>Человеческого Интеллекта</h2>
        </div>

        <p>Искусственный интеллект / Машинный интеллект / Компьютерный интеллект</p>
        <p>Эти фразы предполагают, что машины могут имитировать людей в:</p>
        <ul>
            <li>Мышлении</li>
            <li>Обучении</li>
            <li>Планировании</li>
            <li>Общении</li>
            <li>Понимании</li>
        </ul>

        <p>Машины лучше людей понимают словесные команды, распознают лица, водят машины и играют в игры.</p>

        <p class="w3-xlarge w3-serif"><i>Сколько времени пройдет, прежде чем они разойдутся среди людей?</i></p>

        <p>Изучение искусственного интеллекта вызывает множество интересных вопросов:</p>
        <div class="w3-panel w3-info">
            <p>"Могут ли компьютеры думать как люди?"</p>
            <p>"Могут ли компьютеры быть умнее людей?"</p>
            <p>"Могут ли компьютеры захватить мир?"</p>
        </div>
        <p>Роботы-бармены на Quantum of the Seas - Royal Caribbean:</p>
        <p><iframe style="width:80%" height="300" src="https://www.youtube.com/embed/TBF7EE2xnN4"></iframe></p>

        <p>Чтобы понять ИИ, вы должны немного узнать о человеческом интеллекте, истории чисел и истории компьютеров.</p>

        <hr>
        <h2 class="redHead">Человеческий интеллект</h2>
        <p>Около 70000 лет назад что-то случилось с человеческим мозгом.</p>
        <p>Человеческий мозг начал развивать <b>когнитивный интеллект</b>:</p>
        <ul>
            <li>Умение понимать язык</li>
            <li>Умение понимать числа</li>
            <li>Умение понимать абстрактное мышление</li>
        </ul>
        <p>Чтобы понять искусственный интеллект, важно понимать <strong>человеческий интеллект</strong>.</p>
        <p><a href="ai_history_brain.php">Узнать больше ...</a></p>
        <hr>

        <h2 class="redHead">Языки</h2>
        <p>Постепенно когнитивный интеллект создал <b>слова и языки</b>.</p>
        <p>Чтобы понять искусственный интеллект, важно понимать использование языков.</p>
        <p><a href="ai_history_languages.php">Узнать больше ...</a></p>
        <hr>

        <h2 class="redHead">Числа</h2>
        <p>Когнитивный интеллект также создал <b>потребность в числах</b>.</p>
        <p>Чтобы понять искусственный интеллект, важно понимать числа и вычисления.</p>
        <p><a href="ai_history_numbers.php">Узнать больше ...</a></p>
        <hr>
        <h2 class="redHead">Компьютеры</h2>
        <p>ИИ - это результат человеческой потребности в выполнении <b>сложных вычислений.</b>.</p>
        <p>Сегодня этого можно достичь только с помощью высокоскоростных вычислений чисел, хранящихся в компьютере.</p>
        <p><a href="ai_history_computers.php">Узнать больше ...</a></p>
        <hr>

        <h2>Будут ли рабочие места заменены компьютерами?</h2>
        <div class="w3-panel w3-info">
            <p><i>В <b>2013</b> Оксфордские ученые Карл Бенедикт Фрей и Майкл А. Осборн опубликовали вероятность того, что 47% всех профессий будут заняты компьютерами за <b>два десятилетия.</b>.</i></p>
            <p><a target="_blank" href="https://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf">
                    <img title="Замененные рабочие места" src="../images/img_replaced_jobs.jpg" style="width: 100%" alt="Искусственный интеллект"></a></p>
        </div>
        <p><a href="ai_job_replacement.php">Узнать больше ...</a></p>
        <hr>
        <h2>Человеческий мозг лучше?</h2>
        <p>Могут ли мыслить животные, птицы, насекомые или растения?</p>
        <p>У людей мозг больше, чем у животных.</p>
        <p>У больших собак мозг больше, чем у маленьких. Большие собаки умнее?</p>
        <p>У птиц очень маленький мозг, но они знают, что не стоит заводить детей осенью, и знают, когда лететь на юг.</p>
        <p>У пчел мозг еще меньше, но они знают, как сообщить, где найти мед.</p>
        <p>У растений нет мозга, но они умеют размножаться и как подготовиться к зиме.</p>
        <hr>
        <div class="w3-clear nextprev">
            <a class="w3-left w3-btn" href="../index.php">&#10094; Home</a>
            <a class="w3-right w3-btn" href="ai_history_brain.php">Next &#10095;</a>
        </div>
    </article>
    </div>
<?php include '../include/rightbar_ai.php'; ?>
<?php include '../include/footer.php'; ?>