<?php include '../include/head.php'; ?>
<title>Учебник по кибербезопасности. Зарабатывание и вывод денег. <?php include '../include/title.php'; ?></title>
<meta name='description' content='Учебник по кибербезопасности. Зарабатывание денег в Интернете. Как безопасно вывести деньги в сети? Шантаж и вымогательство. Угрозы безопасности. <?php include '../include/description.php'; ?>'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_cybersecurity.php'; ?>
<?php include '../include/before_content_cybersecurity.php'; ?>

<article>
    <h1>Кибербезопасность. <span class="color_h1">Зарабатывание в Интернете и вывод денег</span></h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="cybersecurity_crime.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="cybersecurity_dark_web.php">Next &#10095;</a>
    </div>
    <hr>
    <h2>Управление деньгами</h2>
    <p>Организации часто сталкиваются с несколькими ключевыми угрозами:</p>
    <ul>
        <li>Файлы и системы программ-вымогателей зашифрованы ключами злоумышленников, и они требуют, чтобы вы заплатили деньги, чтобы вернуть свои данные;</li>
        <li>Майнеры криптовалюты; ваши системы заражены низкопрофильным инструментом для майнинга криптовалюты. Этот инструмент использует процессор, чтобы попытаться заработать на криптовалюте для злоумышленников;</li>
        <li>BEC (&quot;Business Email Compromise&quot; - &quot;Компромисс в деловой электронной почте&quot;). Пользователей взламывают с помощью всевозможных методов, а их электронные письма компрометируются. С помощью компрометации электронной почты злоумышленники могут перехватить сообщения, например, счет-фактуру, и попытаться перенаправить платежи в другие банки и счета.</li>
    </ul>
    <p>Есть много способов заработка для киберпреступников, которые привлекают людей и вызывают интерес.</p>
    <hr>

    <h2>Значение и энергия</h2>
    <p>Во многих вещах, связанных с ИТ, есть ценность и сила, например:</p>
    <ul>
        <li>Пропускная способность может использоваться для давления на компании, нацелив их на DDOS-атаки (&quot;Distributed Denial of Service&quot;)(&quot;распределенный отказ в обслуживании&quot;);</li>
        <li>Взломанные системы могут содержать ценную конфиденциальную информацию, например коммерческую информацию, игровые активы в Интернете, конфиденциальные фотографии и изображения;</li>
        <li>Злоумышленники могут установить себя в браузерах и попытаться захватить использование онлайн-банкинга.</li>
    </ul>
    <p>Возможность для преступников заработать значительные суммы денег в киберпространстве заставляет все больше и больше преступных группировок и других <em>оппортунистов</em> присоединяться к подобным действиям и значительно усложнять нашу жизнь.</p>
    <p class="w3-panel w3-note"><b>Примечание.</b> Оппортуни́ст — тот, кто ловко приспосабливается к сложившимся обстоятельствам. Оппортунист — последователь оппортунизма.<br>Оппортуни́зм (лат. <i>opportunus — возможность</i>) — термин, используемый в политике и экономической науке. В современной экономической теории под оппортунизмом понимают &quot;следование своим интересам, в том числе обманным путём&quot;.</p>
    <hr>

    <h2>Угроза для денег</h2>
    <p>Ещё одна распространённая атака, которую киберпреступники проводят с целью заработка, - это вымогательство, когда люди удерживаются в заложниках на основании имеющейся у них информации, пытаясь заставить их заплатить деньги, чтобы их освободили от попытки вымогательства. Рассмотрим следующий распространенный сценарий:</p>
    <ul>
        <li>Человек общается с кем-то незнакомым в Интернете. На самом деле собеседником может быть мошенник, пытающийся обмануть жертву;</li>
        <li>Они участвуют в интересных беседах и, кажется, сразу же прочно связываются друг с другом;</li>
        <li>Они могут даже участвовать в видеопереговорах, но мошенники, например, используют заранее записанное видео или просто имеют оправдание, что не могут активировать свой микрофон или веб-камеру;</li>
        <li>В дальнейшем общение может перерасти в отношения, в т.ч. сексуальные. Мошенник попытается убедить жертву отказаться от своих личных фотографий и записей, вероятно, в компромиссных ситуациях;</li>
        <li>Как только мошенник получает этот материал, возможно, даже возвращает поддельные фотографии невинных людей в аналогичных ситуациях, начинается вымогательство;</li>
        <li>Мошенник теперь может угрожать раскрыть компрометирующий материал членам семьи, коллегам и другим лицам, предлагая удалить материал, если на его счёт поступит определенная денежная сумма.</li>
    </ul>
    <p><img src="../images/img_scam-artist.png" alt="Scam Artist" style="width:100%;max-width:1278px"></p>
    <p>Подобные истории далеко не редкость, и существует бесчисленное множество различных сценариев и возможностей для преступников извлекать выгоду из жертв, использующих Интернет, не зная о связанных с этим рисках.</p>
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="cybersecurity_crime.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="cybersecurity_dark_web.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>