<?php include '../include/head.php'; ?>
<title>Учебник по кибербезопасности. Киберпреступность. <?php include '../include/title.php'; ?></title>
<meta name='description' content='Учебник по кибербезопасности. Что такое киберпреступность? Как поймать киберпреступников? Тёмная сторона Интернета. Кто использует чёрную паутину? <?php include '../include/description.php'; ?>'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_cybersecurity.php'; ?>
<?php include '../include/before_content_cybersecurity.php'; ?>

<article>
    <h1>Кибербезопасность. <span class="color_h1">Киберпреступность</span></h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="cybersecurity_money.php">Next &#10095;</a>
    </div>
    <hr>
    <h2>Киберпреступность</h2>
    <p>Что такое киберпреступность? Как и обычное преступление, она существует и в Интернете. Вот несколько примеров киберпреступности:</p>
    <ul>
        <li>Кража личных данных</li>
        <li>Интернет-хищники</li>
        <li>BEC ("Business Email Compromise - Компромисс в деловой электронной почте")</li>
        <li>Программы-вымогатели</li>
        <li>Кража конфиденциальной интеллектуальной собственности</li>
    </ul>
    <hr>
    <h2>Рост преступности</h2>
    <p>Киберпреступность регулярно растет с каждым годом. Почему киберпреступность растет? Вот несколько причин:</p>
    <ul>
        <li>Киберпреступление легко совершить</li>
        <li>Низкий риск быть пойманным</li>
        <li>За небольшую работу часто можно получить высокую прибыль</li>
        <li>Злоумышленники могут сразу атаковать тысячи (а иногда и миллионы) жертв</li>
        <li>С помощью криптовалют проще отмывать деньги</li>
    </ul>
    <p>Такие проблемы, как кража личных данных, могут иметь серьезные последствия для человека, вызывая не только потенциальные финансовые потери, но и множество личных страданий.</p>
    <p>Интернет предлагает множество услуг для облегчения отмывания денег, что обычно делает это тривиальным процессом. Поскольку деньги обмениваются в криптовалюте, такие сервисы, как тамблеры, затрудняют отслеживание денег.</p>
    <p>Тамблеры (тумблеры) - это сервисы, которые разделяют транзакции с криптовалютой и пересылают деньги через множество счетов с разными значениями тысячам людей, что затрудняет их отслеживание.</p>
    <hr>
    <h2>Киберпреступники</h2>
    <p>Кто такие киберпреступники? Это может быть кто угодно, но давайте рассмотрим нечто общее в них, что мы постоянно видим и слышим в СМИ:</p>
    <ul>
        <li>Спонсируемые государством (спецслужбами) группы, нацеленные на компании, организации в других странах</li>
        <li>Взлом групп, нацеленных на компании, чтобы заставить их платить выкуп (кибертероризм)</li>
        <li>Частные лица в домашних условиях занимаются незаконным взломом как акаунтов других частных лиц, так и компьютерных систем в различных компаниях, организациях, учреждениях (как правило - на заказ)</li>
    </ul>
    <div>
        <div class="w3-panel w3-note"><b>Примечание:</b> Криптовалюта - это деньги, представленные в цифровой форме, а не в физической. Существует множество различных криптовалют, некоторые из которых очень широко распространены, например, Биткойн, и другие (менее используемые и неизвестны большинству людей). Эти валютные модели полагаются на надёжную криптографию и системы публичных регистров для отслеживания транзакций и количества валюты на рынке.</div>
    </div>
    <hr>

    <h2>Как поймать киберпреступников?</h2>
    <p>Киберпреступники долго могут оставаться анонимными, используя тривиальные средства, и, как правило, им это удаётся. Когда же киберпреступники попадают в ловушку, то часто это происходит из-за ошибок самих киберпреступников, например, в результате самоуверенности, самоуспокоенности, ощущения вседозволенности и безнаказанности. У правоохранительных органов также есть большой потенциал использования пойманных киберпреступников для обнаружения киберпреступников в данной сфере.</p>
    <p>Однако правоохранительные органы сталкиваются с множеством проблем в отслеживании киберпреступлений. Вы можете увидеть атакующий трафик, поступающий из системы, находящейся в Великобритании, и, отключив эту систему, вы поймете, что она удаленно контролируется, например, другой системой в Индии. Сотрудничая с правоохранительными органами за границей, можно получить доступ к системе в Индии, но только для того, чтобы понять, что она снова управляется дистанционно, например, через Пакистан или Россию и т.д.</p>
    <img src="../images/img_vpn.png" alt="Global VPN" style="width:100%;max-width:1278px">
    <hr>
    <br>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="cybersecurity_money.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>