<?php include '../include/head.php'; ?>

  <title>HTML Мультимедия. Звук, музыка, видео, анимация. <?php include '../include/title.php'; ?></title>
  <meta name='description' content='HTML Мультимедиа на сайте. Как добавить мультимедийные элементы видео, аудио, анимацию на веб-страницу? <?php include '../include/description.php'; ?>'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_html.php'; ?>
<?php include '../include/before_content_html.php'; ?>

  <article>
    <h1>HTML <span class='color_h1'> Мультимедия</span></h1>
    <div class='w3-clear nextprev'>
      <a class='w3-left w3-btn' href='html5_svg.php'>&#10094; Prev</a>
      <a class='w3-right w3-btn' href='html5_video.php'>Next &#10095;</a>
    </div>

    <hr>
    <p class='intro'><strong>Мультимедиа</strong> в Интернете - это звук, музыка, видео, фильмы и анимация.</p>
    <hr>
    <h2>Что такое мультимедиа?</h2>
    <p>Мультимедиа поставляется в различных форматах. Это может быть почти всё, что можно услышать или увидеть.</p>
    <p>Примеры: изображение, музыка, звук, видео, записи, фильмы, анимация и тому подобное.</p>
    <p>Интернет-страницы часто содержат мультимедийные элементы различных типов и форматов.</p>
    <p>В этом разделе вы узнаете о различных мультимедийных форматах.</p>
    <hr>
    <h2>Поддержка браузерами</h2>
    <p>Первые веб-браузеры поддерживали только текст, ограничиваясь одним шрифтом одного цвета.</p>
    <p>Позже появились браузеры с поддержкой различных цветов и шрифтов, и изображений!</p>
    <p>Основные браузеры обрабатывают аудио, видео и анимацию по-разному. Пддерживаются различные форматы, а для некоторых форматов нужны дополнительные вспомогательные программы (плагины) для работы.</p>
    <p> Надеемся, что это всё станет историей. Мультимедийные технологии <strong>HTML5</strong> обещают более легкое будущее для мультимедиа.</p>
    <hr>
    <h2>Форматы мультимедиа</h2>
    <p>Мультимедийные элементы (например, аудио или видео) хранятся в медиафайлах.</p>
    <p>Самым распространенным способом выявления типа файла является просмотр расширение файла.</p>
    <p>Мультимедийные файлы имеют такие форматы и различные расширения: .swf, .wav, .mp3, .mp4, .mpg, .wmv, .avi. </p>
    <hr>
    <h2>Общие форматы видео</h2>
    <table>
      <tr>
        <td style='width:225px'><img alt='Видеоформаты' src='../images/pic_video.jpg' width='196' height='109'></td>
        <td style='vertical-align:top'>MP4 является основным форматом для Интернет-видео.<br>
          <br>MP4 рекомендуется сайтом YouTube.<br><br>MP4 поддерживается Flash плеерами.<br>
          <br>MP4 поддерживается HTML5.
        </td>
      </tr>
    </table>
    <br>

    <table class='w3-table-all notranslate'>
      <tr>
        <th>Формат</th>
        <th style='width:50px'>Файл</th>
        <th>Описание</th>
      </tr>
      <tr>
        <td>MPEG</td>
        <td>.mpg<br>.mpeg</td>
        <td>
          MPEG. Разработан Moving Pictures Expert Group. Первый популярный видеоформат в Интернете. Использовался для поддержки всех веб-браузеров, но не поддерживается в HTML5 (см. MP4).
        </td>
      </tr>
      <tr>
        <td>AVI</td>
        <td>.avi</td>
        <td>
          AVI (Audio Video Interleave). Разработан компанией Microsoft. Обычно используется в видеокамерах и телевизионном оборудовании. Отлично воспроизводится на компьютерах Windows, но не в веб-браузерах.</td>
      </tr>
      <tr>
        <td>WMV</td>
        <td>.wmv</td>
        <td>
          WMV (Windows Media Video). Разработан компанией Microsoft. Обычно используется в видеокамерах и телевизионном оборудовании. Отлично воспроизводится на компьютерах Windows, но не в веб-браузерах.</td>
      </tr>
      <tr>
        <td>QuickTime</td>
        <td>.mov</td>
        <td>
          QuickTime. Разработан Apple. Обычно используется в видеокамерах и телевизионном оборудовании. Отлично воспроизводится на компьютерах Apple, но не в веб-браузерах. (см. MP4)</td>
      </tr>
      <tr>
        <td>RealVideo</td>
        <td>.rm<br>.ram</td>
        <td>
          RealVideo. Разработан Real Media, что позволяет осуществлять потоковое видео с низкой пропускной способностью. Он по-прежнему используется для онлайн-видео и интернет-телевидения, но не воспроизводится в веб-браузерах.</td>
      </tr>
      <tr>
        <td>Flash</td>
        <td>.swf<br>.flv</td>
        <td>
          Flash. Разработан компанией Macromedia. Часто нужно иметь дополнительный компонент (плагин) для воспроизведения в веб-браузерах.</td>
      </tr>
      <tr>
        <td>Ogg</td>
        <td>.ogg</td>
        <td>
          Theora Ogg. Разработан Xiph.Org Foundation. Поддерживается HTML5.</td>
      </tr>
      <tr>
        <td>WebM</td>
        <td>.webm</td>
        <td>
          WebM. Разработан веб-гигантами Mozilla, Opera, Adobe и Google. Поддерживается HTML5.</td>
      </tr>
      <tr>
        <td>MPEG-4<br>или MP4</td>
        <td>.mp4</td>
        <td>
          MP4. Разработан Moving Pictures Expert Group. На основе QuickTime. Обычно используется в новых видеокамерах и телевизионном оборудовании. Поддерживается всеми браузерами HTML5. Рекомендуется YouTube.
        </td>
      </tr>
    </table>
    <div class='w3-panel w3-note'>
      <p>Только видео в форматах MP4, WebM и Ogg поддерживается стандартом HTML5.</p>
    </div>
    <hr>

    <h2>Аудио форматы</h2>
    <p>MP3 - самый новый формат для записанной музыки. Термин MP3 стал синонимом цифровой музыки.</p>
    <p>Если на вашем веб-сайте размещается записанная музыка, самый лучший выбор - это MP3.</p>
    <table class='w3-table-all notranslate'>
      <tr>
        <th>Формат</th>
        <th style='width:50px'>Файл</th>
        <th>Описание</th>
      </tr>
      <tr>
        <td>MIDI</td>
        <td>.mid<br>.midi</td>
        <td>
          MIDI (от англ. Musical Instrument Digital Interface - цифровой интерфейс музыкальных инструментов). Главный формат для всех электронных музыкальных устройств, таких как синтезаторы и звуковые карты ПК. Файлы MIDI не содержат звука, а цифровые заметки, которые могут воспроизводиться электроникой. Отлично воспроизводится на всех компьютерах и музыкальных устройствах, но не в веб-браузерах.</td>
      </tr>
      <tr>
        <td>RealAudio</td>
        <td>.rm<br>.ram</td>
        <td>
          RealAudio. Разработан Real Media, позволяет передавать аудио с низкой пропускной способностью. Не работает в веб-браузерах.</td>
      </tr>
      <tr>
        <td>WMA</td>
        <td>.wma</td>
        <td>
          WMA (Windows Media Audio). Разработан компанией Microsoft. Обычно используется в музыкальных плеерах. Отлично воспроизводится на компьютерах Windows, но не в веб-браузерах.</td>
      </tr>
      <tr>
        <td>AAC</td>
        <td>.aac</td>
        <td>
          AAC (Advanced Audio Coding). Разработан компанией Apple как стандартный формат для iTunes. Отлично воспроизводится на компьютерах Apple, но не в веб-браузерах.</td>
      </tr>
      <tr>
        <td>WAV</td>
        <td>.wav</td>
        <td>
          WAV. Разработан IBM и Microsoft. Отлично воспроизводится в операционных системах Windows, Macintosh и Linux. Поддерживается HTML5.</td>
      </tr>
      <tr>
        <td>Ogg</td>
        <td>.ogg</td>
        <td>
          Ogg. Разработан Xiph.Org Foundation. Поддерживается HTML5.</td>
      </tr>
      <tr>
        <td>MP3</td>
        <td>.mp3</td>
        <td>
          Файлы MP3 - это звуковая часть файлов MPEG. MP3 - самый популярный формат для музыкальных плееров. Сочетает в себе хорошее сжатие (малые файлы) с высоким качеством. Поддерживаются всеми браузерами.</td>
      </tr>
      <tr>
        <td>MP4</td>
        <td>.mp4</td>
        <td>
          MP4 является видеоформатом, но также может использоваться для аудио. MP4 видео - это новый формат видео в Интернете, который уже становится основным. Это приводит к автоматической поддержке MP4 аудио во всех браузерах.</td>
      </tr>
    </table>
    <div class='w3-panel w3-note'>
      <p>Стандарт HTML5 поддерживает лишь аудиофайлы MP3, WAV и Ogg.</p>
    </div>
    <hr>
    <div class='w3-clear nextprev'>
      <a class='w3-left w3-btn' href='html5_svg.php'>&#10094; Prev</a>
      <a class='w3-right w3-btn' href='html5_video.php'>Next &#10095;</a>
    </div>
  </article>
<?php include '../include/addown_content.php'; ?>
  </div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>