<?php include '../include/head.php'; ?>

  <title>HTML Резюме. Что учить дальше? <?php include '../include/title.php'; ?></title>
  <meta name='description' content='HTML Итоги. Вы изучили HTML, теперь что изучать? Какие языки программирования и технологии нужны для веб-разработчиков? Что учить дальше? <?php include '../include/description.php'; ?>'>
  <link rel='stylesheet' href='../styles/bigbtn.css'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_html.php'; ?>
<?php include '../include/before_content_html.php'; ?>

  <article>
    <h1>Вы изучили HTML.<span class='color_h1'> Что теперь изучать?</span></h1>
    <div class='w3-clear nextprev'>
      <a class='w3-left w3-btn' href='html_exam.php'>&#10094; Prev</a>
      <a class='w3-right w3-btn' href='html_accessibility.php'>Next &#10095;</a>
    </div>
    <hr>
    <h2>HTML Резюме</h2>
    <p>Этот учебник научил вас использовать <strong>HTML</strong> для создания собственного веб-сайта.</p>
    <p><strong>HTML</strong> является универсальным языком разметки для Web. <strong>HTML</strong> позволяет форматировать текст, добавлять графику, создавать ссылки, формы ввода, фреймы, таблицы и др., а также сохранять их в текстовом файле, который может читать и отображать любой веб-браузер.</p>
    <p>Для получения более подробной и дополнительной информации об <strong>HTML</strong>, пожалуйста, обратитесь к <a href='html_examples.php'>HTML примерам</a> и <a href='../tags/index.php'>HTML справочнику</a> на нашем сайте <strong>W3Schools на русском</strong>.</p>
    <hr>

    <h2>Теперь вы знаете HTML, что дальше?</h2>
    <p>Что необходимо изучать после изучения <strong>HTML</strong>?</p>
    <p>Как правило, после изучения <strong>HTML</strong> изучают также такие технологии, как <strong>CSS</strong> и <strong>JavaScript</strong> (для фронтенд-разработчиков).</p>
    <hr>

    <h2>Изучение CSS</h2>
    <p><strong>CSS</strong> позволяет стилизировать HTML-страницы.</p>
    <p><strong>CSS</strong> предоставляет полный контроль над макетом, не изменяя содержания документа.</p>
    <p>Чтобы узнать больше о <strong>CSS</strong>, посетите <a href='../css/index.php'>CSS учебник</a> на нашем сайте <strong>W3Schools на русском</strong>.</p>
    <hr>

    <h2>Изучение JavaScript</h2>
    <p><strong>JavaScript</strong> делает сайт более динамичным. Динамичный веб-сайт может реагировать на события и позволяет взаимодействовать с пользователем.</p>
    <p><strong>JavaScript</strong> является на сегодняшний день самым популярным скриптовым языком в Интернете (на стороне клиента), и он работает во всех основных браузерах.</p>
    <p>Если вы хотите узнать больше про <strong>JavaScript</strong>, пожалуйста, посетите <a href='../js/index.php'>JavaScript учебник</a> на нашем сайте <strong>W3Schools на русском</strong>.</p>
    <hr>

    <h2>Публикация веб-сайта</h2>
    <p>Чтобы сделать свой веб-сайт доступным для каждого в мире пользователя Интернет, его необходимо опубликовать в сети.</p>
    <p>Для этого у вас есть два варианта:</p>
    <ul>
      <li>Использование поставщика услуг Интернета (сервис-провайдера);</li>
      <li>Собственный хостинг веб-сайта.</li>
    </ul>
    <hr>

    <h2>Использование услуг сервис-провайдера Интернет</h2>
    <p>Интернет-провайдер (ISP - Internet Service Provider) - это компания, которая предоставляет услуги доступа к Интернету и использования Интернета.</p>
    <p>Интернет-услуги, которые обычно предоставляются Интернет-провайдерами, включают доступ к Интернету, Интернет-транзит, регистрацию доменного имени, веб-хостинг, услугу Usenet и колокацию.</p>
    <p>Использование почтавщика услуг Интернета (ISP - Интернет сервис-провайдера) является самым распространённым вариантом.</p>

    <h3>Преимущества:</h3>
    <ul>
      <li><strong>Скорость соединения</strong> - Провайдеры имеют очень скоростное соединение с Интернетом;</li>
      <li><strong>Мощное оборудование</strong> - Провайдеры имеют мощные веб-серверы, которые могут совместно использовать несколько клиентов. Можно также ожидать эффективной сбалансированной нагрузки и необходимых серверов резервного копирования;</li>
      <li><strong>Безопасность и стабильность</strong> - Провайдеры - это специалисты веб-хостинга. Вы получите намного больше свободного времени, самые новые исправления программного обеспечения и лучшую защиту от вирусов.</li>
    </ul>

    <h3>Что необходимо учитывать?</h3>

    <ul>
      <li><strong>24-часовая поддержка</strong> - Провайдер должен предложить 24-часовую поддержку. Бесплатный телефон также может быть жизненно важен;</li>
      <li><strong>Ежедневный бекап (резервное копирование)</strong> - Провайдер должен выполнять ежедневную процедуру резервного копирования;</li>
      <li><strong>Объём трафика</strong> - Проверьте ограничения объёма трафика поставщика услуг Интернета (не прекращайте платить деньги за неожиданно высокий трафик);</li>
      <li><strong>Ограничения пропускной способности или содержания</strong> - Проверьте пропускную способность провайдера и ограничения содержания (можно ли публиковать фотографии, видео или аудио?);</li>
      <li><strong>Возможности электронной почты</strong> - Убедитесь, что провайдер поддерживает необходимые возможности электронной почты;</li>
      <li><strong>Доступ к базе данных</strong> - Убедитесь, что провайдер поддерживает необходимый доступ к базе данных.</li>
    </ul>
    <hr>

    <h2>Хостинг собственного сайта на своём сервере</h2>
    <p>Хостинг собственного веб-сайта на вашем собственном сервере также является возможным.</p>

    <h3>Что необходимо учитывать?</h3>

    <ul>
      <li><strong>Затраты на оборудование</strong> - Чтобы запустить &quot;реальный&quot; веб-сайт, вы должны приобрести мощное серверное оборудование (обычный домашний ПК не будет выполнять необходимую работу). Вам также понадобится постоянное (24/7) высокоскоростное Интернет-соединение;</li>
      <li><strong>Затраты на программное обеспечение</strong> - Серверные лицензии часто превышают стоимость клиентских лицензий. Серверные лицензии также могут иметь ограничения на количество пользователей;</li>
      <li><strong>Затраты на оплату труда</strong> - Не ожидайте низких трудовых затрат. Вы должны установить собственное аппаратное и программное обеспечение. Вы также будете иметь дело с ошибками и вирусами, и должны содержать ваш сервер постоянно работающим.</li>
    </ul>
    <hr>

    <?php include '../include/footer_cert.php'; ?>

    <hr>
    <div class='w3-clear nextprev'>
      <a class='w3-left w3-btn' href='html_exam.php'>&#10094; Prev</a>
      <a class='w3-right w3-btn' href='html_accessibility.php'>Next &#10095;</a>
    </div>
  </article>
<?php include '../include/addown_content.php'; ?>
  </div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>