<?php include '../include/head.php'; ?>

<title>Статистика Интро. <?php include '../include/title.php'; ?></title>
<meta name='description' content='Учебник по Статистике. Интро. Для чего используется статистика? Типичные шаги статистических методов. Важные понятия. Статистика и программирование. Какие языки программирования используются в статистике? <?php include '../include/description.php'; ?>'>
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_stat.php'; ?>
<?php include '../include/before_content_stat.php'; ?>

<article>
    <h1>Статистика Интро</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="statistics_gathering_data.php">Next &#10095;</a>
    </div>
    <hr>
    <p class="intro"><strong>Статистика</strong> даёт нам методы получения знаний из данных.</p>
    <hr>

    <h2>Для чего используется статистика?</h2>
    <p>Статистика используется во всех областях науки и бизнеса.</p>
    <p>Статистика даёт нам более точные знания, которые помогают нам принимать более обоснованные и правильные решения.</p>
    <p>Статистика может сосредоточиться на том, чтобы делать <strong>прогнозы</strong> о том, что произойдет в будущем. Она также может сосредоточиться на <strong>объяснении</strong> того, как разные вещи связаны между собой.</p>
    <div class="w3-panel w3-info">
        <p><b>Примечание:</b> Хорошие статистические объяснения также полезны для прогнозов.</p>
    </div>
    <hr>
    <h2>Типичные шаги статистических методов</h2>
    <p>Типичные шаги:</p>
    <ul>
        <li>Сбор данных</li>
        <li>Описание и визуализация данных</li>
        <li>Делаем выводы</li>
    </ul>
    <p>Важно помнить обо всех трёх шагах при возникновении любых вопросов, о которых мы хотим узнать больше.</p>
    <p>Зная, какие типы данных доступны, вы будет знать, на какие вопросы вы можете ответить с помощью статистических методов.</p>
    <p>Знание того, на какие вопросы вы хотите ответить, поможет определить, какие данные вам нужны. Может быть доступно много данных, и важно знать, на чем сосредоточить внимание.</p>
    <hr>
    <h2>Как используется статистика? </h2>
    <p>Статистику можно использовать для точного объяснения вещей. Вы можете использовать её, чтобы понять и сделать выводы о группе, о которой вы хотите узнать больше. Эта группа называется <strong>совокупность</strong>.</p>
    <p>Совокупность может состоять из самых разных групп. Например:</p>
    <ul>
        <li>Все люди в стране</li>
        <li>Все компании в отрасли</li>
        <li>Все клиенты компании</li>
        <li>Все, кто играет в футбол, старше 45 лет...</li>
    </ul>
    <p>... и так далее - это просто зависит от того, что вы хотите знать.</p>
    <p>Сбор данных о совокупности даст вам <strong>выборку</strong>. Это часть всей совокупности. Затем для этой выборки используются статистические методы.</p>
    <p>Результаты статистических методов из выборки используются для <strong>выводов</strong> об основной совокупности.</p>
    <div class="w3-panel w3-note">
        <p><strong>Примечание:</strong> Слово &quot;статистика&quot; также может относиться к конкретным знаниям; как среднее значение чего-либо.</p>
    </div>
    <?php include '../include/addown_content.php'; ?>

    <h2>Важные понятия статистики</h2>
    <ul>
        <li>Прогнозы и объяснения</li>
        <li>Совокупности и выборки</li>
        <li>Параметры и выборки статистики</li>
        <li>Методы выборки</li>
        <li>Типы данных</li>
        <li>Уровень измерения</li>
        <li>Описательная статистика</li>
        <li>Случайные переменные</li>
        <li>Одномерная и многомерная статистика</li>
        <li>Расчет вероятности</li>
        <li>Распределение вероятностей</li>
        <li>Статистический вывод</li>
        <li>Оценка параметров</li>
        <li>Проверка гипотез</li>
        <li>Корреляция</li>
        <li>Регрессионный анализ</li>
        <li>Причинный вывод</li>
    </ul>
    <p>В данном учебнике мы рассмотрим эти темы шаг за шагом.</p>
    <hr>

    <h2>Статистика и программирование</h2>
    <p>Статистический анализ обычно выполняется с помощью компьютеров. Небольшие объемы данных можно достаточно хорошо проанализировать без компьютеров. </p>
    <p>Раньше весь анализ данных выполнялся вручную. Это занимало много времени и приводило к ошибкам.</p>
    <p>В настоящее время для анализа данных обычно используются программирование и программное обеспечение.</p>
    <p>В этом курсе мы покажем примеры кода для сбора статистики на языках программирования Python и R.</p>
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="statistics_gathering_data.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>