<?php include '../include/head.php'; ?>

<title>Статистика Прогнозирование и объяснение. <?php include '../include/title.php'; ?></title>
<meta name='description' content='Статистика Прогнозирование и объяснение. Предсказания о будущих событиях называются прогнозами. Не все прогнозы о будущем. Причинно-следственный вывод. <?php include '../include/description.php'; ?>'>
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_stat.php'; ?>
<?php include '../include/before_content_stat.php'; ?>

<article>
    <h1>Статистика - Прогнозирование и объяснение</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="statistics_making_conclusions.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="statistics_populations_and_samples.php">Next &#10095;</a>
    </div>
    <hr>
    <p class="intro">Некоторые типы статистических методов ориентированы на предсказание того, что произойдет.</p>
    <p class="intro">Другие типы статистических методов сосредоточены на объяснении взаимосвязи вещей.</p>
    <hr>
    <h2>Прогноз</h2>
    <p>Некоторые статистические методы не нацелены на объяснение взаимосвязи вещей. Важна только точность прогнозов.</p>
    <p>Многие статистические методы позволяют делать прогнозы без понимания того, как всё взаимосвязано.</p>
    <p>Некоторые типы машинного обучения позволяют компьютерам выполнять тяжелую работу, но то, как они предсказывают, трудно понять. Эти подходы также могут быть подвержены ошибкам при изменении обстоятельств, поскольку принцип их работы менее ясен.</p>
    <div class="w3-panel w3-note">
        <p><b>Примечание:</b> Предсказания о будущих событиях называются <strong>прогнозами</strong>. Не все прогнозы о будущем.</p>
        <p>Некоторые прогнозы могут относиться к чему-то ещё, что неизвестно, даже если этого не произойдет в будущем.</p>
    </div>
    <?php include '../include/addown_content.php'; ?>
    <h2>Объяснение</h2>
    <p>Для объяснения взаимосвязи между вещами часто используются различные статистические методы. Эти статистические методы могут не давать хороших прогнозов.</p>
    <p>Эти статистические методы часто объясняют лишь небольшие части всей ситуации. Но если вы хотите знать, как связаны некоторые вещи, все остальное может не иметь значения.</p>
    <p>Если эти методы точно объясняют, как все важные вещи связаны между собой, они также будут хороши в прогнозировании. Но объяснить каждую деталь часто бывает непросто.</p>
    <p>Иногда мы специально хотим выяснить, вызывает ли одно действие другое. Это называется <strong>причинно-следственным выводом</strong>. </p>
    <p>Если мы смотрим на сложные ситуации, многое связано. Чтобы выяснить, что к чему, нам нужно распутать все способы, которыми эти вещи связаны.</p>
    <div class="w3-panel w3-note">
        <p><b>Примечание:</b> Делать выводы о причинно-следственной связи следует осторожно.</p>
    </div>
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="statistics_making_conclusions.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="statistics_populations_and_samples.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>