<?php include '../include/head.php'; ?>

<title>Статистика Типы исследований. <?php include '../include/title.php'; ?></title>
<meta name='description' content='Статистика Типы исследований. Основные виды статистических исследований - наблюдательные и эспериментальные. <?php include '../include/description.php'; ?>'>
<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_stat.php'; ?>
<?php include '../include/before_content_stat.php'; ?>

<article>
    <h1>Статистика - Типы исследований</h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="statistics_parameters_and_statistics.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="statistics_sample_types.php">Next &#10095;</a>
    </div>
    <hr>
    <p class="intro"><strong>Статистическое исследование</strong> может быть частью процесса сбора данных.</p>
    <p class="intro">Существуют разные <strong>типы исследований</strong>. Некоторые лучше, чем другие, но с ними может быть сложнее.</p>
    <hr>
    <h3>Основные виды статистических исследований</h3>
    <p>Основными видами статистических исследований являются <strong>наблюдательные</strong> и <strong>экспериментальные</strong> исследования.</p>
    <p>Нас часто интересует, является ли что-то <strong>причиной</strong> другого явления.</p>
    <p>Экспериментальные исследования, как правило, лучше, чем наблюдательные исследования для изучения этого, но обычно требуют больше усилий и затрат.</p>
    <p>Наблюдательное исследование - это наблюдение и сбор данных, без изменений.</p>
    <?php include '../include/addown_content.php'; ?>
    <h3>Экспериментальные исследования</h3>
    <p>В экспериментальном исследовании меняются <strong>обстоятельства</strong> вокруг выборки. Обычно мы сравниваем две группы из совокупности, и к этим двум группам относятся <b>по-разному</b>.</p>
    <p>Одним из примеров может быть медицинское исследование, чтобы узнать, эффективно ли новое лекарство.</p>
    <p>Одна группа получает лекарство, а другая - нет. Это разные обстоятельства, связанные с этими выборками.</p>
    <p>Мы можем впоследствии сравнить состояние здоровья обеих групп и посмотреть, отличаются ли результаты.</p>
    <p>Экспериментальные исследования могут позволить нам изучить причинно-следственные связи. Хорошо спланированное экспериментальное исследование может быть полезным, поскольку оно может <strong>изолировать</strong> интересующие нас отношения от <strong>других эффектов</strong>. Тогда мы сможем быть более уверены в том, что измеряем истинный эффект.</p>
    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="statistics_parameters_and_statistics.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="statistics_sample_types.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>