<p>Если у вас есть какие-либо вопросы относительно экзамена, не стесняйтесь отправить электронное письмо по адресу:</p>
<p>exam@w3schools.com</p>
<hr>
<!--<h2>Ваш руководитель (супервайзер)</h2>
<p>Чтобы повысить надежность вашего сертификата, вы должны иметь супервайзера, который будет следить за вами при сдаче экзамена.</p>
<p>Вы должны выбрать своего собственного супервайзера.</p>
<p>Необходимо использовать супервайзера, чтобы убедиться, что вы не обманываете. Других особых критериев для супервайзера нет.</p>
<p>Имя и должность супервайзера будут напечатаны на сертификате, поэтому было бы разумно выбрать супервайзера, который повысит доверие к вашему сертификату (например, ваш начальник или учитель).</p>
<hr>-->
<h2>W3Schools Сертифицированное изображение</h2>
<p>Чтобы убедиться, что вы сертифицированы W3Schools, поместите изображение, приведенное ниже, на свой веб-сайт (щелкните изображение правой кнопкой мыши и выберите "Сохранить изображение как..."):</p>
<p><img src='../images/w3certified_logo.png' alt='W3Schools Сертификат' style='max-width:100%'></p>
<p>Затем сделайте изображение ссылкой и ссылайтесь на все ваши сертификаты W3Schools:</p>
<p>&lt;a href="https://certification.w3schools.com/w3certified.asp?email=<i style='color:blue'>ваш_email</i>"&gt;<br>
    &lt;img src="w3certified_logo.png" alt=&quot;W3Schools Сертификат&quot;/&gt;&lt;/a&gt;</p>
<p>или:</p>
<p>&lt;a href="https://certification.w3schools.com/w3certified.asp?id=<i style='color:blue'>ваш_id</i>"&gt;<br>
    &lt;img src="w3certified_logo.png" alt=&quot;W3Schools Сертификат&quot;/&gt;&lt;/a&gt;</p>
<p>Ваши Сертификаты на сайте W3Schools будут подтверждением вашего настоящего обучения и сдаче экзаменов на W3Schools.</p>
<hr>