<?php include '../include/head.php'; ?>
<title>PHP Интро. <?php include '../include/title.php'; ?></title>
<meta name='description' content='PHP Интро. Что такое PHP? Где применяется язык PHP? Как создать сайт с помощью PHP? Примеры коды. <?php include '../include/description.php'; ?>'>

<?php include '../include/topmenu.php'; ?>
<?php include '../include/leftmenu_php.php'; ?>
<?php include '../include/before_content_php.php'; ?>

<article>
    <h1>PHP <span class="color_h1">Интро</span></h1>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="php_install.php">Next &#10095;</a>
    </div>
    <hr>
    <h2>Где и как лучше всего изучать язык программирования PHP?</h2>
    <p>Конечно, вы можете поступить учиться программированию в какой-нибудь дорогой ВУЗ, платить большие деньги 4-5 лет, а потом получить Диплом программиста. Но где гарантия, что полученные за время учёбы в универе знания вам пригодятся в реальной жизни? Сфера IT очень быстро развивается, меняются технологии и может оказаться, что всё то, что вы учили в течение последних 4-5 лет в ВУЗе окажется устаревшим и вам всё равно придётся учиться снова. Языки программирования также развиваются и очень быстро меняются. Особенно это касается веб-технологий, к которым относится и такой популярный язык программирования, как <strong>PHP</strong>. Недавно популярная версия языка <strong>PHP 5.6</strong> уже стала устаревшей, и сейчас, по состоянию на 2020 год, актуальной версией является <strong>PHP7</strong>, которая также постоянно обновляется и в которой часто добавляются нововведения.</p>
    <p>Также можно изучать язык программирования <strong>PHP</strong> по книгам, которых существует огромное множество - как в печатном, так и в электронном виде. Книги по PHP можно приобрести за деньги либо скачать бесплатно в сети. Но, как правило, книги по современным веб-технологиям, в т.ч. по языку программирования PHP, также очень быстро устаревают и имеют материал, который уже через пару лет после выхода книги становится неактуальным.</p>
    <p>Для изучения языков программирования, в т.ч. <strong>PHP</strong>, существует множество курсов - как стационарных, когда необходимо посещать занятия, так и онлайн-курсов, когда всё обучение проходит в режиме онлайн. Такие курсы, как правило, платные и часто очень дорогостоящие. Кроме того, они направлены в большей степени не на то, чтобы научить реальному программированию, а лишь дать учащимся элементарные основы по программированию, и не дают ни фундаментальных знаний, ни каких-либо профессиональных навыков. Часто после таких курсов сложно трудоустроиться и вообще найти работу в какой-либо серъёзной компании. В лучшем случае такие начинающие программисты и веб-разработчики смогут попытаться зарабатывать небольшие деньги только лишь на фрилансе. И продолжать самостоятельно учиться и учиться, потратив на это еще немало времени. Лишь единицы таких самозанятых фрилансеров могут зарабатывать достойные деньги...</p>
    <p>Что же делать, где и как лучше всего изучать языки програмирования? Какой язык программирования выбрать? Стоит ли вообще изучать язык <strong>PHP</strong> или, может быть, выбрать какой-нибудь другой язык программирования? - спросите вы.</p>
    <p>Язык <strong>PHP</strong> является одним из самых популярных на сегодняшний день языков программирования и основным языком для разработки большинства веб-сайтов, работающих на CMS (системе управления контентом). Этот язык развивается, постоянно обновляется, на нём работают такие Интернет-гиганты, как Facebook, Wikipedia, Vkontakte и др. На нём продолжают создавать всё больше новых сайтов.</p>
    <p>При всём множестве выборе способов изучения языка программирования <strong>PHP</strong> одним из наиболее оптимальных является его изучение онлайн на самых популярных Интернет-ресурсах, которые поддерживаются и на которых информация постоянно обновляется. При этом такие ресурсы могут быть как платными, так и бесплатными. Есть очень много сайтов на английском языке, но есть и много на русском языке, на которых можно найти уроки для начинающих по PHP.</p>
    <p>Одним из таких ресурсов является сайт <strong>W3Schools.com</strong>, а также его русскоязычный аналог - сайт на русском языке - <strong>&quot;W3SChools на русском&quot;</strong>. Именно на нашем сайте вы сможете пройти полный курс обучения языку программирования PHP - от основ до уровня профессионала. При этом все материалы доступны абсолютно бесплатно! Для того, чтобы выучить PHP, вам необходимо пройти все уроки от начала до конца, от основ для начинающих, до более сложного продвинутого уровня.</p>
    <p>Не теряйте зря времени! Начинайте изучать PHP сегодня, прямо сейчас! Станьте настоящим профессиональным веб-разработчиком с помощью нашего сайта - <a href="../index.php">W3Schools на русском</a> - самого лучшего сайта на просторах рунета для всех, кто хочет стать настоящим высококлассным программистом!</p>
    <p>Итак, начнём!</p>
    <hr>
    <div class="w3-panel w3-warning intro">Запомните, <strong>PHP-код</strong> выполняется на сервере! Скрипт, написанный на PHP, нельзя запустить в браузере, если нет сервера (локального или на удалённом хостинге)!</div>
    <hr>

    <h2>Что вы должны уже знать</h2>
    <p>Прежде чем продолжить и приступить к изучению языка PHP, вы также должны иметь общее представление о следующих технологиях веб-разработки:</p>
    <ul>
        <li><a href="../html/index.php" title="Начать изучение HTML"><strong>HTML</strong></a></li>
        <li><a href="../css/index.php" title="Начать изучение CSS"><strong>CSS</strong></a></li>
        <li><a href="../js/index.php" title="Начать изучение JavaScript"><strong>JavaScript</strong></a></li>
    </ul>
    <p>Если вы хотите изучить <strong>уроки по HTML, CSS, JavaScript</strong>, вы их можете найти на Главной странице нашего сайта <a href="../index.php"><strong>W3Schools на русском</strong></a>.</p>
    <hr>

    <h2>Что такое PHP?</h2>
    <ul>
        <li><strong>PHP</strong> - это сокращение для &quot;PHP: Hypertext Preprocessor&quot; (PHP: гипертекстовый препроцессор)</li>
        <li><strong>PHP</strong> - широко используемый скриптовый язык с открытым исходным кодом</li>
        <li><strong>PHP</strong>-скрипты выполняются на сервере</li>
        <li><strong>PHP</strong> - бесплатен для скачивания и использования</li>
    </ul>

    <div class="w3-panel w3-note">
        <p><strong>PHP - удивительный и популярный язык!</strong></p>
        <p>Он достаточно мощный, чтобы быть в центре крупнейшей системы блогов в Интернете (WordPress)!<br>Он достаточно глубок, чтобы управлять крупнейшей социальной сетью (Facebook)!<br>Также он может быть достаточно легок для изучения новичкам, которые хотят выучить свой первый язык программирования, работающий на стороне сервера!</p></div>
    <hr>

    <h2>Что такое PHP файл?</h2>
    <ul>
        <li>PHP файлы  могут содержать обычный текст, HTML, CSS, JavaScript и код PHP</li>
        <li>PHP-код выполняется на сервере, а результат возвращается в браузер в виде обычного HTML-кода</li>
        <li>PHP файлы имеют расширение &quot;<code class="w3-codespan">.php</code>&quot;</li>
    </ul>
    <hr>

    <h2>Что может делать PHP?</h2>
    <ul>
        <li>PHP может генерировать динамическое содержимое страницы</li>
        <li>PHP может создавать, открывать, читать, писать, удалять и закрывать файлы на сервере</li>
        <li>PHP может собирать данные формы</li>
        <li>PHP может отправлять и получать куки</li>
        <li>PHP может добавлять, удалять, изменять данные в вашей базе данных</li>
        <li>PHP может быть использован для контроля доступа пользователей</li>
        <li>PHP может зашифровать данные</li>
    </ul>
    <p>С PHP вы не ограничены в выводе HTML. Вы можете выводить изображения, файлы PDF и даже флэш-фильмы. Вы также можете вывести любой текст, например, XHTML и XML.</p>
    <hr>

    <h2>Почему PHP?</h2>
    <ul>
        <li>PHP работает на разных платформах (Windows, Linux, Unix, Mac OS X и т.д.)</li>
        <li>PHP совместим практически со всеми серверами, используемыми сегодня (Apache, IIS и т.д.)</li>
        <li>PHP поддерживает широкий спектр баз данных</li>
        <li>PHP бесплатный. Загрузите его с официального ресурса PHP: <a target="_blank" href="http://www.php.net/">www.php.net</a></li>
        <li>PHP прост в изучении и эффективно работает на стороне сервера</li>
    </ul>
    <hr>

    <h2>Что нового в PHP 7</h2>
    <ul>
        <li>PHP 7 намного быстрее, чем предыдущий популярный стабильный релиз (PHP 5.6)</li>
        <li>В PHP 7 улучшена обработка ошибок</li>
        <li>PHP 7 поддерживает более строгие объявления типов для аргументов функций</li>
        <li>PHP 7 поддерживает новые операторы (например, оператор spaceship: <code class="w3-codespan">&lt;=&gt;</code> )</li>
    </ul>
    <hr>

    <h2>Актуальная версия PHP</h2>
    <p>Язык PHP постоянно обновляется. Наиболее популярной стабильной версией является <strong>PHP 7.4.24</strong> (выпущена 23.09.2021 года). Но на <a href="https://www.php.net/" target="_blank" rel="nofollow">официальном сайте</a> также доступна для скачивания текущая стабильная версия <strong>PHP 8.0.11</strong> (выпущена 23.09.2021 года).</p>
    <p>Этот релиз знаменует собой последний крупный выпуск языка PHP. Версия <strong>PHP 8</strong> содержит множество улучшений и новых функций, таких как:</p>
    <ul>
        <li>Union Types</li>
        <li>Named Arguments</li>
        <li>Match Expressions</li>
        <li>Attributes</li>
        <li>Constructor Property Promotion</li>
        <li>Nullsafe Operator</li>
        <li>Weak Maps</li>
        <li>Just In Time Compilation</li>
        <li>И многое другое...</li>
    </ul>
    <p>Посмотрите <a href="https://www.php.net/downloads" target="_blank" rel="nofollow">PHP 8</a> на официальном сайте для получения дополнительной информации.</p>
    <p>Для тестирования доступна версия <a href="https://downloads.php.net/~ramsey/" target="_blank" rel="nofollow">PHP 8.1.0 RC 3</a></p>

    <hr>
    <div class="w3-clear nextprev">
        <a class="w3-left w3-btn" href="index.php">&#10094; Prev</a>
        <a class="w3-right w3-btn" href="php_install.php">Next &#10095;</a>
    </div>
</article>
<?php include '../include/addown_content.php'; ?>
</div>
<?php include '../include/rightbar.php'; ?>
<?php include '../include/footer.php'; ?>